pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * AOI_BFCRT23 - Boolean Function Term 2 and 3 Configuration Register for EVENTn
 ******************************************************************************/

/*!
 * @brief AOI_BFCRT23 - Boolean Function Term 2 and 3 Configuration Register for EVENTn (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire AOI_BFCRT23 register
 */
/*@{*/
#define AOI_RD_BFCRT23(base, index) (AOI_BFCRT23_REG(base, index))
#define AOI_WR_BFCRT23(base, index, value) (AOI_BFCRT23_REG(base, index) = (value))
#define AOI_RMW_BFCRT23(base, index, mask, value) (AOI_WR_BFCRT23(base, index, (AOI_RD_BFCRT23(base, index) & ~(mask)) | (value)))
#define AOI_SET_BFCRT23(base, index, value) (BME_OR16(&AOI_BFCRT23_REG(base, index), (uint16_t)(value)))
#define AOI_CLR_BFCRT23(base, index, value) (BME_AND16(&AOI_BFCRT23_REG(base, index), (uint16_t)(~(value))))
#define AOI_TOG_BFCRT23(base, index, value) (BME_XOR16(&AOI_BFCRT23_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AOI_BFCRT23 bitfields
 */

/*!
 * @name Register AOI_BFCRT23, field PT3_DC[1:0] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input D in product term 3.
 *
 * Values:
 * - 0b00 - Force the D input in this product term to a logical zero
 * - 0b01 - Pass the D input in this product term
 * - 0b10 - Complement the D input in this product term
 * - 0b11 - Force the D input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT23_PT3_DC field. */
#define AOI_RD_BFCRT23_PT3_DC(base, index) ((AOI_BFCRT23_REG(base, index) & AOI_BFCRT23_PT3_DC_MASK) >> AOI_BFCRT23_PT3_DC_SHIFT)
#define AOI_BRD_BFCRT23_PT3_DC(base, index) (BME_UBFX16(&AOI_BFCRT23_REG(base, index), AOI_BFCRT23_PT3_DC_SHIFT, AOI_BFCRT23_PT3_DC_WIDTH))

/*! @brief Set the PT3_DC field to a new value. */
#define AOI_WR_BFCRT23_PT3_DC(base, index, value) (AOI_RMW_BFCRT23(base, index, AOI_BFCRT23_PT3_DC_MASK, AOI_BFCRT23_PT3_DC(value)))
#define AOI_BWR_BFCRT23_PT3_DC(base, index, value) (BME_BFI16(&AOI_BFCRT23_REG(base, index), ((uint16_t)(value) << AOI_BFCRT23_PT3_DC_SHIFT), AOI_BFCRT23_PT3_DC_SHIFT, AOI_BFCRT23_PT3_DC_WIDTH))
/*@}*/

/*!
 * @name Register AOI_BFCRT23, field PT3_CC[3:2] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input C in product term 3.
 *
 * Values:
 * - 0b00 - Force the C input in this product term to a logical zero
 * - 0b01 - Pass the C input in this product term
 * - 0b10 - Complement the C input in this product term
 * - 0b11 - Force the C input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT23_PT3_CC field. */
#define AOI_RD_BFCRT23_PT3_CC(base, index) ((AOI_BFCRT23_REG(base, index) & AOI_BFCRT23_PT3_CC_MASK) >> AOI_BFCRT23_PT3_CC_SHIFT)
#define AOI_BRD_BFCRT23_PT3_CC(base, index) (BME_UBFX16(&AOI_BFCRT23_REG(base, index), AOI_BFCRT23_PT3_CC_SHIFT, AOI_BFCRT23_PT3_CC_WIDTH))

/*! @brief Set the PT3_CC field to a new value. */
#define AOI_WR_BFCRT23_PT3_CC(base, index, value) (AOI_RMW_BFCRT23(base, index, AOI_BFCRT23_PT3_CC_MASK, AOI_BFCRT23_PT3_CC(value)))
#define AOI_BWR_BFCRT23_PT3_CC(base, index, value) (BME_BFI16(&AOI_BFCRT23_REG(base, index), ((uint16_t)(value) << AOI_BFCRT23_PT3_CC_SHIFT), AOI_BFCRT23_PT3_CC_SHIFT, AOI_BFCRT23_PT3_CC_WIDTH))
/*@}*/

/*!
 * @name Register AOI_BFCRT23, field PT3_BC[5:4] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input B in product term 3.
 *
 * Values:
 * - 0b00 - Force the B input in this product term to a logical zero
 * - 0b01 - Pass the B input in this product term
 * - 0b10 - Complement the B input in this product term
 * - 0b11 - Force the B input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT23_PT3_BC field. */
#define AOI_RD_BFCRT23_PT3_BC(base, index) ((AOI_BFCRT23_REG(base, index) & AOI_BFCRT23_PT3_BC_MASK) >> AOI_BFCRT23_PT3_BC_SHIFT)
#define AOI_BRD_BFCRT23_PT3_BC(base, index) (BME_UBFX16(&AOI_BFCRT23_REG(base, index), AOI_BFCRT23_PT3_BC_SHIFT, AOI_BFCRT23_PT3_BC_WIDTH))

/*! @brief Set the PT3_BC field to a new value. */
#define AOI_WR_BFCRT23_PT3_BC(base, index, value) (AOI_RMW_BFCRT23(base, index, AOI_BFCRT23_PT3_BC_MASK, AOI_BFCRT23_PT3_BC(value)))
#define AOI_BWR_BFCRT23_PT3_BC(base, index, value) (BME_BFI16(&AOI_BFCRT23_REG(base, index), ((uint16_t)(value) << AOI_BFCRT23_PT3_BC_SHIFT), AOI_BFCRT23_PT3_BC_SHIFT, AOI_BFCRT23_PT3_BC_WIDTH))
/*@}*/

/*!
 * @name Register AOI_BFCRT23, field PT3_AC[7:6] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input A in product term 3.
 *
 * Values:
 * - 0b00 - Force the A input in this product term to a logical zero
 * - 0b01 - Pass the A input in this product term
 * - 0b10 - Complement the A input in this product term
 * - 0b11 - Force the A input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT23_PT3_AC field. */
#define AOI_RD_BFCRT23_PT3_AC(base, index) ((AOI_BFCRT23_REG(base, index) & AOI_BFCRT23_PT3_AC_MASK) >> AOI_BFCRT23_PT3_AC_SHIFT)
#define AOI_BRD_BFCRT23_PT3_AC(base, index) (BME_UBFX16(&AOI_BFCRT23_REG(base, index), AOI_BFCRT23_PT3_AC_SHIFT, AOI_BFCRT23_PT3_AC_WIDTH))

/*! @brief Set the PT3_AC field to a new value. */
#define AOI_WR_BFCRT23_PT3_AC(base, index, value) (AOI_RMW_BFCRT23(base, index, AOI_BFCRT23_PT3_AC_MASK, AOI_BFCRT23_PT3_AC(value)))
#define AOI_BWR_BFCRT23_PT3_AC(base, index, value) (BME_BFI16(&AOI_BFCRT23_REG(base, index), ((uint16_t)(value) << AOI_BFCRT23_PT3_AC_SHIFT), AOI_BFCRT23_PT3_AC_SHIFT, AOI_BFCRT23_PT3_AC_WIDTH))
/*@}*/

/*!
 * @name Register AOI_BFCRT23, field PT2_DC[9:8] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input D in product term 2.
 *
 * Values:
 * - 0b00 - Force the D input in this product term to a logical zero
 * - 0b01 - Pass the D input in this product term
 * - 0b10 - Complement the D input in this product term
 * - 0b11 - Force the D input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT23_PT2_DC field. */
#define AOI_RD_BFCRT23_PT2_DC(base, index) ((AOI_BFCRT23_REG(base, index) & AOI_BFCRT23_PT2_DC_MASK) >> AOI_BFCRT23_PT2_DC_SHIFT)
#define AOI_BRD_BFCRT23_PT2_DC(base, index) (BME_UBFX16(&AOI_BFCRT23_REG(base, index), AOI_BFCRT23_PT2_DC_SHIFT, AOI_BFCRT23_PT2_DC_WIDTH))

/*! @brief Set the PT2_DC field to a new value. */
#define AOI_WR_BFCRT23_PT2_DC(base, index, value) (AOI_RMW_BFCRT23(base, index, AOI_BFCRT23_PT2_DC_MASK, AOI_BFCRT23_PT2_DC(value)))
#define AOI_BWR_BFCRT23_PT2_DC(base, index, value) (BME_BFI16(&AOI_BFCRT23_REG(base, index), ((uint16_t)(value) << AOI_BFCRT23_PT2_DC_SHIFT), AOI_BFCRT23_PT2_DC_SHIFT, AOI_BFCRT23_PT2_DC_WIDTH))
/*@}*/

/*!
 * @name Register AOI_BFCRT23, field PT2_CC[11:10] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input C in product term 2.
 *
 * Values:
 * - 0b00 - Force the C input in this product term to a logical zero
 * - 0b01 - Pass the C input in this product term
 * - 0b10 - Complement the C input in this product term
 * - 0b11 - Force the C input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT23_PT2_CC field. */
#define AOI_RD_BFCRT23_PT2_CC(base, index) ((AOI_BFCRT23_REG(base, index) & AOI_BFCRT23_PT2_CC_MASK) >> AOI_BFCRT23_PT2_CC_SHIFT)
#define AOI_BRD_BFCRT23_PT2_CC(base, index) (BME_UBFX16(&AOI_BFCRT23_REG(base, index), AOI_BFCRT23_PT2_CC_SHIFT, AOI_BFCRT23_PT2_CC_WIDTH))

/*! @brief Set the PT2_CC field to a new value. */
#define AOI_WR_BFCRT23_PT2_CC(base, index, value) (AOI_RMW_BFCRT23(base, index, AOI_BFCRT23_PT2_CC_MASK, AOI_BFCRT23_PT2_CC(value)))
#define AOI_BWR_BFCRT23_PT2_CC(base, index, value) (BME_BFI16(&AOI_BFCRT23_REG(base, index), ((uint16_t)(value) << AOI_BFCRT23_PT2_CC_SHIFT), AOI_BFCRT23_PT2_CC_SHIFT, AOI_BFCRT23_PT2_CC_WIDTH))
/*@}*/

/*!
 * @name Register AOI_BFCRT23, field PT2_BC[13:12] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input B in product term 2.
 *
 * Values:
 * - 0b00 - Force the B input in this product term to a logical zero
 * - 0b01 - Pass the B input in this product term
 * - 0b10 - Complement the B input in this product term
 * - 0b11 - Force the B input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT23_PT2_BC field. */
#define AOI_RD_BFCRT23_PT2_BC(base, index) ((AOI_BFCRT23_REG(base, index) & AOI_BFCRT23_PT2_BC_MASK) >> AOI_BFCRT23_PT2_BC_SHIFT)
#define AOI_BRD_BFCRT23_PT2_BC(base, index) (BME_UBFX16(&AOI_BFCRT23_REG(base, index), AOI_BFCRT23_PT2_BC_SHIFT, AOI_BFCRT23_PT2_BC_WIDTH))

/*! @brief Set the PT2_BC field to a new value. */
#define AOI_WR_BFCRT23_PT2_BC(base, index, value) (AOI_RMW_BFCRT23(base, index, AOI_BFCRT23_PT2_BC_MASK, AOI_BFCRT23_PT2_BC(value)))
#define AOI_BWR_BFCRT23_PT2_BC(base, index, value) (BME_BFI16(&AOI_BFCRT23_REG(base, index), ((uint16_t)(value) << AOI_BFCRT23_PT2_BC_SHIFT), AOI_BFCRT23_PT2_BC_SHIFT, AOI_BFCRT23_PT2_BC_WIDTH))
/*@}*/

/*!
 * @name Register AOI_BFCRT23, field PT2_AC[15:14] (RW)
 *
 * This 2-bit field defines the Boolean evaluation associated with the selected
 * input A in product term 2.
 *
 * Values:
 * - 0b00 - Force the A input in this product term to a logical zero
 * - 0b01 - Pass the A input in this product term
 * - 0b10 - Complement the A input in this product term
 * - 0b11 - Force the A input in this product term to a logical one
 */
/*@{*/
/*! @brief Read current value of the AOI_BFCRT23_PT2_AC field. */
#define AOI_RD_BFCRT23_PT2_AC(base, index) ((AOI_BFCRT23_REG(base, index) & AOI_BFCRT23_PT2_AC_MASK) >> AOI_BFCRT23_PT2_AC_SHIFT)
#define AOI_BRD_BFCRT23_PT2_AC(base, index) (BME_UBFX16(&AOI_BFCRT23_REG(base, index), AOI_BFCRT23_PT2_AC_SHIFT, AOI_BFCRT23_PT2_AC_WIDTH))

/*! @brief Set the PT2_AC field to a new value. */
#define AOI_WR_BFCRT23_PT2_AC(base, index, value) (AOI_RMW_BFCRT23(base, index, AOI_BFCRT23_PT2_AC_MASK, AOI_BFCRT23_PT2_AC(value)))
#define AOI_BWR_BFCRT23_PT2_AC(base, index, value) (BME_BFI16(&AOI_BFCRT23_REG(base, index), ((uint16_t)(value) << AOI_BFCRT23_PT2_AC_SHIFT), AOI_BFCRT23_PT2_AC_SHIFT, AOI_BFCRT23_PT2_AC_WIDTH))
/*@}*/

