pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * CAN_IMASK1 - Interrupt Masks 1 register
 ******************************************************************************/

/*!
 * @brief CAN_IMASK1 - Interrupt Masks 1 register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register allows any number of a range of the 32 Message Buffer
 * Interrupts to be enabled or disabled for MB31 to MB0. It contains one interrupt mask
 * bit per buffer, enabling the CPU to determine which buffer generates an
 * interrupt after a successful transmission or reception, that is, when the
 * corresponding IFLAG1 bit is set.
 */
/*!
 * @name Constants and macros for entire CAN_IMASK1 register
 */
/*@{*/
#define CAN_RD_IMASK1(base)      (CAN_IMASK1_REG(base))
#define CAN_WR_IMASK1(base, value) (CAN_IMASK1_REG(base) = (value))
#define CAN_RMW_IMASK1(base, mask, value) (CAN_WR_IMASK1(base, (CAN_RD_IMASK1(base) & ~(mask)) | (value)))
#define CAN_SET_IMASK1(base, value) (BME_OR32(&CAN_IMASK1_REG(base), (uint32_t)(value)))
#define CAN_CLR_IMASK1(base, value) (BME_AND32(&CAN_IMASK1_REG(base), (uint32_t)(~(value))))
#define CAN_TOG_IMASK1(base, value) (BME_XOR32(&CAN_IMASK1_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * CAN_IFLAG1 - Interrupt Flags 1 register
 ******************************************************************************/

/*!
 * @brief CAN_IFLAG1 - Interrupt Flags 1 register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register defines the flags for the 32 Message Buffer interrupts for MB31
 * to MB0. It contains one interrupt flag bit per buffer. Each successful
 * transmission or reception sets the corresponding IFLAG1 bit. If the corresponding
 * IMASK1 bit is set, an interrupt will be generated. The interrupt flag must be
 * cleared by writing 1 to it. Writing 0 has no effect. There is an exception when
 * DMA for Rx FIFO is enabled. The BUF7I to BUF5I flags are also used to
 * represent FIFO interrupts when the Rx FIFO is enabled. When the bit MCR[RFEN] is set
 * and the bit MCR[DMA] is negated, the function of the 8 least significant
 * interrupt flags BUF[7:0]I changes: BUF7I, BUF6I and BUF5I indicate operating
 * conditions of the FIFO, BUF0I is used to empty FIFO, while BUF4I to BUF1I bits are
 * reserved. Before enabling the RFEN, the CPU must service the IFLAG bits asserted
 * in the Rx FIFO region; see Section "Rx FIFO". Otherwise, these IFLAG bits
 * will mistakenly show the related MBs now belonging to FIFO as having contents to
 * be serviced. When the RFEN bit is negated, the FIFO flags must be cleared. The
 * same care must be taken when an RFFN value is selected extending Rx FIFO
 * filters beyond MB7. For example, when RFFN is 0x8, the MB0-23 range is occupied by
 * Rx FIFO filters and related IFLAG bits must be cleared. When both the
 * MCR[RFEN] and MCR[DMA] bits are asserted (DMA feature for Rx FIFO enabled), the
 * function of the 8 least significant interrupt flags (BUF7I - BUF0I) are changed to
 * support the DMA operation. BUF7I and BUF6I are not used, as well as, BUF4I to
 * BUF1I. BUF5I indicates operating condition of FIFO, and BUF0I is used to empty
 * FIFO. Moreover, BUF5I does not generate a CPU interrupt, but generates a DMA
 * request. IMASK1 bits in Rx FIFO region are not considered when bit MCR[DMA] is
 * enabled. In addition the CPU must not clear the flag BUF5I when DMA is
 * enabled. Before enabling the bit MCR[DMA], the CPU must service the IFLAGs asserted
 * in the Rx FIFO region. When the bit MCR[DMA] is negated, the FIFO must be
 * empty. Before updating MCR[MAXMB] field, CPU must service the IFLAG1 bits whose MB
 * value is greater than the MCR[MAXMB] to be updated; otherwise, they will
 * remain set and be inconsistent with the number of MBs available.
 */
/*!
 * @name Constants and macros for entire CAN_IFLAG1 register
 */
/*@{*/
#define CAN_RD_IFLAG1(base)      (CAN_IFLAG1_REG(base))
#define CAN_WR_IFLAG1(base, value) (CAN_IFLAG1_REG(base) = (value))
#define CAN_RMW_IFLAG1(base, mask, value) (CAN_WR_IFLAG1(base, (CAN_RD_IFLAG1(base) & ~(mask)) | (value)))
#define CAN_SET_IFLAG1(base, value) (BME_OR32(&CAN_IFLAG1_REG(base), (uint32_t)(value)))
#define CAN_CLR_IFLAG1(base, value) (BME_AND32(&CAN_IFLAG1_REG(base), (uint32_t)(~(value))))
#define CAN_TOG_IFLAG1(base, value) (BME_XOR32(&CAN_IFLAG1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual CAN_IFLAG1 bitfields
 */

/*!
 * @name Register CAN_IFLAG1, field BUF0I[0] (W1C)
 *
 * When the RFEN bit in MCR is cleared (Rx FIFO disabled), this bit flags the
 * interrupt for MB0. If the Rx FIFO is enabled, this bit is used to trigger the
 * clear FIFO operation. This operation empties FIFO contents. Before performing
 * this operation the CPU must service all FIFO related IFLAGs. When the bit
 * MCR[DMA] is enabled this operation also clears the BUF5I flag and consequently abort
 * the DMA request. The clear FIFO operation occurs when the CPU writes 1 in
 * BUF0I. It is only allowed in Freeze Mode and is blocked by hardware in other
 * conditions.
 *
 * Values:
 * - 0b0 - The corresponding buffer has no occurrence of successfully completed
 *     transmission or reception when MCR[RFEN]=0.
 * - 0b1 - The corresponding buffer has successfully completed transmission or
 *     reception when MCR[RFEN]=0.
 */
/*@{*/
/*! @brief Read current value of the CAN_IFLAG1_BUF0I field. */
#define CAN_RD_IFLAG1_BUF0I(base) ((CAN_IFLAG1_REG(base) & CAN_IFLAG1_BUF0I_MASK) >> CAN_IFLAG1_BUF0I_SHIFT)
#define CAN_BRD_IFLAG1_BUF0I(base) (BME_UBFX32(&CAN_IFLAG1_REG(base), CAN_IFLAG1_BUF0I_SHIFT, CAN_IFLAG1_BUF0I_WIDTH))

/*! @brief Set the BUF0I field to a new value. */
#define CAN_WR_IFLAG1_BUF0I(base, value) (CAN_RMW_IFLAG1(base, (CAN_IFLAG1_BUF0I_MASK | CAN_IFLAG1_BUF4TO1I_MASK | CAN_IFLAG1_BUF6I_MASK | CAN_IFLAG1_BUF7I_MASK | CAN_IFLAG1_BUF31TO8I_MASK), CAN_IFLAG1_BUF0I(value)))
#define CAN_BWR_IFLAG1_BUF0I(base, value) (BME_BFI32(&CAN_IFLAG1_REG(base), ((uint32_t)(value) << CAN_IFLAG1_BUF0I_SHIFT), CAN_IFLAG1_BUF0I_SHIFT, CAN_IFLAG1_BUF0I_WIDTH))
/*@}*/

/*!
 * @name Register CAN_IFLAG1, field BUF4TO1I[4:1] (W1C)
 *
 * When the RFEN bit in the MCR is cleared (Rx FIFO disabled), these bits flag
 * the interrupts for MB4 to MB1. These flags are cleared by the FlexCAN whenever
 * the bit MCR[RFEN] is changed by CPU writes. The BUF4TO1I flags are reserved
 * when MCR[RFEN] is set.
 *
 * Values:
 * - 0b0000 - The corresponding buffer has no occurrence of successfully
 *     completed transmission or reception when MCR[RFEN]=0.
 * - 0b0001 - The corresponding buffer has successfully completed transmission
 *     or reception when MCR[RFEN]=0.
 */
/*@{*/
/*! @brief Read current value of the CAN_IFLAG1_BUF4TO1I field. */
#define CAN_RD_IFLAG1_BUF4TO1I(base) ((CAN_IFLAG1_REG(base) & CAN_IFLAG1_BUF4TO1I_MASK) >> CAN_IFLAG1_BUF4TO1I_SHIFT)
#define CAN_BRD_IFLAG1_BUF4TO1I(base) (BME_UBFX32(&CAN_IFLAG1_REG(base), CAN_IFLAG1_BUF4TO1I_SHIFT, CAN_IFLAG1_BUF4TO1I_WIDTH))

