pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the CODE field to a new value. */
#define CAN_WR_CS_CODE(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_CODE_MASK, CAN_CS_CODE(value)))
#define CAN_BWR_CS_CODE(base, index, value) (BME_BFI32(&CAN_CS_REG(base, index), ((uint32_t)(value) << CAN_CS_CODE_SHIFT), CAN_CS_CODE_SHIFT, CAN_CS_CODE_WIDTH))
/*@}*/

/*!
 * @name Register CAN_CS, field ESI[29] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_ESI field. */
#define CAN_RD_CS_ESI(base, index) ((CAN_CS_REG(base, index) & CAN_CS_ESI_MASK) >> CAN_CS_ESI_SHIFT)
#define CAN_BRD_CS_ESI(base, index) (BME_UBFX32(&CAN_CS_REG(base, index), CAN_CS_ESI_SHIFT, CAN_CS_ESI_WIDTH))

/*! @brief Set the ESI field to a new value. */
#define CAN_WR_CS_ESI(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_ESI_MASK, CAN_CS_ESI(value)))
#define CAN_BWR_CS_ESI(base, index, value) (BME_BFI32(&CAN_CS_REG(base, index), ((uint32_t)(value) << CAN_CS_ESI_SHIFT), CAN_CS_ESI_SHIFT, CAN_CS_ESI_WIDTH))
/*@}*/

/*!
 * @name Register CAN_CS, field BRS[30] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_BRS field. */
#define CAN_RD_CS_BRS(base, index) ((CAN_CS_REG(base, index) & CAN_CS_BRS_MASK) >> CAN_CS_BRS_SHIFT)
#define CAN_BRD_CS_BRS(base, index) (BME_UBFX32(&CAN_CS_REG(base, index), CAN_CS_BRS_SHIFT, CAN_CS_BRS_WIDTH))

/*! @brief Set the BRS field to a new value. */
#define CAN_WR_CS_BRS(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_BRS_MASK, CAN_CS_BRS(value)))
#define CAN_BWR_CS_BRS(base, index, value) (BME_BFI32(&CAN_CS_REG(base, index), ((uint32_t)(value) << CAN_CS_BRS_SHIFT), CAN_CS_BRS_SHIFT, CAN_CS_BRS_WIDTH))
/*@}*/

/*!
 * @name Register CAN_CS, field EDL[31] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_CS_EDL field. */
#define CAN_RD_CS_EDL(base, index) ((CAN_CS_REG(base, index) & CAN_CS_EDL_MASK) >> CAN_CS_EDL_SHIFT)
#define CAN_BRD_CS_EDL(base, index) (BME_UBFX32(&CAN_CS_REG(base, index), CAN_CS_EDL_SHIFT, CAN_CS_EDL_WIDTH))

/*! @brief Set the EDL field to a new value. */
#define CAN_WR_CS_EDL(base, index, value) (CAN_RMW_CS(base, index, CAN_CS_EDL_MASK, CAN_CS_EDL(value)))
#define CAN_BWR_CS_EDL(base, index, value) (BME_BFI32(&CAN_CS_REG(base, index), ((uint32_t)(value) << CAN_CS_EDL_SHIFT), CAN_CS_EDL_SHIFT, CAN_CS_EDL_WIDTH))
/*@}*/

/*******************************************************************************
 * CAN_ID - Message Buffer 0 ID Register
 ******************************************************************************/

/*!
 * @brief CAN_ID - Message Buffer 0 ID Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire CAN_ID register
 */
/*@{*/
#define CAN_RD_ID(base, index)   (CAN_ID_REG(base, index))
#define CAN_WR_ID(base, index, value) (CAN_ID_REG(base, index) = (value))
#define CAN_RMW_ID(base, index, mask, value) (CAN_WR_ID(base, index, (CAN_RD_ID(base, index) & ~(mask)) | (value)))
#define CAN_SET_ID(base, index, value) (BME_OR32(&CAN_ID_REG(base, index), (uint32_t)(value)))
#define CAN_CLR_ID(base, index, value) (BME_AND32(&CAN_ID_REG(base, index), (uint32_t)(~(value))))
#define CAN_TOG_ID(base, index, value) (BME_XOR32(&CAN_ID_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual CAN_ID bitfields
 */

/*!
 * @name Register CAN_ID, field EXT[17:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_ID_EXT field. */
#define CAN_RD_ID_EXT(base, index) ((CAN_ID_REG(base, index) & CAN_ID_EXT_MASK) >> CAN_ID_EXT_SHIFT)
#define CAN_BRD_ID_EXT(base, index) (CAN_RD_ID_EXT(base, index))

/*! @brief Set the EXT field to a new value. */
#define CAN_WR_ID_EXT(base, index, value) (CAN_RMW_ID(base, index, CAN_ID_EXT_MASK, CAN_ID_EXT(value)))
#define CAN_BWR_ID_EXT(base, index, value) (CAN_WR_ID_EXT(base, index, value))
/*@}*/

/*!
 * @name Register CAN_ID, field STD[28:18] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_ID_STD field. */
#define CAN_RD_ID_STD(base, index) ((CAN_ID_REG(base, index) & CAN_ID_STD_MASK) >> CAN_ID_STD_SHIFT)
#define CAN_BRD_ID_STD(base, index) (CAN_RD_ID_STD(base, index))

/*! @brief Set the STD field to a new value. */
#define CAN_WR_ID_STD(base, index, value) (CAN_RMW_ID(base, index, CAN_ID_STD_MASK, CAN_ID_STD(value)))
#define CAN_BWR_ID_STD(base, index, value) (CAN_WR_ID_STD(base, index, value))
/*@}*/

/*!
 * @name Register CAN_ID, field PRIO[31:29] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_ID_PRIO field. */
#define CAN_RD_ID_PRIO(base, index) ((CAN_ID_REG(base, index) & CAN_ID_PRIO_MASK) >> CAN_ID_PRIO_SHIFT)
#define CAN_BRD_ID_PRIO(base, index) (BME_UBFX32(&CAN_ID_REG(base, index), CAN_ID_PRIO_SHIFT, CAN_ID_PRIO_WIDTH))

/*! @brief Set the PRIO field to a new value. */
#define CAN_WR_ID_PRIO(base, index, value) (CAN_RMW_ID(base, index, CAN_ID_PRIO_MASK, CAN_ID_PRIO(value)))
#define CAN_BWR_ID_PRIO(base, index, value) (BME_BFI32(&CAN_ID_REG(base, index), ((uint32_t)(value) << CAN_ID_PRIO_SHIFT), CAN_ID_PRIO_SHIFT, CAN_ID_PRIO_WIDTH))
/*@}*/

/*******************************************************************************
 * CAN_WORD0 - Message Buffer 0 WORD0 Register
 ******************************************************************************/

/*!
 * @brief CAN_WORD0 - Message Buffer 0 WORD0 Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire CAN_WORD0 register
 */
/*@{*/
#define CAN_RD_WORD0(base, index) (CAN_WORD0_REG(base, index))
#define CAN_WR_WORD0(base, index, value) (CAN_WORD0_REG(base, index) = (value))
#define CAN_RMW_WORD0(base, index, mask, value) (CAN_WR_WORD0(base, index, (CAN_RD_WORD0(base, index) & ~(mask)) | (value)))
#define CAN_SET_WORD0(base, index, value) (BME_OR32(&CAN_WORD0_REG(base, index), (uint32_t)(value)))
#define CAN_CLR_WORD0(base, index, value) (BME_AND32(&CAN_WORD0_REG(base, index), (uint32_t)(~(value))))
#define CAN_TOG_WORD0(base, index, value) (BME_XOR32(&CAN_WORD0_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual CAN_WORD0 bitfields
 */

/*!
 * @name Register CAN_WORD0, field DATA_BYTE_3[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD0_DATA_BYTE_3 field. */
#define CAN_RD_WORD0_DATA_BYTE_3(base, index) ((CAN_WORD0_REG(base, index) & CAN_WORD0_DATA_BYTE_3_MASK) >> CAN_WORD0_DATA_BYTE_3_SHIFT)
#define CAN_BRD_WORD0_DATA_BYTE_3(base, index) (BME_UBFX32(&CAN_WORD0_REG(base, index), CAN_WORD0_DATA_BYTE_3_SHIFT, CAN_WORD0_DATA_BYTE_3_WIDTH))

/*! @brief Set the DATA_BYTE_3 field to a new value. */
#define CAN_WR_WORD0_DATA_BYTE_3(base, index, value) (CAN_RMW_WORD0(base, index, CAN_WORD0_DATA_BYTE_3_MASK, CAN_WORD0_DATA_BYTE_3(value)))
#define CAN_BWR_WORD0_DATA_BYTE_3(base, index, value) (BME_BFI32(&CAN_WORD0_REG(base, index), ((uint32_t)(value) << CAN_WORD0_DATA_BYTE_3_SHIFT), CAN_WORD0_DATA_BYTE_3_SHIFT, CAN_WORD0_DATA_BYTE_3_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD0, field DATA_BYTE_2[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD0_DATA_BYTE_2 field. */
#define CAN_RD_WORD0_DATA_BYTE_2(base, index) ((CAN_WORD0_REG(base, index) & CAN_WORD0_DATA_BYTE_2_MASK) >> CAN_WORD0_DATA_BYTE_2_SHIFT)
#define CAN_BRD_WORD0_DATA_BYTE_2(base, index) (BME_UBFX32(&CAN_WORD0_REG(base, index), CAN_WORD0_DATA_BYTE_2_SHIFT, CAN_WORD0_DATA_BYTE_2_WIDTH))

