pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the DATA_BYTE_2 field to a new value. */
#define CAN_WR_WORD0_DATA_BYTE_2(base, index, value) (CAN_RMW_WORD0(base, index, CAN_WORD0_DATA_BYTE_2_MASK, CAN_WORD0_DATA_BYTE_2(value)))
#define CAN_BWR_WORD0_DATA_BYTE_2(base, index, value) (BME_BFI32(&CAN_WORD0_REG(base, index), ((uint32_t)(value) << CAN_WORD0_DATA_BYTE_2_SHIFT), CAN_WORD0_DATA_BYTE_2_SHIFT, CAN_WORD0_DATA_BYTE_2_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD0, field DATA_BYTE_1[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD0_DATA_BYTE_1 field. */
#define CAN_RD_WORD0_DATA_BYTE_1(base, index) ((CAN_WORD0_REG(base, index) & CAN_WORD0_DATA_BYTE_1_MASK) >> CAN_WORD0_DATA_BYTE_1_SHIFT)
#define CAN_BRD_WORD0_DATA_BYTE_1(base, index) (BME_UBFX32(&CAN_WORD0_REG(base, index), CAN_WORD0_DATA_BYTE_1_SHIFT, CAN_WORD0_DATA_BYTE_1_WIDTH))

/*! @brief Set the DATA_BYTE_1 field to a new value. */
#define CAN_WR_WORD0_DATA_BYTE_1(base, index, value) (CAN_RMW_WORD0(base, index, CAN_WORD0_DATA_BYTE_1_MASK, CAN_WORD0_DATA_BYTE_1(value)))
#define CAN_BWR_WORD0_DATA_BYTE_1(base, index, value) (BME_BFI32(&CAN_WORD0_REG(base, index), ((uint32_t)(value) << CAN_WORD0_DATA_BYTE_1_SHIFT), CAN_WORD0_DATA_BYTE_1_SHIFT, CAN_WORD0_DATA_BYTE_1_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD0, field DATA_BYTE_0[31:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD0_DATA_BYTE_0 field. */
#define CAN_RD_WORD0_DATA_BYTE_0(base, index) ((CAN_WORD0_REG(base, index) & CAN_WORD0_DATA_BYTE_0_MASK) >> CAN_WORD0_DATA_BYTE_0_SHIFT)
#define CAN_BRD_WORD0_DATA_BYTE_0(base, index) (BME_UBFX32(&CAN_WORD0_REG(base, index), CAN_WORD0_DATA_BYTE_0_SHIFT, CAN_WORD0_DATA_BYTE_0_WIDTH))

/*! @brief Set the DATA_BYTE_0 field to a new value. */
#define CAN_WR_WORD0_DATA_BYTE_0(base, index, value) (CAN_RMW_WORD0(base, index, CAN_WORD0_DATA_BYTE_0_MASK, CAN_WORD0_DATA_BYTE_0(value)))
#define CAN_BWR_WORD0_DATA_BYTE_0(base, index, value) (BME_BFI32(&CAN_WORD0_REG(base, index), ((uint32_t)(value) << CAN_WORD0_DATA_BYTE_0_SHIFT), CAN_WORD0_DATA_BYTE_0_SHIFT, CAN_WORD0_DATA_BYTE_0_WIDTH))
/*@}*/

/*******************************************************************************
 * CAN_WORD1 - Message Buffer 0 WORD1 Register
 ******************************************************************************/

/*!
 * @brief CAN_WORD1 - Message Buffer 0 WORD1 Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire CAN_WORD1 register
 */
/*@{*/
#define CAN_RD_WORD1(base, index) (CAN_WORD1_REG(base, index))
#define CAN_WR_WORD1(base, index, value) (CAN_WORD1_REG(base, index) = (value))
#define CAN_RMW_WORD1(base, index, mask, value) (CAN_WR_WORD1(base, index, (CAN_RD_WORD1(base, index) & ~(mask)) | (value)))
#define CAN_SET_WORD1(base, index, value) (BME_OR32(&CAN_WORD1_REG(base, index), (uint32_t)(value)))
#define CAN_CLR_WORD1(base, index, value) (BME_AND32(&CAN_WORD1_REG(base, index), (uint32_t)(~(value))))
#define CAN_TOG_WORD1(base, index, value) (BME_XOR32(&CAN_WORD1_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual CAN_WORD1 bitfields
 */

/*!
 * @name Register CAN_WORD1, field DATA_BYTE_7[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD1_DATA_BYTE_7 field. */
#define CAN_RD_WORD1_DATA_BYTE_7(base, index) ((CAN_WORD1_REG(base, index) & CAN_WORD1_DATA_BYTE_7_MASK) >> CAN_WORD1_DATA_BYTE_7_SHIFT)
#define CAN_BRD_WORD1_DATA_BYTE_7(base, index) (BME_UBFX32(&CAN_WORD1_REG(base, index), CAN_WORD1_DATA_BYTE_7_SHIFT, CAN_WORD1_DATA_BYTE_7_WIDTH))

/*! @brief Set the DATA_BYTE_7 field to a new value. */
#define CAN_WR_WORD1_DATA_BYTE_7(base, index, value) (CAN_RMW_WORD1(base, index, CAN_WORD1_DATA_BYTE_7_MASK, CAN_WORD1_DATA_BYTE_7(value)))
#define CAN_BWR_WORD1_DATA_BYTE_7(base, index, value) (BME_BFI32(&CAN_WORD1_REG(base, index), ((uint32_t)(value) << CAN_WORD1_DATA_BYTE_7_SHIFT), CAN_WORD1_DATA_BYTE_7_SHIFT, CAN_WORD1_DATA_BYTE_7_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD1, field DATA_BYTE_6[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD1_DATA_BYTE_6 field. */
#define CAN_RD_WORD1_DATA_BYTE_6(base, index) ((CAN_WORD1_REG(base, index) & CAN_WORD1_DATA_BYTE_6_MASK) >> CAN_WORD1_DATA_BYTE_6_SHIFT)
#define CAN_BRD_WORD1_DATA_BYTE_6(base, index) (BME_UBFX32(&CAN_WORD1_REG(base, index), CAN_WORD1_DATA_BYTE_6_SHIFT, CAN_WORD1_DATA_BYTE_6_WIDTH))

/*! @brief Set the DATA_BYTE_6 field to a new value. */
#define CAN_WR_WORD1_DATA_BYTE_6(base, index, value) (CAN_RMW_WORD1(base, index, CAN_WORD1_DATA_BYTE_6_MASK, CAN_WORD1_DATA_BYTE_6(value)))
#define CAN_BWR_WORD1_DATA_BYTE_6(base, index, value) (BME_BFI32(&CAN_WORD1_REG(base, index), ((uint32_t)(value) << CAN_WORD1_DATA_BYTE_6_SHIFT), CAN_WORD1_DATA_BYTE_6_SHIFT, CAN_WORD1_DATA_BYTE_6_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD1, field DATA_BYTE_5[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD1_DATA_BYTE_5 field. */
#define CAN_RD_WORD1_DATA_BYTE_5(base, index) ((CAN_WORD1_REG(base, index) & CAN_WORD1_DATA_BYTE_5_MASK) >> CAN_WORD1_DATA_BYTE_5_SHIFT)
#define CAN_BRD_WORD1_DATA_BYTE_5(base, index) (BME_UBFX32(&CAN_WORD1_REG(base, index), CAN_WORD1_DATA_BYTE_5_SHIFT, CAN_WORD1_DATA_BYTE_5_WIDTH))

/*! @brief Set the DATA_BYTE_5 field to a new value. */
#define CAN_WR_WORD1_DATA_BYTE_5(base, index, value) (CAN_RMW_WORD1(base, index, CAN_WORD1_DATA_BYTE_5_MASK, CAN_WORD1_DATA_BYTE_5(value)))
#define CAN_BWR_WORD1_DATA_BYTE_5(base, index, value) (BME_BFI32(&CAN_WORD1_REG(base, index), ((uint32_t)(value) << CAN_WORD1_DATA_BYTE_5_SHIFT), CAN_WORD1_DATA_BYTE_5_SHIFT, CAN_WORD1_DATA_BYTE_5_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD1, field DATA_BYTE_4[31:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD1_DATA_BYTE_4 field. */
#define CAN_RD_WORD1_DATA_BYTE_4(base, index) ((CAN_WORD1_REG(base, index) & CAN_WORD1_DATA_BYTE_4_MASK) >> CAN_WORD1_DATA_BYTE_4_SHIFT)
#define CAN_BRD_WORD1_DATA_BYTE_4(base, index) (BME_UBFX32(&CAN_WORD1_REG(base, index), CAN_WORD1_DATA_BYTE_4_SHIFT, CAN_WORD1_DATA_BYTE_4_WIDTH))

/*! @brief Set the DATA_BYTE_4 field to a new value. */
#define CAN_WR_WORD1_DATA_BYTE_4(base, index, value) (CAN_RMW_WORD1(base, index, CAN_WORD1_DATA_BYTE_4_MASK, CAN_WORD1_DATA_BYTE_4(value)))
#define CAN_BWR_WORD1_DATA_BYTE_4(base, index, value) (BME_BFI32(&CAN_WORD1_REG(base, index), ((uint32_t)(value) << CAN_WORD1_DATA_BYTE_4_SHIFT), CAN_WORD1_DATA_BYTE_4_SHIFT, CAN_WORD1_DATA_BYTE_4_WIDTH))
/*@}*/

