pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the HIRQ field to a new value. */
#define ENC_WR_CTRL_HIRQ(base, value) (ENC_RMW_CTRL(base, (ENC_CTRL_HIRQ_MASK | ENC_CTRL_CMPIRQ_MASK | ENC_CTRL_DIRQ_MASK | ENC_CTRL_XIRQ_MASK), ENC_CTRL_HIRQ(value)))
#define ENC_BWR_CTRL_HIRQ(base, value) (BME_BFI16(&ENC_CTRL_REG(base), ((uint16_t)(value) << ENC_CTRL_HIRQ_SHIFT), ENC_CTRL_HIRQ_SHIFT, ENC_CTRL_HIRQ_WIDTH))
/*@}*/

/*******************************************************************************
 * ENC_FILT - Input Filter Register
 ******************************************************************************/

/*!
 * @brief ENC_FILT - Input Filter Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register sets the values of the input filter sample period (FILT_PER)
 * and the input filter sample count (FILT_CNT). The FILT_PER value should be set
 * such that the sampling period is larger than the period of the expected noise.
 * This way a noise spike will only corrupt one sample. The FILT_CNT value should
 * be chosen to reduce the probablility of noisy samples causing an incorrect
 * transition to be recognized. The probability of an incorrect transition is
 * defined as the probability of an incorrect sample raised to the power of
 * FILT_CNT+3. The values of FILT_PER and FILT_CNT must also be traded off against the
 * desire for minimal latency in recognizing valid input transitions. Turning on the
 * input filter (setting FILT_PER to a non-zero value) introduces a latency of
 * ((FILT_CNT+3)*FILT_PER+2) IPBus clock periods. The filter latency can be
 * measured as follows: drive the quadrature decoder inputs, PHASEA, PHASEB, INDEX, and
 * HOME monitoring the filtered output in the input monitor register (IMR).
 * Determine how many IPBus clock cycles it takes before the output shows up, by using
 * the following equations, where f is FILT_PER and s is FILT_CNT. DELAY (IPBus
 * clock cycles) = f * (s+3) +1 (to read the filtered output) DELAY (IPBus clock
 * cycles) = f * (s+3) +2 (to monitor the output in the IMR) One more additional
 * IPBus clock cycle is needed to read the filtered output, and two more IPBus
 * clock cycles are needed to monitor the filtered output in the IMR. The sample
 * rate is set when it reaches the number f. The following examples employ the
 * preceding equations: Example: when f = 0, the filter is bypassed. Therefore, DELAY
 * = 1 or 2 clock cycles. Example: when f = 5 and s = 2, DELAY = 5 * (2+3) + (1
 * or 2) = 26 or 27 clock cycles.
 */
/*!
 * @name Constants and macros for entire ENC_FILT register
 */
/*@{*/
#define ENC_RD_FILT(base)        (ENC_FILT_REG(base))
#define ENC_WR_FILT(base, value) (ENC_FILT_REG(base) = (value))
#define ENC_RMW_FILT(base, mask, value) (ENC_WR_FILT(base, (ENC_RD_FILT(base) & ~(mask)) | (value)))
#define ENC_SET_FILT(base, value) (BME_OR16(&ENC_FILT_REG(base), (uint16_t)(value)))
#define ENC_CLR_FILT(base, value) (BME_AND16(&ENC_FILT_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_FILT(base, value) (BME_XOR16(&ENC_FILT_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENC_FILT bitfields
 */

/*!
 * @name Register ENC_FILT, field FILT_PER[7:0] (RW)
 *
 * These bits represent the sampling period (in IPBus clock cycles) of the
 * decoder input signals. Each input is sampled multiple times at the rate specified
 * by this field. If FILT_PER is 0x00 (default), then the input filter is
 * bypassed. Bypassing the digital filter enables the position/position difference
 * counters to operate with count rates up to the IPBus frequency. The value of
 * FILT_PER affects the input latency. When changing FILT_PER from one non-zero value to
 * another non-zero value, write a value of 0 first in order to clear the filter.
 */
/*@{*/
/*! @brief Read current value of the ENC_FILT_FILT_PER field. */
#define ENC_RD_FILT_FILT_PER(base) ((ENC_FILT_REG(base) & ENC_FILT_FILT_PER_MASK) >> ENC_FILT_FILT_PER_SHIFT)
#define ENC_BRD_FILT_FILT_PER(base) (BME_UBFX16(&ENC_FILT_REG(base), ENC_FILT_FILT_PER_SHIFT, ENC_FILT_FILT_PER_WIDTH))

/*! @brief Set the FILT_PER field to a new value. */
#define ENC_WR_FILT_FILT_PER(base, value) (ENC_RMW_FILT(base, ENC_FILT_FILT_PER_MASK, ENC_FILT_FILT_PER(value)))
#define ENC_BWR_FILT_FILT_PER(base, value) (BME_BFI16(&ENC_FILT_REG(base), ((uint16_t)(value) << ENC_FILT_FILT_PER_SHIFT), ENC_FILT_FILT_PER_SHIFT, ENC_FILT_FILT_PER_WIDTH))
/*@}*/

/*!
 * @name Register ENC_FILT, field FILT_CNT[10:8] (RW)
 *
 * These bits represent the number of consecutive samples that must agree prior
 * to the input filter accepting an input transition. A value of 0x0 represents 3
 * samples. A value of 0x7 represents 10 samples. The value of FILT_CNT affects
 * the input latency.
 */
/*@{*/
/*! @brief Read current value of the ENC_FILT_FILT_CNT field. */
#define ENC_RD_FILT_FILT_CNT(base) ((ENC_FILT_REG(base) & ENC_FILT_FILT_CNT_MASK) >> ENC_FILT_FILT_CNT_SHIFT)
#define ENC_BRD_FILT_FILT_CNT(base) (BME_UBFX16(&ENC_FILT_REG(base), ENC_FILT_FILT_CNT_SHIFT, ENC_FILT_FILT_CNT_WIDTH))

/*! @brief Set the FILT_CNT field to a new value. */
#define ENC_WR_FILT_FILT_CNT(base, value) (ENC_RMW_FILT(base, ENC_FILT_FILT_CNT_MASK, ENC_FILT_FILT_CNT(value)))
#define ENC_BWR_FILT_FILT_CNT(base, value) (BME_BFI16(&ENC_FILT_REG(base), ((uint16_t)(value) << ENC_FILT_FILT_CNT_SHIFT), ENC_FILT_FILT_CNT_SHIFT, ENC_FILT_FILT_CNT_WIDTH))
/*@}*/

/*******************************************************************************
 * ENC_WTR - Watchdog Timeout Register
 ******************************************************************************/

/*!
 * @brief ENC_WTR - Watchdog Timeout Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This read/write register stores the timeout count for the quadrature decoder
 * module watchdog timer. This timer is separate from the watchdog timer in the
 * COP module.
 */
/*!
 * @name Constants and macros for entire ENC_WTR register
 */
/*@{*/
#define ENC_RD_WTR(base)         (ENC_WTR_REG(base))
#define ENC_WR_WTR(base, value)  (ENC_WTR_REG(base) = (value))
#define ENC_RMW_WTR(base, mask, value) (ENC_WR_WTR(base, (ENC_RD_WTR(base) & ~(mask)) | (value)))
#define ENC_SET_WTR(base, value) (BME_OR16(&ENC_WTR_REG(base), (uint16_t)(value)))
#define ENC_CLR_WTR(base, value) (BME_AND16(&ENC_WTR_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_WTR(base, value) (BME_XOR16(&ENC_WTR_REG(base), (uint16_t)(value)))
/*@}*/

