pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * ENC_UMOD - Upper Modulus Register
 ******************************************************************************/

/*!
 * @brief ENC_UMOD - Upper Modulus Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_UMOD register
 */
/*@{*/
#define ENC_RD_UMOD(base)        (ENC_UMOD_REG(base))
#define ENC_WR_UMOD(base, value) (ENC_UMOD_REG(base) = (value))
#define ENC_RMW_UMOD(base, mask, value) (ENC_WR_UMOD(base, (ENC_RD_UMOD(base) & ~(mask)) | (value)))
#define ENC_SET_UMOD(base, value) (BME_OR16(&ENC_UMOD_REG(base), (uint16_t)(value)))
#define ENC_CLR_UMOD(base, value) (BME_AND16(&ENC_UMOD_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_UMOD(base, value) (BME_XOR16(&ENC_UMOD_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * ENC_LMOD - Lower Modulus Register
 ******************************************************************************/

/*!
 * @brief ENC_LMOD - Lower Modulus Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ENC_LMOD register
 */
/*@{*/
#define ENC_RD_LMOD(base)        (ENC_LMOD_REG(base))
#define ENC_WR_LMOD(base, value) (ENC_LMOD_REG(base) = (value))
#define ENC_RMW_LMOD(base, mask, value) (ENC_WR_LMOD(base, (ENC_RD_LMOD(base) & ~(mask)) | (value)))
#define ENC_SET_LMOD(base, value) (BME_OR16(&ENC_LMOD_REG(base), (uint16_t)(value)))
#define ENC_CLR_LMOD(base, value) (BME_AND16(&ENC_LMOD_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_LMOD(base, value) (BME_XOR16(&ENC_LMOD_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * ENC_UCOMP - Upper Position Compare Register
 ******************************************************************************/

/*!
 * @brief ENC_UCOMP - Upper Position Compare Register (RW)
 *
 * Reset value: 0xFFFFU
 */
/*!
 * @name Constants and macros for entire ENC_UCOMP register
 */
/*@{*/
#define ENC_RD_UCOMP(base)       (ENC_UCOMP_REG(base))
#define ENC_WR_UCOMP(base, value) (ENC_UCOMP_REG(base) = (value))
#define ENC_RMW_UCOMP(base, mask, value) (ENC_WR_UCOMP(base, (ENC_RD_UCOMP(base) & ~(mask)) | (value)))
#define ENC_SET_UCOMP(base, value) (BME_OR16(&ENC_UCOMP_REG(base), (uint16_t)(value)))
#define ENC_CLR_UCOMP(base, value) (BME_AND16(&ENC_UCOMP_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_UCOMP(base, value) (BME_XOR16(&ENC_UCOMP_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * ENC_LCOMP - Lower Position Compare Register
 ******************************************************************************/

/*!
 * @brief ENC_LCOMP - Lower Position Compare Register (RW)
 *
 * Reset value: 0xFFFFU
 */
/*!
 * @name Constants and macros for entire ENC_LCOMP register
 */
/*@{*/
#define ENC_RD_LCOMP(base)       (ENC_LCOMP_REG(base))
#define ENC_WR_LCOMP(base, value) (ENC_LCOMP_REG(base) = (value))
#define ENC_RMW_LCOMP(base, mask, value) (ENC_WR_LCOMP(base, (ENC_RD_LCOMP(base) & ~(mask)) | (value)))
#define ENC_SET_LCOMP(base, value) (BME_OR16(&ENC_LCOMP_REG(base), (uint16_t)(value)))
#define ENC_CLR_LCOMP(base, value) (BME_AND16(&ENC_LCOMP_REG(base), (uint16_t)(~(value))))
#define ENC_TOG_LCOMP(base, value) (BME_XOR16(&ENC_LCOMP_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * MKV58F22 ENET
 *
 * Ethernet MAC-NET Core
 *
 * Registers defined in this header file:
 * - ENET_EIR - Interrupt Event Register
 * - ENET_EIMR - Interrupt Mask Register
 * - ENET_RDAR - Receive Descriptor Active Register
 * - ENET_TDAR - Transmit Descriptor Active Register
 * - ENET_ECR - Ethernet Control Register
 * - ENET_MMFR - MII Management Frame Register
 * - ENET_MSCR - MII Speed Control Register
 * - ENET_MIBC - MIB Control Register
 * - ENET_RCR - Receive Control Register
 * - ENET_TCR - Transmit Control Register
 * - ENET_PALR - Physical Address Lower Register
 * - ENET_PAUR - Physical Address Upper Register
 * - ENET_OPD - Opcode/Pause Duration Register
 * - ENET_IAUR - Descriptor Individual Upper Address Register
 * - ENET_IALR - Descriptor Individual Lower Address Register
 * - ENET_GAUR - Descriptor Group Upper Address Register
 * - ENET_GALR - Descriptor Group Lower Address Register
 * - ENET_TFWR - Transmit FIFO Watermark Register
 * - ENET_RDSR - Receive Descriptor Ring Start Register
 * - ENET_TDSR - Transmit Buffer Descriptor Ring Start Register
 * - ENET_MRBR - Maximum Receive Buffer Size Register
 * - ENET_RSFL - Receive FIFO Section Full Threshold
 * - ENET_RSEM - Receive FIFO Section Empty Threshold
 * - ENET_RAEM - Receive FIFO Almost Empty Threshold
 * - ENET_RAFL - Receive FIFO Almost Full Threshold
 * - ENET_TSEM - Transmit FIFO Section Empty Threshold
 * - ENET_TAEM - Transmit FIFO Almost Empty Threshold
 * - ENET_TAFL - Transmit FIFO Almost Full Threshold
 * - ENET_TIPG - Transmit Inter-Packet Gap
 * - ENET_FTRL - Frame Truncation Length
 * - ENET_TACC - Transmit Accelerator Function Configuration
 * - ENET_RACC - Receive Accelerator Function Configuration
 * - ENET_RMON_T_DROP - Reserved Statistic Register
 * - ENET_RMON_T_PACKETS - Tx Packet Count Statistic Register
 * - ENET_RMON_T_BC_PKT - Tx Broadcast Packets Statistic Register
 * - ENET_RMON_T_MC_PKT - Tx Multicast Packets Statistic Register
 * - ENET_RMON_T_CRC_ALIGN - Tx Packets with CRC/Align Error Statistic Register
 * - ENET_RMON_T_UNDERSIZE - Tx Packets Less Than Bytes and Good CRC Statistic Register
 * - ENET_RMON_T_OVERSIZE - Tx Packets GT MAX_FL bytes and Good CRC Statistic Register
 * - ENET_RMON_T_FRAG - Tx Packets Less Than 64 Bytes and Bad CRC Statistic Register
 * - ENET_RMON_T_JAB - Tx Packets Greater Than MAX_FL bytes and Bad CRC Statistic Register
 * - ENET_RMON_T_COL - Tx Collision Count Statistic Register
 * - ENET_RMON_T_P64 - Tx 64-Byte Packets Statistic Register
 * - ENET_RMON_T_P65TO127 - Tx 65- to 127-byte Packets Statistic Register
 * - ENET_RMON_T_P128TO255 - Tx 128- to 255-byte Packets Statistic Register
 * - ENET_RMON_T_P256TO511 - Tx 256- to 511-byte Packets Statistic Register
 * - ENET_RMON_T_P512TO1023 - Tx 512- to 1023-byte Packets Statistic Register
 * - ENET_RMON_T_P1024TO2047 - Tx 1024- to 2047-byte Packets Statistic Register
 * - ENET_RMON_T_P_GTE2048 - Tx Packets Greater Than 2048 Bytes Statistic Register
 * - ENET_RMON_T_OCTETS - Tx Octets Statistic Register
 * - ENET_IEEE_T_DROP - IEEE_T_DROP Reserved Statistic Register
 * - ENET_IEEE_T_FRAME_OK - Frames Transmitted OK Statistic Register
 * - ENET_IEEE_T_1COL - Frames Transmitted with Single Collision Statistic Register
 * - ENET_IEEE_T_MCOL - Frames Transmitted with Multiple Collisions Statistic Register
 * - ENET_IEEE_T_DEF - Frames Transmitted after Deferral Delay Statistic Register
 * - ENET_IEEE_T_LCOL - Frames Transmitted with Late Collision Statistic Register
 * - ENET_IEEE_T_EXCOL - Frames Transmitted with Excessive Collisions Statistic Register
 * - ENET_IEEE_T_MACERR - Frames Transmitted with Tx FIFO Underrun Statistic Register
 * - ENET_IEEE_T_CSERR - Frames Transmitted with Carrier Sense Error Statistic Register
 * - ENET_IEEE_T_SQE -
 * - ENET_IEEE_T_FDXFC - Flow Control Pause Frames Transmitted Statistic Register
 * - ENET_IEEE_T_OCTETS_OK - Octet Count for Frames Transmitted w/o Error Statistic Register
 * - ENET_RMON_R_PACKETS - Rx Packet Count Statistic Register
 * - ENET_RMON_R_BC_PKT - Rx Broadcast Packets Statistic Register
 * - ENET_RMON_R_MC_PKT - Rx Multicast Packets Statistic Register
 * - ENET_RMON_R_CRC_ALIGN - Rx Packets with CRC/Align Error Statistic Register
 * - ENET_RMON_R_UNDERSIZE - Rx Packets with Less Than 64 Bytes and Good CRC Statistic Register
 * - ENET_RMON_R_OVERSIZE - Rx Packets Greater Than MAX_FL and Good CRC Statistic Register
 * - ENET_RMON_R_FRAG - Rx Packets Less Than 64 Bytes and Bad CRC Statistic Register
 * - ENET_RMON_R_JAB - Rx Packets Greater Than MAX_FL Bytes and Bad CRC Statistic Register
 * - ENET_RMON_R_RESVD_0 - Reserved Statistic Register
 * - ENET_RMON_R_P64 - Rx 64-Byte Packets Statistic Register
 * - ENET_RMON_R_P65TO127 - Rx 65- to 127-Byte Packets Statistic Register
 * - ENET_RMON_R_P128TO255 - Rx 128- to 255-Byte Packets Statistic Register
 * - ENET_RMON_R_P256TO511 - Rx 256- to 511-Byte Packets Statistic Register
 * - ENET_RMON_R_P512TO1023 - Rx 512- to 1023-Byte Packets Statistic Register
 * - ENET_RMON_R_P1024TO2047 - Rx 1024- to 2047-Byte Packets Statistic Register
 * - ENET_RMON_R_P_GTE2048 - Rx Packets Greater than 2048 Bytes Statistic Register
 * - ENET_RMON_R_OCTETS - Rx Octets Statistic Register
 * - ENET_IEEE_R_DROP - Frames not Counted Correctly Statistic Register
 * - ENET_IEEE_R_FRAME_OK - Frames Received OK Statistic Register
 * - ENET_IEEE_R_CRC - Frames Received with CRC Error Statistic Register
 * - ENET_IEEE_R_ALIGN - Frames Received with Alignment Error Statistic Register
 * - ENET_IEEE_R_MACERR - Receive FIFO Overflow Count Statistic Register
 * - ENET_IEEE_R_FDXFC - Flow Control Pause Frames Received Statistic Register
 * - ENET_IEEE_R_OCTETS_OK - Octet Count for Frames Received without Error Statistic Register
 * - ENET_ATCR - Adjustable Timer Control Register
 * - ENET_ATVR - Timer Value Register
 * - ENET_ATOFF - Timer Offset Register
 * - ENET_ATPER - Timer Period Register
 * - ENET_ATCOR - Timer Correction Register
 * - ENET_ATINC - Time-Stamping Clock Period Register
 * - ENET_ATSTMP - Timestamp of Last Transmitted Frame
 * - ENET_TGSR - Timer Global Status Register
 * - ENET_TCSR - Timer Control Status Register
 * - ENET_TCCR - Timer Compare Capture Register
 */

#define ENET_INSTANCE_COUNT (1U) /*!< Number of instances of the ENET module. */
#define ENET_IDX (0U) /*!< Instance number for ENET. */

