pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual ENET_MSCR bitfields
 */

/*!
 * @name Register ENET_MSCR, field MII_SPEED[6:1] (RW)
 *
 * Controls the frequency of the MII management interface clock (MDC) relative
 * to the internal module clock. A value of 0 in this field turns off MDC and
 * leaves it in low voltage state. Any non-zero value results in the MDC frequency
 * of: 1/((MII_SPEED + 1) x 2) of the internal module clock frequency
 */
/*@{*/
/*! @brief Read current value of the ENET_MSCR_MII_SPEED field. */
#define ENET_RD_MSCR_MII_SPEED(base) ((ENET_MSCR_REG(base) & ENET_MSCR_MII_SPEED_MASK) >> ENET_MSCR_MII_SPEED_SHIFT)
#define ENET_BRD_MSCR_MII_SPEED(base) (BME_UBFX32(&ENET_MSCR_REG(base), ENET_MSCR_MII_SPEED_SHIFT, ENET_MSCR_MII_SPEED_WIDTH))

/*! @brief Set the MII_SPEED field to a new value. */
#define ENET_WR_MSCR_MII_SPEED(base, value) (ENET_RMW_MSCR(base, ENET_MSCR_MII_SPEED_MASK, ENET_MSCR_MII_SPEED(value)))
#define ENET_BWR_MSCR_MII_SPEED(base, value) (BME_BFI32(&ENET_MSCR_REG(base), ((uint32_t)(value) << ENET_MSCR_MII_SPEED_SHIFT), ENET_MSCR_MII_SPEED_SHIFT, ENET_MSCR_MII_SPEED_WIDTH))
/*@}*/

/*!
 * @name Register ENET_MSCR, field DIS_PRE[7] (RW)
 *
 * Enables/disables prepending a preamble to the MII management frame. The MII
 * standard allows the preamble to be dropped if the attached PHY devices do not
 * require it.
 *
 * Values:
 * - 0b0 - Preamble enabled.
 * - 0b1 - Preamble (32 ones) is not prepended to the MII management frame.
 */
/*@{*/
/*! @brief Read current value of the ENET_MSCR_DIS_PRE field. */
#define ENET_RD_MSCR_DIS_PRE(base) ((ENET_MSCR_REG(base) & ENET_MSCR_DIS_PRE_MASK) >> ENET_MSCR_DIS_PRE_SHIFT)
#define ENET_BRD_MSCR_DIS_PRE(base) (BME_UBFX32(&ENET_MSCR_REG(base), ENET_MSCR_DIS_PRE_SHIFT, ENET_MSCR_DIS_PRE_WIDTH))

/*! @brief Set the DIS_PRE field to a new value. */
#define ENET_WR_MSCR_DIS_PRE(base, value) (ENET_RMW_MSCR(base, ENET_MSCR_DIS_PRE_MASK, ENET_MSCR_DIS_PRE(value)))
#define ENET_BWR_MSCR_DIS_PRE(base, value) (BME_BFI32(&ENET_MSCR_REG(base), ((uint32_t)(value) << ENET_MSCR_DIS_PRE_SHIFT), ENET_MSCR_DIS_PRE_SHIFT, ENET_MSCR_DIS_PRE_WIDTH))
/*@}*/

/*!
 * @name Register ENET_MSCR, field HOLDTIME[10:8] (RW)
 *
 * IEEE802.3 clause 22 defines a minimum of 10 ns for the hold time on the MDIO
 * output. Depending on the host bus frequency, the setting may need to be
 * increased.
 *
 * Values:
 * - 0b000 - 1 internal module clock cycle
 * - 0b001 - 2 internal module clock cycles
 * - 0b010 - 3 internal module clock cycles
 * - 0b111 - 8 internal module clock cycles
 */
/*@{*/
/*! @brief Read current value of the ENET_MSCR_HOLDTIME field. */
#define ENET_RD_MSCR_HOLDTIME(base) ((ENET_MSCR_REG(base) & ENET_MSCR_HOLDTIME_MASK) >> ENET_MSCR_HOLDTIME_SHIFT)
#define ENET_BRD_MSCR_HOLDTIME(base) (BME_UBFX32(&ENET_MSCR_REG(base), ENET_MSCR_HOLDTIME_SHIFT, ENET_MSCR_HOLDTIME_WIDTH))

/*! @brief Set the HOLDTIME field to a new value. */
#define ENET_WR_MSCR_HOLDTIME(base, value) (ENET_RMW_MSCR(base, ENET_MSCR_HOLDTIME_MASK, ENET_MSCR_HOLDTIME(value)))
#define ENET_BWR_MSCR_HOLDTIME(base, value) (BME_BFI32(&ENET_MSCR_REG(base), ((uint32_t)(value) << ENET_MSCR_HOLDTIME_SHIFT), ENET_MSCR_HOLDTIME_SHIFT, ENET_MSCR_HOLDTIME_WIDTH))
/*@}*/

/*******************************************************************************
 * ENET_MIBC - MIB Control Register
 ******************************************************************************/

/*!
 * @brief ENET_MIBC - MIB Control Register (RW)
 *
 * Reset value: 0xC0000000U
 *
 * MIBC is a read/write register controlling and observing the state of the MIB
 * block. Access this register to disable the MIB block operation or clear the
 * MIB counters. The MIB_DIS field resets to 1.
 */
/*!
 * @name Constants and macros for entire ENET_MIBC register
 */
/*@{*/
#define ENET_RD_MIBC(base)       (ENET_MIBC_REG(base))
#define ENET_WR_MIBC(base, value) (ENET_MIBC_REG(base) = (value))
#define ENET_RMW_MIBC(base, mask, value) (ENET_WR_MIBC(base, (ENET_RD_MIBC(base) & ~(mask)) | (value)))
#define ENET_SET_MIBC(base, value) (BME_OR32(&ENET_MIBC_REG(base), (uint32_t)(value)))
#define ENET_CLR_MIBC(base, value) (BME_AND32(&ENET_MIBC_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_MIBC(base, value) (BME_XOR32(&ENET_MIBC_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_MIBC bitfields
 */

/*!
 * @name Register ENET_MIBC, field MIB_CLEAR[29] (RW)
 *
 * This field is not self-clearing. To clear the MIB counters set and then clear
 * this field.
 *
 * Values:
 * - 0b0 - See note above.
 * - 0b1 - All statistics counters are reset to 0.
 */
/*@{*/
/*! @brief Read current value of the ENET_MIBC_MIB_CLEAR field. */
#define ENET_RD_MIBC_MIB_CLEAR(base) ((ENET_MIBC_REG(base) & ENET_MIBC_MIB_CLEAR_MASK) >> ENET_MIBC_MIB_CLEAR_SHIFT)
#define ENET_BRD_MIBC_MIB_CLEAR(base) (BME_UBFX32(&ENET_MIBC_REG(base), ENET_MIBC_MIB_CLEAR_SHIFT, ENET_MIBC_MIB_CLEAR_WIDTH))

/*! @brief Set the MIB_CLEAR field to a new value. */
#define ENET_WR_MIBC_MIB_CLEAR(base, value) (ENET_RMW_MIBC(base, ENET_MIBC_MIB_CLEAR_MASK, ENET_MIBC_MIB_CLEAR(value)))
#define ENET_BWR_MIBC_MIB_CLEAR(base, value) (BME_BFI32(&ENET_MIBC_REG(base), ((uint32_t)(value) << ENET_MIBC_MIB_CLEAR_SHIFT), ENET_MIBC_MIB_CLEAR_SHIFT, ENET_MIBC_MIB_CLEAR_WIDTH))
/*@}*/

/*!
 * @name Register ENET_MIBC, field MIB_IDLE[30] (RO)
 *
 * Values:
 * - 0b0 - The MIB block is updating MIB counters.
 * - 0b1 - The MIB block is not currently updating any MIB counters.
 */
/*@{*/
/*! @brief Read current value of the ENET_MIBC_MIB_IDLE field. */
#define ENET_RD_MIBC_MIB_IDLE(base) ((ENET_MIBC_REG(base) & ENET_MIBC_MIB_IDLE_MASK) >> ENET_MIBC_MIB_IDLE_SHIFT)
#define ENET_BRD_MIBC_MIB_IDLE(base) (BME_UBFX32(&ENET_MIBC_REG(base), ENET_MIBC_MIB_IDLE_SHIFT, ENET_MIBC_MIB_IDLE_WIDTH))
/*@}*/

/*!
 * @name Register ENET_MIBC, field MIB_DIS[31] (RW)
 *
 * If this control field is set,
 *
 * Values:
 * - 0b0 - MIB logic is enabled.
 * - 0b1 - MIB logic is disabled. The MIB logic halts and does not update any
 *     MIB counters.
 */
/*@{*/
/*! @brief Read current value of the ENET_MIBC_MIB_DIS field. */
#define ENET_RD_MIBC_MIB_DIS(base) ((ENET_MIBC_REG(base) & ENET_MIBC_MIB_DIS_MASK) >> ENET_MIBC_MIB_DIS_SHIFT)
#define ENET_BRD_MIBC_MIB_DIS(base) (BME_UBFX32(&ENET_MIBC_REG(base), ENET_MIBC_MIB_DIS_SHIFT, ENET_MIBC_MIB_DIS_WIDTH))

/*! @brief Set the MIB_DIS field to a new value. */
#define ENET_WR_MIBC_MIB_DIS(base, value) (ENET_RMW_MIBC(base, ENET_MIBC_MIB_DIS_MASK, ENET_MIBC_MIB_DIS(value)))
#define ENET_BWR_MIBC_MIB_DIS(base, value) (BME_BFI32(&ENET_MIBC_REG(base), ((uint32_t)(value) << ENET_MIBC_MIB_DIS_SHIFT), ENET_MIBC_MIB_DIS_SHIFT, ENET_MIBC_MIB_DIS_WIDTH))
/*@}*/

