pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual ENET_TCR bitfields
 */

/*!
 * @name Register ENET_TCR, field GTS[0] (RW)
 *
 * When this field is set, MAC stops transmission after any frame currently
 * transmitted is complete and EIR[GRA] is set. If frame transmission is not
 * currently underway, the GRA interrupt is asserted immediately. After transmission
 * finishes, clear GTS to restart. The next frame in the transmit FIFO is then
 * transmitted. If an early collision occurs during transmission when GTS is set,
 * transmission stops after the collision. The frame is transmitted again after GTS is
 * cleared. There may be old frames in the transmit FIFO that transmit when GTS
 * is reasserted. To avoid this, clear ECR[ETHEREN] following the GRA interrupt.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCR_GTS field. */
#define ENET_RD_TCR_GTS(base) ((ENET_TCR_REG(base) & ENET_TCR_GTS_MASK) >> ENET_TCR_GTS_SHIFT)
#define ENET_BRD_TCR_GTS(base) (BME_UBFX32(&ENET_TCR_REG(base), ENET_TCR_GTS_SHIFT, ENET_TCR_GTS_WIDTH))

/*! @brief Set the GTS field to a new value. */
#define ENET_WR_TCR_GTS(base, value) (ENET_RMW_TCR(base, ENET_TCR_GTS_MASK, ENET_TCR_GTS(value)))
#define ENET_BWR_TCR_GTS(base, value) (BME_BFI32(&ENET_TCR_REG(base), ((uint32_t)(value) << ENET_TCR_GTS_SHIFT), ENET_TCR_GTS_SHIFT, ENET_TCR_GTS_WIDTH))
/*@}*/

/*!
 * @name Register ENET_TCR, field FDEN[2] (RW)
 *
 * If this field is set, frames transmit independent of carrier sense and
 * collision inputs. Only modify this bit when ECR[ETHEREN] is cleared.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCR_FDEN field. */
#define ENET_RD_TCR_FDEN(base) ((ENET_TCR_REG(base) & ENET_TCR_FDEN_MASK) >> ENET_TCR_FDEN_SHIFT)
#define ENET_BRD_TCR_FDEN(base) (BME_UBFX32(&ENET_TCR_REG(base), ENET_TCR_FDEN_SHIFT, ENET_TCR_FDEN_WIDTH))

/*! @brief Set the FDEN field to a new value. */
#define ENET_WR_TCR_FDEN(base, value) (ENET_RMW_TCR(base, ENET_TCR_FDEN_MASK, ENET_TCR_FDEN(value)))
#define ENET_BWR_TCR_FDEN(base, value) (BME_BFI32(&ENET_TCR_REG(base), ((uint32_t)(value) << ENET_TCR_FDEN_SHIFT), ENET_TCR_FDEN_SHIFT, ENET_TCR_FDEN_WIDTH))
/*@}*/

/*!
 * @name Register ENET_TCR, field TFC_PAUSE[3] (RW)
 *
 * Pauses frame transmission. When this field is set, EIR[GRA] is set. With
 * transmission of data frames stopped, the MAC transmits a MAC control PAUSE frame.
 * Next, the MAC clears TFC_PAUSE and resumes transmitting data frames. If the
 * transmitter pauses due to user assertion of GTS or reception of a PAUSE frame,
 * the MAC may continue transmitting a MAC control PAUSE frame.
 *
 * Values:
 * - 0b0 - No PAUSE frame transmitted.
 * - 0b1 - The MAC stops transmission of data frames after the current
 *     transmission is complete.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCR_TFC_PAUSE field. */
#define ENET_RD_TCR_TFC_PAUSE(base) ((ENET_TCR_REG(base) & ENET_TCR_TFC_PAUSE_MASK) >> ENET_TCR_TFC_PAUSE_SHIFT)
#define ENET_BRD_TCR_TFC_PAUSE(base) (BME_UBFX32(&ENET_TCR_REG(base), ENET_TCR_TFC_PAUSE_SHIFT, ENET_TCR_TFC_PAUSE_WIDTH))

/*! @brief Set the TFC_PAUSE field to a new value. */
#define ENET_WR_TCR_TFC_PAUSE(base, value) (ENET_RMW_TCR(base, ENET_TCR_TFC_PAUSE_MASK, ENET_TCR_TFC_PAUSE(value)))
#define ENET_BWR_TCR_TFC_PAUSE(base, value) (BME_BFI32(&ENET_TCR_REG(base), ((uint32_t)(value) << ENET_TCR_TFC_PAUSE_SHIFT), ENET_TCR_TFC_PAUSE_SHIFT, ENET_TCR_TFC_PAUSE_WIDTH))
/*@}*/

/*!
 * @name Register ENET_TCR, field RFC_PAUSE[4] (RO)
 *
 * This status field is set when a full-duplex flow control pause frame is
 * received and the transmitter pauses for the duration defined in this pause frame.
 * This field automatically clears when the pause duration is complete.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCR_RFC_PAUSE field. */
#define ENET_RD_TCR_RFC_PAUSE(base) ((ENET_TCR_REG(base) & ENET_TCR_RFC_PAUSE_MASK) >> ENET_TCR_RFC_PAUSE_SHIFT)
#define ENET_BRD_TCR_RFC_PAUSE(base) (BME_UBFX32(&ENET_TCR_REG(base), ENET_TCR_RFC_PAUSE_SHIFT, ENET_TCR_RFC_PAUSE_WIDTH))
/*@}*/

/*!
 * @name Register ENET_TCR, field ADDSEL[7:5] (RW)
 *
 * If ADDINS is set, indicates the MAC address that overwrites the source MAC
 * address.
 *
 * Values:
 * - 0b000 - Node MAC address programmed on PADDR1/2 registers.
 * - 0b100 - Reserved.
 * - 0b101 - Reserved.
 * - 0b110 - Reserved.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCR_ADDSEL field. */
#define ENET_RD_TCR_ADDSEL(base) ((ENET_TCR_REG(base) & ENET_TCR_ADDSEL_MASK) >> ENET_TCR_ADDSEL_SHIFT)
#define ENET_BRD_TCR_ADDSEL(base) (BME_UBFX32(&ENET_TCR_REG(base), ENET_TCR_ADDSEL_SHIFT, ENET_TCR_ADDSEL_WIDTH))

/*! @brief Set the ADDSEL field to a new value. */
#define ENET_WR_TCR_ADDSEL(base, value) (ENET_RMW_TCR(base, ENET_TCR_ADDSEL_MASK, ENET_TCR_ADDSEL(value)))
#define ENET_BWR_TCR_ADDSEL(base, value) (BME_BFI32(&ENET_TCR_REG(base), ((uint32_t)(value) << ENET_TCR_ADDSEL_SHIFT), ENET_TCR_ADDSEL_SHIFT, ENET_TCR_ADDSEL_WIDTH))
/*@}*/

/*!
 * @name Register ENET_TCR, field ADDINS[8] (RW)
 *
 * Values:
 * - 0b0 - The source MAC address is not modified by the MAC.
 * - 0b1 - The MAC overwrites the source MAC address with the programmed MAC
 *     address according to ADDSEL.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCR_ADDINS field. */
#define ENET_RD_TCR_ADDINS(base) ((ENET_TCR_REG(base) & ENET_TCR_ADDINS_MASK) >> ENET_TCR_ADDINS_SHIFT)
#define ENET_BRD_TCR_ADDINS(base) (BME_UBFX32(&ENET_TCR_REG(base), ENET_TCR_ADDINS_SHIFT, ENET_TCR_ADDINS_WIDTH))

/*! @brief Set the ADDINS field to a new value. */
#define ENET_WR_TCR_ADDINS(base, value) (ENET_RMW_TCR(base, ENET_TCR_ADDINS_MASK, ENET_TCR_ADDINS(value)))
#define ENET_BWR_TCR_ADDINS(base, value) (BME_BFI32(&ENET_TCR_REG(base), ((uint32_t)(value) << ENET_TCR_ADDINS_SHIFT), ENET_TCR_ADDINS_SHIFT, ENET_TCR_ADDINS_WIDTH))
/*@}*/

/*!
 * @name Register ENET_TCR, field CRCFWD[9] (RW)
 *
 * Values:
 * - 0b0 - TxBD[TC] controls whether the frame has a CRC from the application.
 * - 0b1 - The transmitter does not append any CRC to transmitted frames, as it
 *     is expecting a frame with CRC from the application.
 */
/*@{*/
/*! @brief Read current value of the ENET_TCR_CRCFWD field. */
#define ENET_RD_TCR_CRCFWD(base) ((ENET_TCR_REG(base) & ENET_TCR_CRCFWD_MASK) >> ENET_TCR_CRCFWD_SHIFT)
#define ENET_BRD_TCR_CRCFWD(base) (BME_UBFX32(&ENET_TCR_REG(base), ENET_TCR_CRCFWD_SHIFT, ENET_TCR_CRCFWD_WIDTH))

/*! @brief Set the CRCFWD field to a new value. */
#define ENET_WR_TCR_CRCFWD(base, value) (ENET_RMW_TCR(base, ENET_TCR_CRCFWD_MASK, ENET_TCR_CRCFWD(value)))
#define ENET_BWR_TCR_CRCFWD(base, value) (BME_BFI32(&ENET_TCR_REG(base), ((uint32_t)(value) << ENET_TCR_CRCFWD_SHIFT), ENET_TCR_CRCFWD_SHIFT, ENET_TCR_CRCFWD_WIDTH))
/*@}*/

