pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual ENET_TAEM bitfields
 */

/*!
 * @name Register ENET_TAEM, field TX_ALMOST_EMPTY[7:0] (RW)
 *
 * Value, in 64-bit words, of the transmit FIFO almost empty threshold. When the
 * FIFO level reaches the value programmed in this field, and no end-of-frame is
 * available for the frame, the MAC transmit logic, to avoid FIFO underflow,
 * stops reading the FIFO and transmits a frame with an MII error indication. See
 * Transmit FIFOFour programmable thresholds are available which control the core
 * operation as described below. for more information. A minimum value of 4 should
 * be set.
 */
/*@{*/
/*! @brief Read current value of the ENET_TAEM_TX_ALMOST_EMPTY field. */
#define ENET_RD_TAEM_TX_ALMOST_EMPTY(base) ((ENET_TAEM_REG(base) & ENET_TAEM_TX_ALMOST_EMPTY_MASK) >> ENET_TAEM_TX_ALMOST_EMPTY_SHIFT)
#define ENET_BRD_TAEM_TX_ALMOST_EMPTY(base) (BME_UBFX32(&ENET_TAEM_REG(base), ENET_TAEM_TX_ALMOST_EMPTY_SHIFT, ENET_TAEM_TX_ALMOST_EMPTY_WIDTH))

/*! @brief Set the TX_ALMOST_EMPTY field to a new value. */
#define ENET_WR_TAEM_TX_ALMOST_EMPTY(base, value) (ENET_RMW_TAEM(base, ENET_TAEM_TX_ALMOST_EMPTY_MASK, ENET_TAEM_TX_ALMOST_EMPTY(value)))
#define ENET_BWR_TAEM_TX_ALMOST_EMPTY(base, value) (BME_BFI32(&ENET_TAEM_REG(base), ((uint32_t)(value) << ENET_TAEM_TX_ALMOST_EMPTY_SHIFT), ENET_TAEM_TX_ALMOST_EMPTY_SHIFT, ENET_TAEM_TX_ALMOST_EMPTY_WIDTH))
/*@}*/

/*******************************************************************************
 * ENET_TAFL - Transmit FIFO Almost Full Threshold
 ******************************************************************************/

/*!
 * @brief ENET_TAFL - Transmit FIFO Almost Full Threshold (RW)
 *
 * Reset value: 0x00000008U
 */
/*!
 * @name Constants and macros for entire ENET_TAFL register
 */
/*@{*/
#define ENET_RD_TAFL(base)       (ENET_TAFL_REG(base))
#define ENET_WR_TAFL(base, value) (ENET_TAFL_REG(base) = (value))
#define ENET_RMW_TAFL(base, mask, value) (ENET_WR_TAFL(base, (ENET_RD_TAFL(base) & ~(mask)) | (value)))
#define ENET_SET_TAFL(base, value) (BME_OR32(&ENET_TAFL_REG(base), (uint32_t)(value)))
#define ENET_CLR_TAFL(base, value) (BME_AND32(&ENET_TAFL_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_TAFL(base, value) (BME_XOR32(&ENET_TAFL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TAFL bitfields
 */

/*!
 * @name Register ENET_TAFL, field TX_ALMOST_FULL[7:0] (RW)
 *
 * Value, in 64-bit words, of the transmit FIFO almost full threshold. A minimum
 * value of six is required . A recommended value of at least 8 should be set
 * allowing a latency of two clock cycles to the application. If more latency is
 * required the value can be increased as necessary (latency = TAFL - 5). When the
 * FIFO level comes close to the maximum, so that there is no more space for at
 * least TX_ALMOST_FULL number of words, the pin ff_tx_rdy is deasserted. If the
 * application does not react on this signal, the FIFO write control logic, to
 * avoid FIFO overflow, truncates the current frame and sets the error status. As a
 * result, the frame will be transmitted with an GMII/MII error indication. See
 * Transmit FIFOFour programmable thresholds are available which control the core
 * operation as described below. for more information. A FIFO overflow is a fatal
 * error and requires a global reset on the transmit datapath or at least
 * deassertion of ETHEREN.
 */
/*@{*/
/*! @brief Read current value of the ENET_TAFL_TX_ALMOST_FULL field. */
#define ENET_RD_TAFL_TX_ALMOST_FULL(base) ((ENET_TAFL_REG(base) & ENET_TAFL_TX_ALMOST_FULL_MASK) >> ENET_TAFL_TX_ALMOST_FULL_SHIFT)
#define ENET_BRD_TAFL_TX_ALMOST_FULL(base) (BME_UBFX32(&ENET_TAFL_REG(base), ENET_TAFL_TX_ALMOST_FULL_SHIFT, ENET_TAFL_TX_ALMOST_FULL_WIDTH))

/*! @brief Set the TX_ALMOST_FULL field to a new value. */
#define ENET_WR_TAFL_TX_ALMOST_FULL(base, value) (ENET_RMW_TAFL(base, ENET_TAFL_TX_ALMOST_FULL_MASK, ENET_TAFL_TX_ALMOST_FULL(value)))
#define ENET_BWR_TAFL_TX_ALMOST_FULL(base, value) (BME_BFI32(&ENET_TAFL_REG(base), ((uint32_t)(value) << ENET_TAFL_TX_ALMOST_FULL_SHIFT), ENET_TAFL_TX_ALMOST_FULL_SHIFT, ENET_TAFL_TX_ALMOST_FULL_WIDTH))
/*@}*/

/*******************************************************************************
 * ENET_TIPG - Transmit Inter-Packet Gap
 ******************************************************************************/

/*!
 * @brief ENET_TIPG - Transmit Inter-Packet Gap (RW)
 *
 * Reset value: 0x0000000CU
 */
/*!
 * @name Constants and macros for entire ENET_TIPG register
 */
/*@{*/
#define ENET_RD_TIPG(base)       (ENET_TIPG_REG(base))
#define ENET_WR_TIPG(base, value) (ENET_TIPG_REG(base) = (value))
#define ENET_RMW_TIPG(base, mask, value) (ENET_WR_TIPG(base, (ENET_RD_TIPG(base) & ~(mask)) | (value)))
#define ENET_SET_TIPG(base, value) (BME_OR32(&ENET_TIPG_REG(base), (uint32_t)(value)))
#define ENET_CLR_TIPG(base, value) (BME_AND32(&ENET_TIPG_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_TIPG(base, value) (BME_XOR32(&ENET_TIPG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TIPG bitfields
 */

/*!
 * @name Register ENET_TIPG, field IPG[4:0] (RW)
 *
 * Indicates the IPG, in bytes, between transmitted frames. Valid values range
 * from 8 to 26. If the written value is less than 8 or greater than 26, the
 * internal (effective) IPG is 12. The IPG value read will be the value that was
 * written, even if it is out of range.
 */
/*@{*/
/*! @brief Read current value of the ENET_TIPG_IPG field. */
#define ENET_RD_TIPG_IPG(base) ((ENET_TIPG_REG(base) & ENET_TIPG_IPG_MASK) >> ENET_TIPG_IPG_SHIFT)
#define ENET_BRD_TIPG_IPG(base) (BME_UBFX32(&ENET_TIPG_REG(base), ENET_TIPG_IPG_SHIFT, ENET_TIPG_IPG_WIDTH))

/*! @brief Set the IPG field to a new value. */
#define ENET_WR_TIPG_IPG(base, value) (ENET_RMW_TIPG(base, ENET_TIPG_IPG_MASK, ENET_TIPG_IPG(value)))
#define ENET_BWR_TIPG_IPG(base, value) (BME_BFI32(&ENET_TIPG_REG(base), ((uint32_t)(value) << ENET_TIPG_IPG_SHIFT), ENET_TIPG_IPG_SHIFT, ENET_TIPG_IPG_WIDTH))
/*@}*/

