pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * ENET_FTRL - Frame Truncation Length
 ******************************************************************************/

/*!
 * @brief ENET_FTRL - Frame Truncation Length (RW)
 *
 * Reset value: 0x000007FFU
 */
/*!
 * @name Constants and macros for entire ENET_FTRL register
 */
/*@{*/
#define ENET_RD_FTRL(base)       (ENET_FTRL_REG(base))
#define ENET_WR_FTRL(base, value) (ENET_FTRL_REG(base) = (value))
#define ENET_RMW_FTRL(base, mask, value) (ENET_WR_FTRL(base, (ENET_RD_FTRL(base) & ~(mask)) | (value)))
#define ENET_SET_FTRL(base, value) (BME_OR32(&ENET_FTRL_REG(base), (uint32_t)(value)))
#define ENET_CLR_FTRL(base, value) (BME_AND32(&ENET_FTRL_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_FTRL(base, value) (BME_XOR32(&ENET_FTRL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_FTRL bitfields
 */

/*!
 * @name Register ENET_FTRL, field TRUNC_FL[13:0] (RW)
 *
 * Indicates the value a receive frame is truncated, if it is greater than this
 * value. Must be greater than or equal to RCR[MAX_FL]. Truncation happens at
 * TRUNC_FL. However, when truncation occurs, the application (FIFO) may receive
 * less data, guaranteeing that it never receives more than the set limit.
 */
/*@{*/
/*! @brief Read current value of the ENET_FTRL_TRUNC_FL field. */
#define ENET_RD_FTRL_TRUNC_FL(base) ((ENET_FTRL_REG(base) & ENET_FTRL_TRUNC_FL_MASK) >> ENET_FTRL_TRUNC_FL_SHIFT)
#define ENET_BRD_FTRL_TRUNC_FL(base) (ENET_RD_FTRL_TRUNC_FL(base))

/*! @brief Set the TRUNC_FL field to a new value. */
#define ENET_WR_FTRL_TRUNC_FL(base, value) (ENET_RMW_FTRL(base, ENET_FTRL_TRUNC_FL_MASK, ENET_FTRL_TRUNC_FL(value)))
#define ENET_BWR_FTRL_TRUNC_FL(base, value) (ENET_WR_FTRL_TRUNC_FL(base, value))
/*@}*/

/*******************************************************************************
 * ENET_TACC - Transmit Accelerator Function Configuration
 ******************************************************************************/

/*!
 * @brief ENET_TACC - Transmit Accelerator Function Configuration (RW)
 *
 * Reset value: 0x00000000U
 *
 * TACC controls accelerator actions when sending frames. The register can be
 * changed before or after each frame, but it must remain unmodified during frame
 * writes into the transmit FIFO. The TFWR[STRFWD] field must be set to use the
 * checksum feature.
 */
/*!
 * @name Constants and macros for entire ENET_TACC register
 */
/*@{*/
#define ENET_RD_TACC(base)       (ENET_TACC_REG(base))
#define ENET_WR_TACC(base, value) (ENET_TACC_REG(base) = (value))
#define ENET_RMW_TACC(base, mask, value) (ENET_WR_TACC(base, (ENET_RD_TACC(base) & ~(mask)) | (value)))
#define ENET_SET_TACC(base, value) (BME_OR32(&ENET_TACC_REG(base), (uint32_t)(value)))
#define ENET_CLR_TACC(base, value) (BME_AND32(&ENET_TACC_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_TACC(base, value) (BME_XOR32(&ENET_TACC_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_TACC bitfields
 */

/*!
 * @name Register ENET_TACC, field SHIFT16[0] (RW)
 *
 * Values:
 * - 0b0 - Disabled.
 * - 0b1 - Indicates to the transmit data FIFO that the written frames contain
 *     two additional octets before the frame data. This means the actual frame
 *     begins at bit 16 of the first word written into the FIFO. This function
 *     allows putting the frame payload on a 32-bit boundary in memory, as the
 *     14-byte Ethernet header is extended to a 16-byte header.
 */
/*@{*/
/*! @brief Read current value of the ENET_TACC_SHIFT16 field. */
#define ENET_RD_TACC_SHIFT16(base) ((ENET_TACC_REG(base) & ENET_TACC_SHIFT16_MASK) >> ENET_TACC_SHIFT16_SHIFT)
#define ENET_BRD_TACC_SHIFT16(base) (BME_UBFX32(&ENET_TACC_REG(base), ENET_TACC_SHIFT16_SHIFT, ENET_TACC_SHIFT16_WIDTH))

/*! @brief Set the SHIFT16 field to a new value. */
#define ENET_WR_TACC_SHIFT16(base, value) (ENET_RMW_TACC(base, ENET_TACC_SHIFT16_MASK, ENET_TACC_SHIFT16(value)))
#define ENET_BWR_TACC_SHIFT16(base, value) (BME_BFI32(&ENET_TACC_REG(base), ((uint32_t)(value) << ENET_TACC_SHIFT16_SHIFT), ENET_TACC_SHIFT16_SHIFT, ENET_TACC_SHIFT16_WIDTH))
/*@}*/

/*!
 * @name Register ENET_TACC, field IPCHK[3] (RW)
 *
 * Enables insertion of IP header checksum.
 *
 * Values:
 * - 0b0 - Checksum is not inserted.
 * - 0b1 - If an IP frame is transmitted, the checksum is inserted
 *     automatically. The IP header checksum field must be cleared. If a non-IP frame is
 *     transmitted the frame is not modified.
 */
/*@{*/
/*! @brief Read current value of the ENET_TACC_IPCHK field. */
#define ENET_RD_TACC_IPCHK(base) ((ENET_TACC_REG(base) & ENET_TACC_IPCHK_MASK) >> ENET_TACC_IPCHK_SHIFT)
#define ENET_BRD_TACC_IPCHK(base) (BME_UBFX32(&ENET_TACC_REG(base), ENET_TACC_IPCHK_SHIFT, ENET_TACC_IPCHK_WIDTH))

/*! @brief Set the IPCHK field to a new value. */
#define ENET_WR_TACC_IPCHK(base, value) (ENET_RMW_TACC(base, ENET_TACC_IPCHK_MASK, ENET_TACC_IPCHK(value)))
#define ENET_BWR_TACC_IPCHK(base, value) (BME_BFI32(&ENET_TACC_REG(base), ((uint32_t)(value) << ENET_TACC_IPCHK_SHIFT), ENET_TACC_IPCHK_SHIFT, ENET_TACC_IPCHK_WIDTH))
/*@}*/

/*!
 * @name Register ENET_TACC, field PROCHK[4] (RW)
 *
 * Enables insertion of protocol checksum.
 *
 * Values:
 * - 0b0 - Checksum not inserted.
 * - 0b1 - If an IP frame with a known protocol is transmitted, the checksum is
 *     inserted automatically into the frame. The checksum field must be cleared.
 *     The other frames are not modified.
 */
/*@{*/
/*! @brief Read current value of the ENET_TACC_PROCHK field. */
#define ENET_RD_TACC_PROCHK(base) ((ENET_TACC_REG(base) & ENET_TACC_PROCHK_MASK) >> ENET_TACC_PROCHK_SHIFT)
#define ENET_BRD_TACC_PROCHK(base) (BME_UBFX32(&ENET_TACC_REG(base), ENET_TACC_PROCHK_SHIFT, ENET_TACC_PROCHK_WIDTH))

/*! @brief Set the PROCHK field to a new value. */
#define ENET_WR_TACC_PROCHK(base, value) (ENET_RMW_TACC(base, ENET_TACC_PROCHK_MASK, ENET_TACC_PROCHK(value)))
#define ENET_BWR_TACC_PROCHK(base, value) (BME_BFI32(&ENET_TACC_REG(base), ((uint32_t)(value) << ENET_TACC_PROCHK_SHIFT), ENET_TACC_PROCHK_SHIFT, ENET_TACC_PROCHK_WIDTH))
/*@}*/

