pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * ENET_RACC - Receive Accelerator Function Configuration
 ******************************************************************************/

/*!
 * @brief ENET_RACC - Receive Accelerator Function Configuration (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RACC register
 */
/*@{*/
#define ENET_RD_RACC(base)       (ENET_RACC_REG(base))
#define ENET_WR_RACC(base, value) (ENET_RACC_REG(base) = (value))
#define ENET_RMW_RACC(base, mask, value) (ENET_WR_RACC(base, (ENET_RD_RACC(base) & ~(mask)) | (value)))
#define ENET_SET_RACC(base, value) (BME_OR32(&ENET_RACC_REG(base), (uint32_t)(value)))
#define ENET_CLR_RACC(base, value) (BME_AND32(&ENET_RACC_REG(base), (uint32_t)(~(value))))
#define ENET_TOG_RACC(base, value) (BME_XOR32(&ENET_RACC_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RACC bitfields
 */

/*!
 * @name Register ENET_RACC, field PADREM[0] (RW)
 *
 * Values:
 * - 0b0 - Padding not removed.
 * - 0b1 - Any bytes following the IP payload section of the frame are removed
 *     from the frame.
 */
/*@{*/
/*! @brief Read current value of the ENET_RACC_PADREM field. */
#define ENET_RD_RACC_PADREM(base) ((ENET_RACC_REG(base) & ENET_RACC_PADREM_MASK) >> ENET_RACC_PADREM_SHIFT)
#define ENET_BRD_RACC_PADREM(base) (BME_UBFX32(&ENET_RACC_REG(base), ENET_RACC_PADREM_SHIFT, ENET_RACC_PADREM_WIDTH))

/*! @brief Set the PADREM field to a new value. */
#define ENET_WR_RACC_PADREM(base, value) (ENET_RMW_RACC(base, ENET_RACC_PADREM_MASK, ENET_RACC_PADREM(value)))
#define ENET_BWR_RACC_PADREM(base, value) (BME_BFI32(&ENET_RACC_REG(base), ((uint32_t)(value) << ENET_RACC_PADREM_SHIFT), ENET_RACC_PADREM_SHIFT, ENET_RACC_PADREM_WIDTH))
/*@}*/

/*!
 * @name Register ENET_RACC, field IPDIS[1] (RW)
 *
 * Values:
 * - 0b0 - Frames with wrong IPv4 header checksum are not discarded.
 * - 0b1 - If an IPv4 frame is received with a mismatching header checksum, the
 *     frame is discarded. IPv6 has no header checksum and is not affected by
 *     this setting. Discarding is only available when the RX FIFO operates in store
 *     and forward mode (RSFL cleared).
 */
/*@{*/
/*! @brief Read current value of the ENET_RACC_IPDIS field. */
#define ENET_RD_RACC_IPDIS(base) ((ENET_RACC_REG(base) & ENET_RACC_IPDIS_MASK) >> ENET_RACC_IPDIS_SHIFT)
#define ENET_BRD_RACC_IPDIS(base) (BME_UBFX32(&ENET_RACC_REG(base), ENET_RACC_IPDIS_SHIFT, ENET_RACC_IPDIS_WIDTH))

/*! @brief Set the IPDIS field to a new value. */
#define ENET_WR_RACC_IPDIS(base, value) (ENET_RMW_RACC(base, ENET_RACC_IPDIS_MASK, ENET_RACC_IPDIS(value)))
#define ENET_BWR_RACC_IPDIS(base, value) (BME_BFI32(&ENET_RACC_REG(base), ((uint32_t)(value) << ENET_RACC_IPDIS_SHIFT), ENET_RACC_IPDIS_SHIFT, ENET_RACC_IPDIS_WIDTH))
/*@}*/

/*!
 * @name Register ENET_RACC, field PRODIS[2] (RW)
 *
 * Values:
 * - 0b0 - Frames with wrong checksum are not discarded.
 * - 0b1 - If a TCP/IP, UDP/IP, or ICMP/IP frame is received that has a wrong
 *     TCP, UDP, or ICMP checksum, the frame is discarded. Discarding is only
 *     available when the RX FIFO operates in store and forward mode (RSFL cleared).
 */
/*@{*/
/*! @brief Read current value of the ENET_RACC_PRODIS field. */
#define ENET_RD_RACC_PRODIS(base) ((ENET_RACC_REG(base) & ENET_RACC_PRODIS_MASK) >> ENET_RACC_PRODIS_SHIFT)
#define ENET_BRD_RACC_PRODIS(base) (BME_UBFX32(&ENET_RACC_REG(base), ENET_RACC_PRODIS_SHIFT, ENET_RACC_PRODIS_WIDTH))

/*! @brief Set the PRODIS field to a new value. */
#define ENET_WR_RACC_PRODIS(base, value) (ENET_RMW_RACC(base, ENET_RACC_PRODIS_MASK, ENET_RACC_PRODIS(value)))
#define ENET_BWR_RACC_PRODIS(base, value) (BME_BFI32(&ENET_RACC_REG(base), ((uint32_t)(value) << ENET_RACC_PRODIS_SHIFT), ENET_RACC_PRODIS_SHIFT, ENET_RACC_PRODIS_WIDTH))
/*@}*/

/*!
 * @name Register ENET_RACC, field LINEDIS[6] (RW)
 *
 * Values:
 * - 0b0 - Frames with errors are not discarded.
 * - 0b1 - Any frame received with a CRC, length, or PHY error is automatically
 *     discarded and not forwarded to the user application interface.
 */
/*@{*/
/*! @brief Read current value of the ENET_RACC_LINEDIS field. */
#define ENET_RD_RACC_LINEDIS(base) ((ENET_RACC_REG(base) & ENET_RACC_LINEDIS_MASK) >> ENET_RACC_LINEDIS_SHIFT)
#define ENET_BRD_RACC_LINEDIS(base) (BME_UBFX32(&ENET_RACC_REG(base), ENET_RACC_LINEDIS_SHIFT, ENET_RACC_LINEDIS_WIDTH))

/*! @brief Set the LINEDIS field to a new value. */
#define ENET_WR_RACC_LINEDIS(base, value) (ENET_RMW_RACC(base, ENET_RACC_LINEDIS_MASK, ENET_RACC_LINEDIS(value)))
#define ENET_BWR_RACC_LINEDIS(base, value) (BME_BFI32(&ENET_RACC_REG(base), ((uint32_t)(value) << ENET_RACC_LINEDIS_SHIFT), ENET_RACC_LINEDIS_SHIFT, ENET_RACC_LINEDIS_WIDTH))
/*@}*/

/*!
 * @name Register ENET_RACC, field SHIFT16[7] (RW)
 *
 * When this field is set, the actual frame data starts at bit 16 of the first
 * word read from the RX FIFO aligning the Ethernet payload on a 32-bit boundary.
 * This function only affects the FIFO storage and has no influence on the
 * statistics, which use the actual length of the frame received.
 *
 * Values:
 * - 0b0 - Disabled.
 * - 0b1 - Instructs the MAC to write two additional bytes in front of each
 *     frame received into the RX FIFO.
 */
/*@{*/
/*! @brief Read current value of the ENET_RACC_SHIFT16 field. */
#define ENET_RD_RACC_SHIFT16(base) ((ENET_RACC_REG(base) & ENET_RACC_SHIFT16_MASK) >> ENET_RACC_SHIFT16_SHIFT)
#define ENET_BRD_RACC_SHIFT16(base) (BME_UBFX32(&ENET_RACC_REG(base), ENET_RACC_SHIFT16_SHIFT, ENET_RACC_SHIFT16_WIDTH))

/*! @brief Set the SHIFT16 field to a new value. */
#define ENET_WR_RACC_SHIFT16(base, value) (ENET_RMW_RACC(base, ENET_RACC_SHIFT16_MASK, ENET_RACC_SHIFT16(value)))
#define ENET_BWR_RACC_SHIFT16(base, value) (BME_BFI32(&ENET_RACC_REG(base), ((uint32_t)(value) << ENET_RACC_SHIFT16_SHIFT), ENET_RACC_SHIFT16_SHIFT, ENET_RACC_SHIFT16_WIDTH))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_DROP - Reserved Statistic Register
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_DROP - Reserved Statistic Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_DROP register
 */
/*@{*/
#define ENET_RD_RMON_T_DROP(base) (ENET_RMON_T_DROP_REG(base))
/*@}*/

