pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * FB_CSPMCR - Chip Select port Multiplexing Control Register
 ******************************************************************************/

/*!
 * @brief FB_CSPMCR - Chip Select port Multiplexing Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Controls the multiplexing of the FlexBus signals. A bus error occurs when you
 * do any of the following: Write to a reserved address Write to a reserved
 * field in this register, or Access this register using a size other than 32 bits.
 */
/*!
 * @name Constants and macros for entire FB_CSPMCR register
 */
/*@{*/
#define FB_RD_CSPMCR(base)       (FB_CSPMCR_REG(base))
#define FB_WR_CSPMCR(base, value) (FB_CSPMCR_REG(base) = (value))
#define FB_RMW_CSPMCR(base, mask, value) (FB_WR_CSPMCR(base, (FB_RD_CSPMCR(base) & ~(mask)) | (value)))
#define FB_SET_CSPMCR(base, value) (BME_OR32(&FB_CSPMCR_REG(base), (uint32_t)(value)))
#define FB_CLR_CSPMCR(base, value) (BME_AND32(&FB_CSPMCR_REG(base), (uint32_t)(~(value))))
#define FB_TOG_CSPMCR(base, value) (BME_XOR32(&FB_CSPMCR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FB_CSPMCR bitfields
 */

/*!
 * @name Register FB_CSPMCR, field GROUP5[15:12] (RW)
 *
 * Controls the multiplexing of the FB_TA , FB_CS3 , and FB_BE_7_0 signals. When
 * GROUP5 is not 0000b, you must write 1b to the CSCR[AA] bit. Otherwise, the
 * bus hangs during a transfer.
 *
 * Values:
 * - 0b0000 - FB_TA
 * - 0b0001 - FB_CS3 . You must also write 1b to CSCR[AA].
 * - 0b0010 - FB_BE_7_0 . You must also write 1b to CSCR[AA].
 */
/*@{*/
/*! @brief Read current value of the FB_CSPMCR_GROUP5 field. */
#define FB_RD_CSPMCR_GROUP5(base) ((FB_CSPMCR_REG(base) & FB_CSPMCR_GROUP5_MASK) >> FB_CSPMCR_GROUP5_SHIFT)
#define FB_BRD_CSPMCR_GROUP5(base) (BME_UBFX32(&FB_CSPMCR_REG(base), FB_CSPMCR_GROUP5_SHIFT, FB_CSPMCR_GROUP5_WIDTH))

/*! @brief Set the GROUP5 field to a new value. */
#define FB_WR_CSPMCR_GROUP5(base, value) (FB_RMW_CSPMCR(base, FB_CSPMCR_GROUP5_MASK, FB_CSPMCR_GROUP5(value)))
#define FB_BWR_CSPMCR_GROUP5(base, value) (BME_BFI32(&FB_CSPMCR_REG(base), ((uint32_t)(value) << FB_CSPMCR_GROUP5_SHIFT), FB_CSPMCR_GROUP5_SHIFT, FB_CSPMCR_GROUP5_WIDTH))
/*@}*/

/*!
 * @name Register FB_CSPMCR, field GROUP4[19:16] (RW)
 *
 * Controls the multiplexing of the FB_TBST , FB_CS2 , and FB_BE_15_8 signals.
 *
 * Values:
 * - 0b0000 - FB_TBST
 * - 0b0001 - FB_CS2
 * - 0b0010 - FB_BE_15_8
 */
/*@{*/
/*! @brief Read current value of the FB_CSPMCR_GROUP4 field. */
#define FB_RD_CSPMCR_GROUP4(base) ((FB_CSPMCR_REG(base) & FB_CSPMCR_GROUP4_MASK) >> FB_CSPMCR_GROUP4_SHIFT)
#define FB_BRD_CSPMCR_GROUP4(base) (BME_UBFX32(&FB_CSPMCR_REG(base), FB_CSPMCR_GROUP4_SHIFT, FB_CSPMCR_GROUP4_WIDTH))

/*! @brief Set the GROUP4 field to a new value. */
#define FB_WR_CSPMCR_GROUP4(base, value) (FB_RMW_CSPMCR(base, FB_CSPMCR_GROUP4_MASK, FB_CSPMCR_GROUP4(value)))
#define FB_BWR_CSPMCR_GROUP4(base, value) (BME_BFI32(&FB_CSPMCR_REG(base), ((uint32_t)(value) << FB_CSPMCR_GROUP4_SHIFT), FB_CSPMCR_GROUP4_SHIFT, FB_CSPMCR_GROUP4_WIDTH))
/*@}*/

/*!
 * @name Register FB_CSPMCR, field GROUP3[23:20] (RW)
 *
 * Controls the multiplexing of the FB_CS5 , FB_TSIZ1, and FB_BE_23_16 signals.
 *
 * Values:
 * - 0b0000 - FB_CS5
 * - 0b0001 - FB_TSIZ1
 * - 0b0010 - FB_BE_23_16
 */
/*@{*/
/*! @brief Read current value of the FB_CSPMCR_GROUP3 field. */
#define FB_RD_CSPMCR_GROUP3(base) ((FB_CSPMCR_REG(base) & FB_CSPMCR_GROUP3_MASK) >> FB_CSPMCR_GROUP3_SHIFT)
#define FB_BRD_CSPMCR_GROUP3(base) (BME_UBFX32(&FB_CSPMCR_REG(base), FB_CSPMCR_GROUP3_SHIFT, FB_CSPMCR_GROUP3_WIDTH))

/*! @brief Set the GROUP3 field to a new value. */
#define FB_WR_CSPMCR_GROUP3(base, value) (FB_RMW_CSPMCR(base, FB_CSPMCR_GROUP3_MASK, FB_CSPMCR_GROUP3(value)))
#define FB_BWR_CSPMCR_GROUP3(base, value) (BME_BFI32(&FB_CSPMCR_REG(base), ((uint32_t)(value) << FB_CSPMCR_GROUP3_SHIFT), FB_CSPMCR_GROUP3_SHIFT, FB_CSPMCR_GROUP3_WIDTH))
/*@}*/

/*!
 * @name Register FB_CSPMCR, field GROUP2[27:24] (RW)
 *
 * Controls the multiplexing of the FB_CS4 , FB_TSIZ0, and FB_BE_31_24 signals.
 *
 * Values:
 * - 0b0000 - FB_CS4
 * - 0b0001 - FB_TSIZ0
 * - 0b0010 - FB_BE_31_24
 */
/*@{*/
/*! @brief Read current value of the FB_CSPMCR_GROUP2 field. */
#define FB_RD_CSPMCR_GROUP2(base) ((FB_CSPMCR_REG(base) & FB_CSPMCR_GROUP2_MASK) >> FB_CSPMCR_GROUP2_SHIFT)
#define FB_BRD_CSPMCR_GROUP2(base) (BME_UBFX32(&FB_CSPMCR_REG(base), FB_CSPMCR_GROUP2_SHIFT, FB_CSPMCR_GROUP2_WIDTH))

/*! @brief Set the GROUP2 field to a new value. */
#define FB_WR_CSPMCR_GROUP2(base, value) (FB_RMW_CSPMCR(base, FB_CSPMCR_GROUP2_MASK, FB_CSPMCR_GROUP2(value)))
#define FB_BWR_CSPMCR_GROUP2(base, value) (BME_BFI32(&FB_CSPMCR_REG(base), ((uint32_t)(value) << FB_CSPMCR_GROUP2_SHIFT), FB_CSPMCR_GROUP2_SHIFT, FB_CSPMCR_GROUP2_WIDTH))
/*@}*/

/*!
 * @name Register FB_CSPMCR, field GROUP1[31:28] (RW)
 *
 * Controls the multiplexing of the FB_ALE, FB_CS1 , and FB_TS signals.
 *
 * Values:
 * - 0b0000 - FB_ALE
 * - 0b0001 - FB_CS1
 * - 0b0010 - FB_TS
 */
/*@{*/
/*! @brief Read current value of the FB_CSPMCR_GROUP1 field. */
#define FB_RD_CSPMCR_GROUP1(base) ((FB_CSPMCR_REG(base) & FB_CSPMCR_GROUP1_MASK) >> FB_CSPMCR_GROUP1_SHIFT)
#define FB_BRD_CSPMCR_GROUP1(base) (BME_UBFX32(&FB_CSPMCR_REG(base), FB_CSPMCR_GROUP1_SHIFT, FB_CSPMCR_GROUP1_WIDTH))

/*! @brief Set the GROUP1 field to a new value. */
#define FB_WR_CSPMCR_GROUP1(base, value) (FB_RMW_CSPMCR(base, FB_CSPMCR_GROUP1_MASK, FB_CSPMCR_GROUP1(value)))
#define FB_BWR_CSPMCR_GROUP1(base, value) (BME_BFI32(&FB_CSPMCR_REG(base), ((uint32_t)(value) << FB_CSPMCR_GROUP1_SHIFT), FB_CSPMCR_GROUP1_SHIFT, FB_CSPMCR_GROUP1_WIDTH))
/*@}*/

/*
 * MKV58F22 FMC
 *
 * Flash Memory Controller
 *
 * Registers defined in this header file:
 * - FMC_PFAPR - Flash Access Protection Register
 * - FMC_PFB0CR - Flash Bank 0 Control Register
 * - FMC_PFB1CR - Flash Bank 1 Control Register
 */

#define FMC_INSTANCE_COUNT (1U) /*!< Number of instances of the FMC module. */
#define FMC_IDX (0U) /*!< Instance number for FMC. */

