pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * FTFE_FCNFG - Flash Configuration Register
 ******************************************************************************/

/*!
 * @brief FTFE_FCNFG - Flash Configuration Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register provides information on the current functional state of the
 * FTFE module. The erase control bits (ERSAREQ and ERSSUSP) have write
 * restrictions. PFLSH, RAMRDY, and EEERDY are read-only status bits. The reset values for
 * the PFLSH, RAMRDY, and EEERDY bits are determined during the reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFE_FCNFG register
 */
/*@{*/
#define FTFE_RD_FCNFG(base)      (FTFE_FCNFG_REG(base))
#define FTFE_WR_FCNFG(base, value) (FTFE_FCNFG_REG(base) = (value))
#define FTFE_RMW_FCNFG(base, mask, value) (FTFE_WR_FCNFG(base, (FTFE_RD_FCNFG(base) & ~(mask)) | (value)))
#define FTFE_SET_FCNFG(base, value) (BME_OR8(&FTFE_FCNFG_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCNFG(base, value) (BME_AND8(&FTFE_FCNFG_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCNFG(base, value) (BME_XOR8(&FTFE_FCNFG_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual FTFE_FCNFG bitfields
 */

/*!
 * @name Register FTFE_FCNFG, field EEERDY[0] (RO)
 *
 * This bit is reserved and always has the value 0.
 *
 * Values:
 * - 0b0 - See RAMRDY for availability of programming acceleration RAM
 * - 0b1 - Reserved
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_EEERDY field. */
#define FTFE_RD_FCNFG_EEERDY(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_EEERDY_MASK) >> FTFE_FCNFG_EEERDY_SHIFT)
#define FTFE_BRD_FCNFG_EEERDY(base) (BME_UBFX8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_EEERDY_SHIFT, FTFE_FCNFG_EEERDY_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field RAMRDY[1] (RO)
 *
 * This flag indicates the current status of the programming acceleration RAM.
 * This bit should always be set.
 *
 * Values:
 * - 0b0 - Programming acceleration RAM is not available
 * - 0b1 - Programming acceleration RAM is available
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_RAMRDY field. */
#define FTFE_RD_FCNFG_RAMRDY(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_RAMRDY_MASK) >> FTFE_FCNFG_RAMRDY_SHIFT)
#define FTFE_BRD_FCNFG_RAMRDY(base) (BME_UBFX8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_RAMRDY_SHIFT, FTFE_FCNFG_RAMRDY_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field PFLSH[2] (RO)
 *
 * Values:
 * - 0b0 - Reserved
 * - 0b1 - FTFE configuration supports four program flash blocks
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_PFLSH field. */
#define FTFE_RD_FCNFG_PFLSH(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_PFLSH_MASK) >> FTFE_FCNFG_PFLSH_SHIFT)
#define FTFE_BRD_FCNFG_PFLSH(base) (BME_UBFX8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_PFLSH_SHIFT, FTFE_FCNFG_PFLSH_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field ERSSUSP[4] (RW)
 *
 * The ERSSUSP bit allows the user to suspend (interrupt) the Erase Flash Sector
 * command while it is executing.
 *
 * Values:
 * - 0b0 - No suspend requested
 * - 0b1 - Suspend the current Erase Flash Sector command execution
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_ERSSUSP field. */
#define FTFE_RD_FCNFG_ERSSUSP(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_ERSSUSP_MASK) >> FTFE_FCNFG_ERSSUSP_SHIFT)
#define FTFE_BRD_FCNFG_ERSSUSP(base) (BME_UBFX8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_ERSSUSP_SHIFT, FTFE_FCNFG_ERSSUSP_WIDTH))

/*! @brief Set the ERSSUSP field to a new value. */
#define FTFE_WR_FCNFG_ERSSUSP(base, value) (FTFE_RMW_FCNFG(base, FTFE_FCNFG_ERSSUSP_MASK, FTFE_FCNFG_ERSSUSP(value)))
#define FTFE_BWR_FCNFG_ERSSUSP(base, value) (BME_BFI8(&FTFE_FCNFG_REG(base), ((uint8_t)(value) << FTFE_FCNFG_ERSSUSP_SHIFT), FTFE_FCNFG_ERSSUSP_SHIFT, FTFE_FCNFG_ERSSUSP_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field ERSAREQ[5] (RO)
 *
 * This bit issues a request to the memory controller to execute the Erase All
 * Blocks command and release security. ERSAREQ is not directly writable but is
 * under indirect user control. Refer to the device's Chip Configuration details on
 * how to request this command. The ERSAREQ bit sets when an erase all request
 * is triggered external to the FTFE and CCIF is set (no command is currently
 * being executed). ERSAREQ is cleared by the FTFE when the operation completes.
 *
 * Values:
 * - 0b0 - No request or request complete
 * - 0b1 - Request to: run the Erase All Blocks command, verify the erased
 *     state, program the security byte in the Flash Configuration Field to the
 *     unsecure state, and release MCU security by setting the FSEC[SEC] field to the
 *     unsecure state
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_ERSAREQ field. */
#define FTFE_RD_FCNFG_ERSAREQ(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_ERSAREQ_MASK) >> FTFE_FCNFG_ERSAREQ_SHIFT)
#define FTFE_BRD_FCNFG_ERSAREQ(base) (BME_UBFX8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_ERSAREQ_SHIFT, FTFE_FCNFG_ERSAREQ_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field RDCOLLIE[6] (RW)
 *
 * The RDCOLLIE bit controls interrupt generation when an FTFE read collision
 * error occurs.
 *
 * Values:
 * - 0b0 - Read collision error interrupt disabled
 * - 0b1 - Read collision error interrupt enabled. An interrupt request is
 *     generated whenever an FTFE read collision error is detected (see the
 *     description of FSTAT[RDCOLERR]).
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_RDCOLLIE field. */
#define FTFE_RD_FCNFG_RDCOLLIE(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_RDCOLLIE_MASK) >> FTFE_FCNFG_RDCOLLIE_SHIFT)
#define FTFE_BRD_FCNFG_RDCOLLIE(base) (BME_UBFX8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_RDCOLLIE_SHIFT, FTFE_FCNFG_RDCOLLIE_WIDTH))

/*! @brief Set the RDCOLLIE field to a new value. */
#define FTFE_WR_FCNFG_RDCOLLIE(base, value) (FTFE_RMW_FCNFG(base, FTFE_FCNFG_RDCOLLIE_MASK, FTFE_FCNFG_RDCOLLIE(value)))
#define FTFE_BWR_FCNFG_RDCOLLIE(base, value) (BME_BFI8(&FTFE_FCNFG_REG(base), ((uint8_t)(value) << FTFE_FCNFG_RDCOLLIE_SHIFT), FTFE_FCNFG_RDCOLLIE_SHIFT, FTFE_FCNFG_RDCOLLIE_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FCNFG, field CCIE[7] (RW)
 *
 * The CCIE bit controls interrupt generation when an FTFE command completes.
 *
 * Values:
 * - 0b0 - Command complete interrupt disabled
 * - 0b1 - Command complete interrupt enabled. An interrupt request is generated
 *     whenever the FSTAT[CCIF] flag is set.
 */
/*@{*/
/*! @brief Read current value of the FTFE_FCNFG_CCIE field. */
#define FTFE_RD_FCNFG_CCIE(base) ((FTFE_FCNFG_REG(base) & FTFE_FCNFG_CCIE_MASK) >> FTFE_FCNFG_CCIE_SHIFT)
#define FTFE_BRD_FCNFG_CCIE(base) (BME_UBFX8(&FTFE_FCNFG_REG(base), FTFE_FCNFG_CCIE_SHIFT, FTFE_FCNFG_CCIE_WIDTH))

/*! @brief Set the CCIE field to a new value. */
#define FTFE_WR_FCNFG_CCIE(base, value) (FTFE_RMW_FCNFG(base, FTFE_FCNFG_CCIE_MASK, FTFE_FCNFG_CCIE(value)))
#define FTFE_BWR_FCNFG_CCIE(base, value) (BME_BFI8(&FTFE_FCNFG_REG(base), ((uint8_t)(value) << FTFE_FCNFG_CCIE_SHIFT), FTFE_FCNFG_CCIE_SHIFT, FTFE_FCNFG_CCIE_WIDTH))
/*@}*/

