pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * FTFE_FSEC - Flash Security Register
 ******************************************************************************/

/*!
 * @brief FTFE_FSEC - Flash Security Register (RO)
 *
 * Reset value: 0x00U
 *
 * This read-only register holds all bits associated with the security of the
 * MCU and FTFE module. During the reset sequence, the register is loaded with the
 * contents of the flash security byte in the Flash Configuration Field located
 * in program flash memory. The Flash basis for the values is signified by X in
 * the reset value.
 */
/*!
 * @name Constants and macros for entire FTFE_FSEC register
 */
/*@{*/
#define FTFE_RD_FSEC(base)       (FTFE_FSEC_REG(base))
/*@}*/

/*
 * Constants & macros for individual FTFE_FSEC bitfields
 */

/*!
 * @name Register FTFE_FSEC, field SEC[1:0] (RO)
 *
 * These bits define the security state of the MCU. In the secure state, the MCU
 * limits access to FTFE module resources. The limitations are defined per
 * device and are detailed in the Chip Configuration details. If the FTFE module is
 * unsecured using backdoor key access, the SEC bits are forced to 10b.
 *
 * Values:
 * - 0b00 - MCU security status is secure
 * - 0b01 - MCU security status is secure
 * - 0b10 - MCU security status is unsecure (The standard shipping condition of
 *     the FTFE is unsecure.)
 * - 0b11 - MCU security status is secure
 */
/*@{*/
/*! @brief Read current value of the FTFE_FSEC_SEC field. */
#define FTFE_RD_FSEC_SEC(base) ((FTFE_FSEC_REG(base) & FTFE_FSEC_SEC_MASK) >> FTFE_FSEC_SEC_SHIFT)
#define FTFE_BRD_FSEC_SEC(base) (BME_UBFX8(&FTFE_FSEC_REG(base), FTFE_FSEC_SEC_SHIFT, FTFE_FSEC_SEC_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FSEC, field FSLACC[3:2] (RO)
 *
 * These bits enable or disable access to the flash memory contents during
 * returned part failure analysis at Freescale. When SEC is secure and FSLACC is
 * denied, access to the program flash contents is denied and any failure analysis
 * performed by Freescale factory test must begin with a full erase to unsecure the
 * part. When access is granted (SEC is unsecure, or SEC is secure and FSLACC is
 * granted), Freescale factory testing has visibility of the current flash
 * contents. The state of the FSLACC bits is only relevant when the SEC bits are set to
 * secure. When the SEC field is set to unsecure, the FSLACC setting does not
 * matter.
 *
 * Values:
 * - 0b00 - Freescale factory access granted
 * - 0b01 - Freescale factory access denied
 * - 0b10 - Freescale factory access denied
 * - 0b11 - Freescale factory access granted
 */
/*@{*/
/*! @brief Read current value of the FTFE_FSEC_FSLACC field. */
#define FTFE_RD_FSEC_FSLACC(base) ((FTFE_FSEC_REG(base) & FTFE_FSEC_FSLACC_MASK) >> FTFE_FSEC_FSLACC_SHIFT)
#define FTFE_BRD_FSEC_FSLACC(base) (BME_UBFX8(&FTFE_FSEC_REG(base), FTFE_FSEC_FSLACC_SHIFT, FTFE_FSEC_FSLACC_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FSEC, field MEEN[5:4] (RO)
 *
 * Enables and disables mass erase capability of the FTFE module. The state of
 * the MEEN bits is only relevant when the SEC bits are set to secure outside of
 * NVM Normal Mode. When the SEC field is set to unsecure, the MEEN setting does
 * not matter.
 *
 * Values:
 * - 0b00 - Mass erase is enabled
 * - 0b01 - Mass erase is enabled
 * - 0b10 - Mass erase is disabled
 * - 0b11 - Mass erase is enabled
 */
/*@{*/
/*! @brief Read current value of the FTFE_FSEC_MEEN field. */
#define FTFE_RD_FSEC_MEEN(base) ((FTFE_FSEC_REG(base) & FTFE_FSEC_MEEN_MASK) >> FTFE_FSEC_MEEN_SHIFT)
#define FTFE_BRD_FSEC_MEEN(base) (BME_UBFX8(&FTFE_FSEC_REG(base), FTFE_FSEC_MEEN_SHIFT, FTFE_FSEC_MEEN_WIDTH))
/*@}*/

/*!
 * @name Register FTFE_FSEC, field KEYEN[7:6] (RO)
 *
 * These bits enable and disable backdoor key access to the FTFE module.
 *
 * Values:
 * - 0b00 - Backdoor key access disabled
 * - 0b01 - Backdoor key access disabled (preferred KEYEN state to disable
 *     backdoor key access)
 * - 0b10 - Backdoor key access enabled
 * - 0b11 - Backdoor key access disabled
 */
/*@{*/
/*! @brief Read current value of the FTFE_FSEC_KEYEN field. */
#define FTFE_RD_FSEC_KEYEN(base) ((FTFE_FSEC_REG(base) & FTFE_FSEC_KEYEN_MASK) >> FTFE_FSEC_KEYEN_SHIFT)
#define FTFE_BRD_FSEC_KEYEN(base) (BME_UBFX8(&FTFE_FSEC_REG(base), FTFE_FSEC_KEYEN_SHIFT, FTFE_FSEC_KEYEN_WIDTH))
/*@}*/

/*******************************************************************************
 * FTFE_FOPT - Flash Option Register
 ******************************************************************************/

/*!
 * @brief FTFE_FOPT - Flash Option Register (RO)
 *
 * Reset value: 0x00U
 *
 * The flash option register allows the MCU to customize its operations by
 * examining the state of these read-only bits, which are loaded from NVM at reset.
 * The function of the bits is defined in the device's Chip Configuration details.
 * All bits in the register are read-only. During the reset sequence, the
 * register is loaded from the flash nonvolatile option byte in the Flash Configuration
 * Field located in program flash memory. The flash basis for the values is
 * signified by X in the reset value.
 */
/*!
 * @name Constants and macros for entire FTFE_FOPT register
 */
/*@{*/
#define FTFE_RD_FOPT(base)       (FTFE_FOPT_REG(base))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB3 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB3 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB3 register
 */
/*@{*/
#define FTFE_RD_FCCOB3(base)     (FTFE_FCCOB3_REG(base))
#define FTFE_WR_FCCOB3(base, value) (FTFE_FCCOB3_REG(base) = (value))
#define FTFE_RMW_FCCOB3(base, mask, value) (FTFE_WR_FCCOB3(base, (FTFE_RD_FCCOB3(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB3(base, value) (BME_OR8(&FTFE_FCCOB3_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FCCOB3(base, value) (BME_AND8(&FTFE_FCCOB3_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FCCOB3(base, value) (BME_XOR8(&FTFE_FCCOB3_REG(base), (uint8_t)(value)))
/*@}*/

