pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * FTFE_FPROT2 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT2 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions of equal
 * memory size. Program flash protection register Program flash protection bits
 * FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During
 * the reset sequence, the FPROT registers are loaded with the contents of the
 * program flash protection bytes in the Flash Configuration Field as indicated in
 * the following table. Program flash protection register Flash Configuration Field
 * offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To
 * change the program flash protection that is loaded during the reset sequence,
 * unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT2 register
 */
/*@{*/
#define FTFE_RD_FPROT2(base)     (FTFE_FPROT2_REG(base))
#define FTFE_WR_FPROT2(base, value) (FTFE_FPROT2_REG(base) = (value))
#define FTFE_RMW_FPROT2(base, mask, value) (FTFE_WR_FPROT2(base, (FTFE_RD_FPROT2(base) & ~(mask)) | (value)))
#define FTFE_SET_FPROT2(base, value) (BME_OR8(&FTFE_FPROT2_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FPROT2(base, value) (BME_AND8(&FTFE_FPROT2_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FPROT2(base, value) (BME_XOR8(&FTFE_FPROT2_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FPROT1 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT1 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions of equal
 * memory size. Program flash protection register Program flash protection bits
 * FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During
 * the reset sequence, the FPROT registers are loaded with the contents of the
 * program flash protection bytes in the Flash Configuration Field as indicated in
 * the following table. Program flash protection register Flash Configuration Field
 * offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To
 * change the program flash protection that is loaded during the reset sequence,
 * unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT1 register
 */
/*@{*/
#define FTFE_RD_FPROT1(base)     (FTFE_FPROT1_REG(base))
#define FTFE_WR_FPROT1(base, value) (FTFE_FPROT1_REG(base) = (value))
#define FTFE_RMW_FPROT1(base, mask, value) (FTFE_WR_FPROT1(base, (FTFE_RD_FPROT1(base) & ~(mask)) | (value)))
#define FTFE_SET_FPROT1(base, value) (BME_OR8(&FTFE_FPROT1_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FPROT1(base, value) (BME_AND8(&FTFE_FPROT1_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FPROT1(base, value) (BME_XOR8(&FTFE_FPROT1_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * FTFE_FPROT0 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FPROT0 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any FTFE command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions of equal
 * memory size. Program flash protection register Program flash protection bits
 * FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During
 * the reset sequence, the FPROT registers are loaded with the contents of the
 * program flash protection bytes in the Flash Configuration Field as indicated in
 * the following table. Program flash protection register Flash Configuration Field
 * offset address FPROT0 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To
 * change the program flash protection that is loaded during the reset sequence,
 * unprotect the sector of program flash memory that contains the Flash
 * Configuration Field. Then, reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFE_FPROT0 register
 */
/*@{*/
#define FTFE_RD_FPROT0(base)     (FTFE_FPROT0_REG(base))
#define FTFE_WR_FPROT0(base, value) (FTFE_FPROT0_REG(base) = (value))
#define FTFE_RMW_FPROT0(base, mask, value) (FTFE_WR_FPROT0(base, (FTFE_RD_FPROT0(base) & ~(mask)) | (value)))
#define FTFE_SET_FPROT0(base, value) (BME_OR8(&FTFE_FPROT0_REG(base), (uint8_t)(value)))
#define FTFE_CLR_FPROT0(base, value) (BME_AND8(&FTFE_FPROT0_REG(base), (uint8_t)(~(value))))
#define FTFE_TOG_FPROT0(base, value) (BME_XOR8(&FTFE_FPROT0_REG(base), (uint8_t)(value)))
/*@}*/

