pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * HSADC_CTRL1 - ADC Control Register 1
 ******************************************************************************/

/*!
 * @brief HSADC_CTRL1 - ADC Control Register 1 (RW)
 *
 * Reset value: 0x5005U
 *
 * Bits STOP0, START0, SYNC0 and EOSIE0 in CTRL1 control all types of scans
 * except parallel scans in the B converter when CTRL2[SIMULT]=0. Non-simultaneous
 * parallel scan modes allow independent parallel scanning in the A and B
 * converter. Bits STOP1, START1, SYNC1 and EOSIE1 in CTRL2 are used to control B
 * converter scans in non-simultaneous parallel scan modes.
 */
/*!
 * @name Constants and macros for entire HSADC_CTRL1 register
 */
/*@{*/
#define HSADC_RD_CTRL1(base)     (HSADC_CTRL1_REG(base))
#define HSADC_WR_CTRL1(base, value) (HSADC_CTRL1_REG(base) = (value))
#define HSADC_RMW_CTRL1(base, mask, value) (HSADC_WR_CTRL1(base, (HSADC_RD_CTRL1(base) & ~(mask)) | (value)))
#define HSADC_SET_CTRL1(base, value) (BME_OR16(&HSADC_CTRL1_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CTRL1(base, value) (BME_AND16(&HSADC_CTRL1_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CTRL1(base, value) (BME_XOR16(&HSADC_CTRL1_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CTRL1 bitfields
 */

/*!
 * @name Register HSADC_CTRL1, field SMODE[2:0] (RW)
 *
 * This field controls the ADC module's scan mode. All scan modes use 16 sample
 * slots defined by the CLIST1-4 registers. A scan is the process of stepping
 * through a subset of these sample slots, converting the input indicated by a slot,
 * and storing the result. Unused slots may be disabled using the SDIS register.
 * Input pairs ANA0-1, ANA2-3, ANA4-5, ANA6-7, ANB0-1, ANB2-3, ANB4-5, and
 * ANB6-7 may be configured as differential pairs using the CHNCFG fields. When a slot
 * refers to either member of a differential pair, a differential measurement on
 * that pair is made; otherwise, a single ended measurement is taken on that
 * input. The CTRL*[CHNCFG] fields' descriptions detail differential and single
 * ended measurement. The SMODE field determines whether the slots are used to
 * perform one long sequential scan or two shorter parallel scans, each performed by
 * one of the two converters. SMODE controls how these scans are initiated and
 * terminated. It also controls whether the scans are performed once or repetitively.
 * For details, refer to Sequential Versus Parallel Sampling and Scan Sequencing
 * . Parallel scans may be simultaneous (CTRL2[SIMULT] is 1) or
 * non-simultaneous. Simultaneous parallel scans perform the A and B converter scan in lock step
 * using one set of shared controls. Non-simultaneous parallel scans operate the
 * A and B converters independently, with each converter using its own set of
 * controls. Refer to the CTRL2[SIMULT] bit's description for details. Setting any
 * sequential mode overrides the setting of CTRL2[SIMULT].
 *
 * Values:
 * - 0b000 - Once (single) sequential
 * - 0b001 - Once parallel
 * - 0b010 - Loop sequential
 * - 0b011 - Loop parallel
 * - 0b100 - Triggered sequential
 * - 0b101 - Triggered parallel (default)
 * - 0b11x -
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_SMODE field. */
#define HSADC_RD_CTRL1_SMODE(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_SMODE_MASK) >> HSADC_CTRL1_SMODE_SHIFT)
#define HSADC_BRD_CTRL1_SMODE(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_SMODE_SHIFT, HSADC_CTRL1_SMODE_WIDTH))

/*! @brief Set the SMODE field to a new value. */
#define HSADC_WR_CTRL1_SMODE(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_SMODE_MASK, HSADC_CTRL1_SMODE(value)))
#define HSADC_BWR_CTRL1_SMODE(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_SMODE_SHIFT), HSADC_CTRL1_SMODE_SHIFT, HSADC_CTRL1_SMODE_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field CHNCFG_L[7:4] (RW)
 *
 * The bits configure the analog inputs for either single ended or differential
 * conversions. Differential measurements return the max value ((2**12)-1) when
 * the + input is V REFH and the - input is V REFLO , return 0 when the + input is
 * at V REFLO and the - input is at V REFH , and scale linearly between based on
 * the voltage difference between the two signals. Single ended measurements
 * return the max value when the input is at V REFH , return 0 when the input is at
 * V REFLO , and scale linearly between based on the amount by which the input
 * exceeds V REFLO .
 *
 * Values:
 * - 0bxxx1 - Inputs = ANA0-ANA1
 * - 0bxxx0 - Inputs = ANA0-ANA1
 * - 0bxx1x - Inputs = ANA2-ANA3
 * - 0bxx0x - Inputs = ANA2-ANA3
 * - 0bx1xx - Inputs = ANB0-ANB1
 * - 0bx0xx - Inputs = ANB0-ANB1
 * - 0b1xxx - Inputs = ANB2-ANB3
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_CHNCFG_L field. */
#define HSADC_RD_CTRL1_CHNCFG_L(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_CHNCFG_L_MASK) >> HSADC_CTRL1_CHNCFG_L_SHIFT)
#define HSADC_BRD_CTRL1_CHNCFG_L(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_CHNCFG_L_SHIFT, HSADC_CTRL1_CHNCFG_L_WIDTH))

/*! @brief Set the CHNCFG_L field to a new value. */
#define HSADC_WR_CTRL1_CHNCFG_L(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_CHNCFG_L_MASK, HSADC_CTRL1_CHNCFG_L(value)))
#define HSADC_BWR_CTRL1_CHNCFG_L(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_CHNCFG_L_SHIFT), HSADC_CTRL1_CHNCFG_L_SHIFT, HSADC_CTRL1_CHNCFG_L_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field HLMTIE[8] (RW)
 *
 * This bit enables the High Limit exceeded interrupt if the current result
 * value is greater than the high limit register value. The raw result value is
 * compared to HILIM[HLMT] before the offset register value is subtracted.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_HLMTIE field. */
#define HSADC_RD_CTRL1_HLMTIE(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_HLMTIE_MASK) >> HSADC_CTRL1_HLMTIE_SHIFT)
#define HSADC_BRD_CTRL1_HLMTIE(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_HLMTIE_SHIFT, HSADC_CTRL1_HLMTIE_WIDTH))

