pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the HLMTIE field to a new value. */
#define HSADC_WR_CTRL1_HLMTIE(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_HLMTIE_MASK, HSADC_CTRL1_HLMTIE(value)))
#define HSADC_BWR_CTRL1_HLMTIE(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_HLMTIE_SHIFT), HSADC_CTRL1_HLMTIE_SHIFT, HSADC_CTRL1_HLMTIE_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field LLMTIE[9] (RW)
 *
 * This bit enables the Low Limit exceeded interrupt when the current result
 * value is less than the low limit register value. The raw result value is compared
 * to LOLIM[LLMT] before the offset register value is subtracted.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_LLMTIE field. */
#define HSADC_RD_CTRL1_LLMTIE(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_LLMTIE_MASK) >> HSADC_CTRL1_LLMTIE_SHIFT)
#define HSADC_BRD_CTRL1_LLMTIE(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_LLMTIE_SHIFT, HSADC_CTRL1_LLMTIE_WIDTH))

/*! @brief Set the LLMTIE field to a new value. */
#define HSADC_WR_CTRL1_LLMTIE(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_LLMTIE_MASK, HSADC_CTRL1_LLMTIE(value)))
#define HSADC_BWR_CTRL1_LLMTIE(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_LLMTIE_SHIFT), HSADC_CTRL1_LLMTIE_SHIFT, HSADC_CTRL1_LLMTIE_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field ZCIE[10] (RW)
 *
 * This bit enables the zero crossing interrupt if the current result value has
 * a sign change from the previous result as configured by the ZXCTRL1 and
 * ZXCTRL2 registers.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_ZCIE field. */
#define HSADC_RD_CTRL1_ZCIE(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_ZCIE_MASK) >> HSADC_CTRL1_ZCIE_SHIFT)
#define HSADC_BRD_CTRL1_ZCIE(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_ZCIE_SHIFT, HSADC_CTRL1_ZCIE_WIDTH))

/*! @brief Set the ZCIE field to a new value. */
#define HSADC_WR_CTRL1_ZCIE(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_ZCIE_MASK, HSADC_CTRL1_ZCIE(value)))
#define HSADC_BWR_CTRL1_ZCIE(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_ZCIE_SHIFT), HSADC_CTRL1_ZCIE_SHIFT, HSADC_CTRL1_ZCIE_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field EOSIE0[11] (RW)
 *
 * This bit enables an EOSI0 interrupt to be generated upon completion of the
 * scan. For looping scan modes, the interrupt will trigger after the completion of
 * each iteration of the loop.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_EOSIE0 field. */
#define HSADC_RD_CTRL1_EOSIE0(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_EOSIE0_MASK) >> HSADC_CTRL1_EOSIE0_SHIFT)
#define HSADC_BRD_CTRL1_EOSIE0(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_EOSIE0_SHIFT, HSADC_CTRL1_EOSIE0_WIDTH))

/*! @brief Set the EOSIE0 field to a new value. */
#define HSADC_WR_CTRL1_EOSIE0(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_EOSIE0_MASK, HSADC_CTRL1_EOSIE0(value)))
#define HSADC_BWR_CTRL1_EOSIE0(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_EOSIE0_SHIFT), HSADC_CTRL1_EOSIE0_SHIFT, HSADC_CTRL1_EOSIE0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field SYNC0[12] (RW)
 *
 * A conversion may be initiated by asserting a positive edge on the SYNC0
 * input. Any subsequent SYNC0 input pulses while the scan remains in process are
 * ignored unless the scan is awaiting further SYNC inputs due to the SCTRL[SCn]
 * bits. CTRL1[SYNC0] is cleared in ONCE mode, CTRL1[SMODE=000 or 001], when the
 * first SYNC input is detected. This prevents unintentionally starting a new scan
 * after the first scan has completed. The ADC must be in a stable power mode prior
 * to SYNC0 input assertion. Refer to the functional description of power modes
 * for further details. In "once" scan modes, only a first SYNC0 input pulse is
 * honored. CTRL1[SYNC0] is cleared in this mode when the first SYNC input is
 * detected. This prevents unintentionally starting a new scan after the first scan
 * has completed. The CTRL1[SYNC0] bit can be set again at any time including
 * while the scan remains in process
 *
 * Values:
 * - 0b0 - Scan is initiated by a write to CTRL1[START0] only
 * - 0b1 - Use a SYNC0 input pulse or CTRL1[START0] to initiate a scan
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_SYNC0 field. */
#define HSADC_RD_CTRL1_SYNC0(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_SYNC0_MASK) >> HSADC_CTRL1_SYNC0_SHIFT)
#define HSADC_BRD_CTRL1_SYNC0(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_SYNC0_SHIFT, HSADC_CTRL1_SYNC0_WIDTH))

/*! @brief Set the SYNC0 field to a new value. */
#define HSADC_WR_CTRL1_SYNC0(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_SYNC0_MASK, HSADC_CTRL1_SYNC0(value)))
#define HSADC_BWR_CTRL1_SYNC0(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_SYNC0_SHIFT), HSADC_CTRL1_SYNC0_SHIFT, HSADC_CTRL1_SYNC0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field START0[13] (WORZ)
 *
 * A scan is started by writing 1 to this bit. This is a write only bit. Writing
 * 1 to it again while the scan remains in process, is ignored. The ADC must be
 * in a stable power configuration prior to writing the start bit. Refer to the
 * functional description of power modes for further details.
 *
 * Values:
 * - 0b0 - No action
 * - 0b1 - Start command is issued
 */
/*@{*/
/*! @brief Set the START0 field to a new value. */
#define HSADC_WR_CTRL1_START0(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_START0_MASK, HSADC_CTRL1_START0(value)))
#define HSADC_BWR_CTRL1_START0(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_START0_SHIFT), HSADC_CTRL1_START0_SHIFT, HSADC_CTRL1_START0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field STOP0[14] (RW)
 *
 * When this bit is asserted, the current scan is stopped and no further scans
 * can start. Any further SYNC0 input pulses (see CTRL1[SYNC0] bit) or writes to
 * the CTRL1[START0] bit are ignored until this bit has been cleared. After the
 * ADC is in stop mode, the results registers can be modified by the processor. Any
 * changes to the result registers in stop mode are treated as if the analog
 * core supplied the data. Therefore, limit checking, zero crossing, and associated
 * interrupts can occur when authorized. This is not the same as DSP STOP mode.
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Stop mode
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_STOP0 field. */
#define HSADC_RD_CTRL1_STOP0(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_STOP0_MASK) >> HSADC_CTRL1_STOP0_SHIFT)
#define HSADC_BRD_CTRL1_STOP0(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_STOP0_SHIFT, HSADC_CTRL1_STOP0_WIDTH))

/*! @brief Set the STOP0 field to a new value. */
#define HSADC_WR_CTRL1_STOP0(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_STOP0_MASK, HSADC_CTRL1_STOP0(value)))
#define HSADC_BWR_CTRL1_STOP0(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_STOP0_SHIFT), HSADC_CTRL1_STOP0_SHIFT, HSADC_CTRL1_STOP0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL1, field DMAEN0[15] (RW)
 *
 * When this bit is asserted, the DMA source selected by CTRL3[DMASRC] causes
 * the conversion results to be transferred by the DMA controller.
 *
 * Values:
 * - 0b0 - DMA is not enabled.
 * - 0b1 - DMA is enabled.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL1_DMAEN0 field. */
#define HSADC_RD_CTRL1_DMAEN0(base) ((HSADC_CTRL1_REG(base) & HSADC_CTRL1_DMAEN0_MASK) >> HSADC_CTRL1_DMAEN0_SHIFT)
#define HSADC_BRD_CTRL1_DMAEN0(base) (BME_UBFX16(&HSADC_CTRL1_REG(base), HSADC_CTRL1_DMAEN0_SHIFT, HSADC_CTRL1_DMAEN0_WIDTH))

/*! @brief Set the DMAEN0 field to a new value. */
#define HSADC_WR_CTRL1_DMAEN0(base, value) (HSADC_RMW_CTRL1(base, HSADC_CTRL1_DMAEN0_MASK, HSADC_CTRL1_DMAEN0(value)))
#define HSADC_BWR_CTRL1_DMAEN0(base, value) (BME_BFI16(&HSADC_CTRL1_REG(base), ((uint16_t)(value) << HSADC_CTRL1_DMAEN0_SHIFT), HSADC_CTRL1_DMAEN0_SHIFT, HSADC_CTRL1_DMAEN0_WIDTH))
/*@}*/

