pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * HSADC_CTRL2 - ADC Control Register 2
 ******************************************************************************/

/*!
 * @brief HSADC_CTRL2 - ADC Control Register 2 (RW)
 *
 * Reset value: 0x5044U
 */
/*!
 * @name Constants and macros for entire HSADC_CTRL2 register
 */
/*@{*/
#define HSADC_RD_CTRL2(base)     (HSADC_CTRL2_REG(base))
#define HSADC_WR_CTRL2(base, value) (HSADC_CTRL2_REG(base) = (value))
#define HSADC_RMW_CTRL2(base, mask, value) (HSADC_WR_CTRL2(base, (HSADC_RD_CTRL2(base) & ~(mask)) | (value)))
#define HSADC_SET_CTRL2(base, value) (BME_OR16(&HSADC_CTRL2_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CTRL2(base, value) (BME_AND16(&HSADC_CTRL2_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CTRL2(base, value) (BME_XOR16(&HSADC_CTRL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CTRL2 bitfields
 */

/*!
 * @name Register HSADC_CTRL2, field DIV0[5:0] (RW)
 *
 * The divider circuit generates the ADC clock by dividing the system clock:
 * When DIV0 is 0, the divisor is 2. For all other DIV0 values, the divisor is (DIV0
 * + 1). A DIV0 value must be chosen so the ADC clock does not exceed the
 * maximum frequency (80 MHz). This clock is used by ADCA during all scans and is used
 * by ADCB during sequential scan modes and during parallel simultaneous scan
 * modes. The following table shows the ADC clock frequency based on the value of
 * DIV0 for some frequencies of the clock source. DIV0 Divisor PLL 160 MHz PLL 220
 * MHz 00_0000 2 80.0M - 00_0001 2 80.0M - 00_0010 3 53.33M 73.33M 00_0011 4
 * 40.0M 55.0M 00_0100 5 32.00M 44.0M 00_0101 6 26.67M 36.67M - - - - 11_1111 64 2.5M
 * 3.44M
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_DIV0 field. */
#define HSADC_RD_CTRL2_DIV0(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_DIV0_MASK) >> HSADC_CTRL2_DIV0_SHIFT)
#define HSADC_BRD_CTRL2_DIV0(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_DIV0_SHIFT, HSADC_CTRL2_DIV0_WIDTH))

/*! @brief Set the DIV0 field to a new value. */
#define HSADC_WR_CTRL2_DIV0(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_DIV0_MASK, HSADC_CTRL2_DIV0(value)))
#define HSADC_BWR_CTRL2_DIV0(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_DIV0_SHIFT), HSADC_CTRL2_DIV0_SHIFT, HSADC_CTRL2_DIV0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field SIMULT[6] (RW)
 *
 * This bit only affects parallel scan modes. By default (CTRL2[SIMULT]=1)
 * parallel scans operate in simultaneous mode. The scans in the A and B converter
 * operate simultaneously and always result in pairs of simultaneous conversions in
 * the A and B converter. CTRL1[STOP0, SYNC0, and START0] control bits and the
 * SYNC0 input are used to start and stop scans in both converters simultaneously.
 * A scan ends in both converters when either converter encounters a disabled
 * sample slot. When the parallel scan completes, the STAT[EOSI0] triggers if
 * CTRL1[EOSIE0] is set. The STAT[CIP0] status bit indicates that a parallel scan is in
 * process. When CTRL2[SIMULT]=0, parallel scans in the A and B converters
 * operate independently. The B converter has its own independent set of the above
 * controls (with a 1 suffix) which control its operation and report its status.
 * Each converter's scan continues until its sample list is exhausted (8 samples) or
 * a disabled sample IN ITS LIST is encountered. For looping parallel scan mode,
 * each converter starts its next iteration as soon as the previous iteration in
 * that converter is complete and continues until the CTRL*[STOP*] bit for that
 * converter is asserted.
 *
 * Values:
 * - 0b0 - Parallel scans done independently
 * - 0b1 - Parallel scans done simultaneously (default)
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_SIMULT field. */
#define HSADC_RD_CTRL2_SIMULT(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_SIMULT_MASK) >> HSADC_CTRL2_SIMULT_SHIFT)
#define HSADC_BRD_CTRL2_SIMULT(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_SIMULT_SHIFT, HSADC_CTRL2_SIMULT_WIDTH))

/*! @brief Set the SIMULT field to a new value. */
#define HSADC_WR_CTRL2_SIMULT(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_SIMULT_MASK, HSADC_CTRL2_SIMULT(value)))
#define HSADC_BWR_CTRL2_SIMULT(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_SIMULT_SHIFT), HSADC_CTRL2_SIMULT_SHIFT, HSADC_CTRL2_SIMULT_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field CHNCFG_H[10:7] (RW)
 *
 * The bits configure the analog inputs for either single ended or differential
 * conversions. Differential measurements return the max value ((2**12)-1) when
 * the + input is V REFH and the - input is V REFLO , return 0 when the + input is
 * at V REFLO and the - input is at V REFH , and scale linearly between based on
 * the voltage difference between the two signals. Single ended measurements
 * return the max value when the input is at V REFH , return 0 when the input is at
 * V REFLO , and scale linearly between based on the amount by which the input
 * exceeds V REFLO . Please refer to section Input Multiplex Function for details
 * when using ANA6/7 or ANB6/7.
 *
 * Values:
 * - 0bxxx1 - Inputs = ANA4-ANA5
 * - 0bxxx0 - Inputs = ANA4-ANA5
 * - 0bxx1x - Inputs = ANA6-ANA7
 * - 0bxx0x - Inputs = ANA6-ANA7
 * - 0bx1xx - Inputs = ANB4-ANB5
 * - 0bx0xx - Inputs = ANB4-ANB5
 * - 0b1xxx - Inputs = ANB6-ANB7
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_CHNCFG_H field. */
#define HSADC_RD_CTRL2_CHNCFG_H(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_CHNCFG_H_MASK) >> HSADC_CTRL2_CHNCFG_H_SHIFT)
#define HSADC_BRD_CTRL2_CHNCFG_H(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_CHNCFG_H_SHIFT, HSADC_CTRL2_CHNCFG_H_WIDTH))

/*! @brief Set the CHNCFG_H field to a new value. */
#define HSADC_WR_CTRL2_CHNCFG_H(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_CHNCFG_H_MASK, HSADC_CTRL2_CHNCFG_H(value)))
#define HSADC_BWR_CTRL2_CHNCFG_H(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_CHNCFG_H_SHIFT), HSADC_CTRL2_CHNCFG_H_SHIFT, HSADC_CTRL2_CHNCFG_H_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field EOSIE1[11] (RW)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables interrupt
 * control for a B converter parallel scan. This bit enables an EOSI1 interrupt to be
 * generated upon completion of the scan. For looping scan modes, the interrupt
 * will trigger after the completion of each iteration of the loop.
 *
 * Values:
 * - 0b0 - Interrupt disabled
 * - 0b1 - Interrupt enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_EOSIE1 field. */
#define HSADC_RD_CTRL2_EOSIE1(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_EOSIE1_MASK) >> HSADC_CTRL2_EOSIE1_SHIFT)
#define HSADC_BRD_CTRL2_EOSIE1(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_EOSIE1_SHIFT, HSADC_CTRL2_EOSIE1_WIDTH))

/*! @brief Set the EOSIE1 field to a new value. */
#define HSADC_WR_CTRL2_EOSIE1(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_EOSIE1_MASK, HSADC_CTRL2_EOSIE1(value)))
#define HSADC_BWR_CTRL2_EOSIE1(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_EOSIE1_SHIFT), HSADC_CTRL2_EOSIE1_SHIFT, HSADC_CTRL2_EOSIE1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field SYNC1[12] (RW)
 *
 * During parallel scan modes when CTRL2[SIMULT]=0, setting this bit to 1
 * permits a B converter parallel scan to be initiated by asserting the SYNC1 input for
 * at least one ADC clock cycle. CTRL2[SYNC1] is cleared in ONCE mode,
 * CTRL1[SMODE=000 or 001], when the first SYNC input is detected. This prevents
 * unintentionally starting a new scan after the first scan has completed. The ADC must be
 * in a stable power mode prior to SYNC1 input assertion. Refer to the
 * functional description of power modes for further details. In "once" scan modes, only a
 * first SYNC1 input pulse is honored. CTRL2[SYNC1] is cleared in this mode when
 * the first SYNC1 input is detected. This prevents unintentionally starting a
 * new scan after the first scan has completed. The CTRL2[SYNC1] bit can be set
 * again at any time including while the scan remains in process.
 *
 * Values:
 * - 0b0 - B converter parallel scan is initiated by a write to CTRL2[START1]
 *     bit only
 * - 0b1 - Use a SYNC1 input pulse or CTRL2[START1] bit to initiate a B
 *     converter parallel scan
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_SYNC1 field. */
#define HSADC_RD_CTRL2_SYNC1(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_SYNC1_MASK) >> HSADC_CTRL2_SYNC1_SHIFT)
#define HSADC_BRD_CTRL2_SYNC1(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_SYNC1_SHIFT, HSADC_CTRL2_SYNC1_WIDTH))

/*! @brief Set the SYNC1 field to a new value. */
#define HSADC_WR_CTRL2_SYNC1(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_SYNC1_MASK, HSADC_CTRL2_SYNC1(value)))
#define HSADC_BWR_CTRL2_SYNC1(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_SYNC1_SHIFT), HSADC_CTRL2_SYNC1_SHIFT, HSADC_CTRL2_SYNC1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field START1[13] (WORZ)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables start control of
 * a B converter parallel scan. A scan is started by writing 1 to this bit. This
 * is a write only bit. Writing 1 to it again while the scan remains in process,
 * is ignored. The ADC must be in a stable power configuration prior to writing
 * the start bit. Refer to the functional description of power modes for further
 * details.
 *
 * Values:
 * - 0b0 - No action
 * - 0b1 - Start command is issued
 */
/*@{*/
/*! @brief Set the START1 field to a new value. */
#define HSADC_WR_CTRL2_START1(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_START1_MASK, HSADC_CTRL2_START1(value)))
#define HSADC_BWR_CTRL2_START1(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_START1_SHIFT), HSADC_CTRL2_START1_SHIFT, HSADC_CTRL2_START1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field STOP1[14] (RW)
 *
 * During parallel scan modes when SIMULT = 0, this bit enables stop control of
 * a B converter parallel scan. When this bit is asserted, the current scan is
 * stopped and no further scans can start. Any further SYNC1 input pulses (see
 * CTRL2[SYNC1] bit) or writes to the CTRL2[START1] bit are ignored until this bit
 * has been cleared. After the ADC is in stop mode, the results registers can be
 * modified by the processor. Any changes to the result registers in stop mode are
 * treated as if the analog core supplied the data. Therefore, limit checking,
 * zero crossing, and associated interrupts can occur when authorized. This is not
 * the same as DSP STOP mode.
 *
 * Values:
 * - 0b0 - Normal operation
 * - 0b1 - Stop mode
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_STOP1 field. */
#define HSADC_RD_CTRL2_STOP1(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_STOP1_MASK) >> HSADC_CTRL2_STOP1_SHIFT)
#define HSADC_BRD_CTRL2_STOP1(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_STOP1_SHIFT, HSADC_CTRL2_STOP1_WIDTH))

/*! @brief Set the STOP1 field to a new value. */
#define HSADC_WR_CTRL2_STOP1(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_STOP1_MASK, HSADC_CTRL2_STOP1(value)))
#define HSADC_BWR_CTRL2_STOP1(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_STOP1_SHIFT), HSADC_CTRL2_STOP1_SHIFT, HSADC_CTRL2_STOP1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL2, field DMAEN1[15] (RW)
 *
 * During parallel scan modes when SIMULT=0, this bit enables DMA for converter
 * B. When this bit is asserted, the DMA source selected by CTRL3[DMASRC] causes
 * the conversion results to be transferred by the DMA controller.
 *
 * Values:
 * - 0b0 - DMA is not enabled.
 * - 0b1 - DMA is enabled.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL2_DMAEN1 field. */
#define HSADC_RD_CTRL2_DMAEN1(base) ((HSADC_CTRL2_REG(base) & HSADC_CTRL2_DMAEN1_MASK) >> HSADC_CTRL2_DMAEN1_SHIFT)
#define HSADC_BRD_CTRL2_DMAEN1(base) (BME_UBFX16(&HSADC_CTRL2_REG(base), HSADC_CTRL2_DMAEN1_SHIFT, HSADC_CTRL2_DMAEN1_WIDTH))

