pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the DMAEN1 field to a new value. */
#define HSADC_WR_CTRL2_DMAEN1(base, value) (HSADC_RMW_CTRL2(base, HSADC_CTRL2_DMAEN1_MASK, HSADC_CTRL2_DMAEN1(value)))
#define HSADC_BWR_CTRL2_DMAEN1(base, value) (BME_BFI16(&HSADC_CTRL2_REG(base), ((uint16_t)(value) << HSADC_CTRL2_DMAEN1_SHIFT), HSADC_CTRL2_DMAEN1_SHIFT, HSADC_CTRL2_DMAEN1_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_ZXCTRL1 - ADC Zero Crossing Control 1 Register
 ******************************************************************************/

/*!
 * @brief HSADC_ZXCTRL1 - ADC Zero Crossing Control 1 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire HSADC_ZXCTRL1 register
 */
/*@{*/
#define HSADC_RD_ZXCTRL1(base)   (HSADC_ZXCTRL1_REG(base))
#define HSADC_WR_ZXCTRL1(base, value) (HSADC_ZXCTRL1_REG(base) = (value))
#define HSADC_RMW_ZXCTRL1(base, mask, value) (HSADC_WR_ZXCTRL1(base, (HSADC_RD_ZXCTRL1(base) & ~(mask)) | (value)))
#define HSADC_SET_ZXCTRL1(base, value) (BME_OR16(&HSADC_ZXCTRL1_REG(base), (uint16_t)(value)))
#define HSADC_CLR_ZXCTRL1(base, value) (BME_AND16(&HSADC_ZXCTRL1_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_ZXCTRL1(base, value) (BME_XOR16(&HSADC_ZXCTRL1_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_ZXCTRL1 bitfields
 */

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE0[1:0] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE0 field. */
#define HSADC_RD_ZXCTRL1_ZCE0(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE0_MASK) >> HSADC_ZXCTRL1_ZCE0_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE0(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE0_SHIFT, HSADC_ZXCTRL1_ZCE0_WIDTH))

/*! @brief Set the ZCE0 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE0(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE0_MASK, HSADC_ZXCTRL1_ZCE0(value)))
#define HSADC_BWR_ZXCTRL1_ZCE0(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE0_SHIFT), HSADC_ZXCTRL1_ZCE0_SHIFT, HSADC_ZXCTRL1_ZCE0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE1[3:2] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE1 field. */
#define HSADC_RD_ZXCTRL1_ZCE1(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE1_MASK) >> HSADC_ZXCTRL1_ZCE1_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE1(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE1_SHIFT, HSADC_ZXCTRL1_ZCE1_WIDTH))

/*! @brief Set the ZCE1 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE1(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE1_MASK, HSADC_ZXCTRL1_ZCE1(value)))
#define HSADC_BWR_ZXCTRL1_ZCE1(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE1_SHIFT), HSADC_ZXCTRL1_ZCE1_SHIFT, HSADC_ZXCTRL1_ZCE1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE2[5:4] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE2 field. */
#define HSADC_RD_ZXCTRL1_ZCE2(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE2_MASK) >> HSADC_ZXCTRL1_ZCE2_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE2(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE2_SHIFT, HSADC_ZXCTRL1_ZCE2_WIDTH))

/*! @brief Set the ZCE2 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE2(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE2_MASK, HSADC_ZXCTRL1_ZCE2(value)))
#define HSADC_BWR_ZXCTRL1_ZCE2(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE2_SHIFT), HSADC_ZXCTRL1_ZCE2_SHIFT, HSADC_ZXCTRL1_ZCE2_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE3[7:6] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE3 field. */
#define HSADC_RD_ZXCTRL1_ZCE3(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE3_MASK) >> HSADC_ZXCTRL1_ZCE3_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE3(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE3_SHIFT, HSADC_ZXCTRL1_ZCE3_WIDTH))

/*! @brief Set the ZCE3 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE3(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE3_MASK, HSADC_ZXCTRL1_ZCE3(value)))
#define HSADC_BWR_ZXCTRL1_ZCE3(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE3_SHIFT), HSADC_ZXCTRL1_ZCE3_SHIFT, HSADC_ZXCTRL1_ZCE3_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE4[9:8] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE4 field. */
#define HSADC_RD_ZXCTRL1_ZCE4(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE4_MASK) >> HSADC_ZXCTRL1_ZCE4_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE4(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE4_SHIFT, HSADC_ZXCTRL1_ZCE4_WIDTH))

/*! @brief Set the ZCE4 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE4(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE4_MASK, HSADC_ZXCTRL1_ZCE4(value)))
#define HSADC_BWR_ZXCTRL1_ZCE4(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE4_SHIFT), HSADC_ZXCTRL1_ZCE4_SHIFT, HSADC_ZXCTRL1_ZCE4_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE5[11:10] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE5 field. */
#define HSADC_RD_ZXCTRL1_ZCE5(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE5_MASK) >> HSADC_ZXCTRL1_ZCE5_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE5(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE5_SHIFT, HSADC_ZXCTRL1_ZCE5_WIDTH))

