pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the ZCE5 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE5(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE5_MASK, HSADC_ZXCTRL1_ZCE5(value)))
#define HSADC_BWR_ZXCTRL1_ZCE5(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE5_SHIFT), HSADC_ZXCTRL1_ZCE5_SHIFT, HSADC_ZXCTRL1_ZCE5_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE6[13:12] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE6 field. */
#define HSADC_RD_ZXCTRL1_ZCE6(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE6_MASK) >> HSADC_ZXCTRL1_ZCE6_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE6(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE6_SHIFT, HSADC_ZXCTRL1_ZCE6_WIDTH))

/*! @brief Set the ZCE6 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE6(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE6_MASK, HSADC_ZXCTRL1_ZCE6(value)))
#define HSADC_BWR_ZXCTRL1_ZCE6(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE6_SHIFT), HSADC_ZXCTRL1_ZCE6_SHIFT, HSADC_ZXCTRL1_ZCE6_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL1, field ZCE7[15:14] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL1_ZCE7 field. */
#define HSADC_RD_ZXCTRL1_ZCE7(base) ((HSADC_ZXCTRL1_REG(base) & HSADC_ZXCTRL1_ZCE7_MASK) >> HSADC_ZXCTRL1_ZCE7_SHIFT)
#define HSADC_BRD_ZXCTRL1_ZCE7(base) (BME_UBFX16(&HSADC_ZXCTRL1_REG(base), HSADC_ZXCTRL1_ZCE7_SHIFT, HSADC_ZXCTRL1_ZCE7_WIDTH))

/*! @brief Set the ZCE7 field to a new value. */
#define HSADC_WR_ZXCTRL1_ZCE7(base, value) (HSADC_RMW_ZXCTRL1(base, HSADC_ZXCTRL1_ZCE7_MASK, HSADC_ZXCTRL1_ZCE7(value)))
#define HSADC_BWR_ZXCTRL1_ZCE7(base, value) (BME_BFI16(&HSADC_ZXCTRL1_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL1_ZCE7_SHIFT), HSADC_ZXCTRL1_ZCE7_SHIFT, HSADC_ZXCTRL1_ZCE7_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_ZXCTRL2 - ADC Zero Crossing Control 2 Register
 ******************************************************************************/

/*!
 * @brief HSADC_ZXCTRL2 - ADC Zero Crossing Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire HSADC_ZXCTRL2 register
 */
/*@{*/
#define HSADC_RD_ZXCTRL2(base)   (HSADC_ZXCTRL2_REG(base))
#define HSADC_WR_ZXCTRL2(base, value) (HSADC_ZXCTRL2_REG(base) = (value))
#define HSADC_RMW_ZXCTRL2(base, mask, value) (HSADC_WR_ZXCTRL2(base, (HSADC_RD_ZXCTRL2(base) & ~(mask)) | (value)))
#define HSADC_SET_ZXCTRL2(base, value) (BME_OR16(&HSADC_ZXCTRL2_REG(base), (uint16_t)(value)))
#define HSADC_CLR_ZXCTRL2(base, value) (BME_AND16(&HSADC_ZXCTRL2_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_ZXCTRL2(base, value) (BME_XOR16(&HSADC_ZXCTRL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_ZXCTRL2 bitfields
 */

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE8[1:0] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE8 field. */
#define HSADC_RD_ZXCTRL2_ZCE8(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE8_MASK) >> HSADC_ZXCTRL2_ZCE8_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE8(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE8_SHIFT, HSADC_ZXCTRL2_ZCE8_WIDTH))

/*! @brief Set the ZCE8 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE8(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE8_MASK, HSADC_ZXCTRL2_ZCE8(value)))
#define HSADC_BWR_ZXCTRL2_ZCE8(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE8_SHIFT), HSADC_ZXCTRL2_ZCE8_SHIFT, HSADC_ZXCTRL2_ZCE8_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE9[3:2] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE9 field. */
#define HSADC_RD_ZXCTRL2_ZCE9(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE9_MASK) >> HSADC_ZXCTRL2_ZCE9_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE9(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE9_SHIFT, HSADC_ZXCTRL2_ZCE9_WIDTH))

/*! @brief Set the ZCE9 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE9(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE9_MASK, HSADC_ZXCTRL2_ZCE9(value)))
#define HSADC_BWR_ZXCTRL2_ZCE9(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE9_SHIFT), HSADC_ZXCTRL2_ZCE9_SHIFT, HSADC_ZXCTRL2_ZCE9_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE10[5:4] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE10 field. */
#define HSADC_RD_ZXCTRL2_ZCE10(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE10_MASK) >> HSADC_ZXCTRL2_ZCE10_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE10(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE10_SHIFT, HSADC_ZXCTRL2_ZCE10_WIDTH))

/*! @brief Set the ZCE10 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE10(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE10_MASK, HSADC_ZXCTRL2_ZCE10(value)))
#define HSADC_BWR_ZXCTRL2_ZCE10(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE10_SHIFT), HSADC_ZXCTRL2_ZCE10_SHIFT, HSADC_ZXCTRL2_ZCE10_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE11[7:6] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE11 field. */
#define HSADC_RD_ZXCTRL2_ZCE11(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE11_MASK) >> HSADC_ZXCTRL2_ZCE11_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE11(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE11_SHIFT, HSADC_ZXCTRL2_ZCE11_WIDTH))

/*! @brief Set the ZCE11 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE11(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE11_MASK, HSADC_ZXCTRL2_ZCE11(value)))
#define HSADC_BWR_ZXCTRL2_ZCE11(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE11_SHIFT), HSADC_ZXCTRL2_ZCE11_SHIFT, HSADC_ZXCTRL2_ZCE11_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE12[9:8] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE12 field. */
#define HSADC_RD_ZXCTRL2_ZCE12(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE12_MASK) >> HSADC_ZXCTRL2_ZCE12_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE12(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE12_SHIFT, HSADC_ZXCTRL2_ZCE12_WIDTH))

/*! @brief Set the ZCE12 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE12(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE12_MASK, HSADC_ZXCTRL2_ZCE12(value)))
#define HSADC_BWR_ZXCTRL2_ZCE12(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE12_SHIFT), HSADC_ZXCTRL2_ZCE12_SHIFT, HSADC_ZXCTRL2_ZCE12_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE13[11:10] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE13 field. */
#define HSADC_RD_ZXCTRL2_ZCE13(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE13_MASK) >> HSADC_ZXCTRL2_ZCE13_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE13(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE13_SHIFT, HSADC_ZXCTRL2_ZCE13_WIDTH))

