pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the ZCE13 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE13(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE13_MASK, HSADC_ZXCTRL2_ZCE13(value)))
#define HSADC_BWR_ZXCTRL2_ZCE13(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE13_SHIFT), HSADC_ZXCTRL2_ZCE13_SHIFT, HSADC_ZXCTRL2_ZCE13_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE14[13:12] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE14 field. */
#define HSADC_RD_ZXCTRL2_ZCE14(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE14_MASK) >> HSADC_ZXCTRL2_ZCE14_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE14(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE14_SHIFT, HSADC_ZXCTRL2_ZCE14_WIDTH))

/*! @brief Set the ZCE14 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE14(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE14_MASK, HSADC_ZXCTRL2_ZCE14(value)))
#define HSADC_BWR_ZXCTRL2_ZCE14(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE14_SHIFT), HSADC_ZXCTRL2_ZCE14_SHIFT, HSADC_ZXCTRL2_ZCE14_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_ZXCTRL2, field ZCE15[15:14] (RW)
 *
 * Values:
 * - 0b00 - Zero Crossing disabled
 * - 0b01 - Zero Crossing enabled for positive to negative sign change
 * - 0b10 - Zero Crossing enabled for negative to positive sign change
 * - 0b11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the HSADC_ZXCTRL2_ZCE15 field. */
#define HSADC_RD_ZXCTRL2_ZCE15(base) ((HSADC_ZXCTRL2_REG(base) & HSADC_ZXCTRL2_ZCE15_MASK) >> HSADC_ZXCTRL2_ZCE15_SHIFT)
#define HSADC_BRD_ZXCTRL2_ZCE15(base) (BME_UBFX16(&HSADC_ZXCTRL2_REG(base), HSADC_ZXCTRL2_ZCE15_SHIFT, HSADC_ZXCTRL2_ZCE15_WIDTH))

/*! @brief Set the ZCE15 field to a new value. */
#define HSADC_WR_ZXCTRL2_ZCE15(base, value) (HSADC_RMW_ZXCTRL2(base, HSADC_ZXCTRL2_ZCE15_MASK, HSADC_ZXCTRL2_ZCE15(value)))
#define HSADC_BWR_ZXCTRL2_ZCE15(base, value) (BME_BFI16(&HSADC_ZXCTRL2_REG(base), ((uint16_t)(value) << HSADC_ZXCTRL2_ZCE15_SHIFT), HSADC_ZXCTRL2_ZCE15_SHIFT, HSADC_ZXCTRL2_ZCE15_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_CLIST1 - ADC Channel List Register 1
 ******************************************************************************/

/*!
 * @brief HSADC_CLIST1 - ADC Channel List Register 1 (RW)
 *
 * Reset value: 0x3210U
 *
 * This register configures the analog inputs to be sampled. For ANx6 and ANx7
 * please see also Input Multiplex Function for more details.
 */
/*!
 * @name Constants and macros for entire HSADC_CLIST1 register
 */
/*@{*/
#define HSADC_RD_CLIST1(base)    (HSADC_CLIST1_REG(base))
#define HSADC_WR_CLIST1(base, value) (HSADC_CLIST1_REG(base) = (value))
#define HSADC_RMW_CLIST1(base, mask, value) (HSADC_WR_CLIST1(base, (HSADC_RD_CLIST1(base) & ~(mask)) | (value)))
#define HSADC_SET_CLIST1(base, value) (BME_OR16(&HSADC_CLIST1_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CLIST1(base, value) (BME_AND16(&HSADC_CLIST1_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CLIST1(base, value) (BME_XOR16(&HSADC_CLIST1_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CLIST1 bitfields
 */

/*!
 * @name Register HSADC_CLIST1, field SAMPLE0[3:0] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[0].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST1_SAMPLE0 field. */
#define HSADC_RD_CLIST1_SAMPLE0(base) ((HSADC_CLIST1_REG(base) & HSADC_CLIST1_SAMPLE0_MASK) >> HSADC_CLIST1_SAMPLE0_SHIFT)
#define HSADC_BRD_CLIST1_SAMPLE0(base) (BME_UBFX16(&HSADC_CLIST1_REG(base), HSADC_CLIST1_SAMPLE0_SHIFT, HSADC_CLIST1_SAMPLE0_WIDTH))

/*! @brief Set the SAMPLE0 field to a new value. */
#define HSADC_WR_CLIST1_SAMPLE0(base, value) (HSADC_RMW_CLIST1(base, HSADC_CLIST1_SAMPLE0_MASK, HSADC_CLIST1_SAMPLE0(value)))
#define HSADC_BWR_CLIST1_SAMPLE0(base, value) (BME_BFI16(&HSADC_CLIST1_REG(base), ((uint16_t)(value) << HSADC_CLIST1_SAMPLE0_SHIFT), HSADC_CLIST1_SAMPLE0_SHIFT, HSADC_CLIST1_SAMPLE0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST1, field SAMPLE1[7:4] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[1].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST1_SAMPLE1 field. */
#define HSADC_RD_CLIST1_SAMPLE1(base) ((HSADC_CLIST1_REG(base) & HSADC_CLIST1_SAMPLE1_MASK) >> HSADC_CLIST1_SAMPLE1_SHIFT)
#define HSADC_BRD_CLIST1_SAMPLE1(base) (BME_UBFX16(&HSADC_CLIST1_REG(base), HSADC_CLIST1_SAMPLE1_SHIFT, HSADC_CLIST1_SAMPLE1_WIDTH))

