pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the SAMPLE1 field to a new value. */
#define HSADC_WR_CLIST1_SAMPLE1(base, value) (HSADC_RMW_CLIST1(base, HSADC_CLIST1_SAMPLE1_MASK, HSADC_CLIST1_SAMPLE1(value)))
#define HSADC_BWR_CLIST1_SAMPLE1(base, value) (BME_BFI16(&HSADC_CLIST1_REG(base), ((uint16_t)(value) << HSADC_CLIST1_SAMPLE1_SHIFT), HSADC_CLIST1_SAMPLE1_SHIFT, HSADC_CLIST1_SAMPLE1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST1, field SAMPLE2[11:8] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[2].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST1_SAMPLE2 field. */
#define HSADC_RD_CLIST1_SAMPLE2(base) ((HSADC_CLIST1_REG(base) & HSADC_CLIST1_SAMPLE2_MASK) >> HSADC_CLIST1_SAMPLE2_SHIFT)
#define HSADC_BRD_CLIST1_SAMPLE2(base) (BME_UBFX16(&HSADC_CLIST1_REG(base), HSADC_CLIST1_SAMPLE2_SHIFT, HSADC_CLIST1_SAMPLE2_WIDTH))

/*! @brief Set the SAMPLE2 field to a new value. */
#define HSADC_WR_CLIST1_SAMPLE2(base, value) (HSADC_RMW_CLIST1(base, HSADC_CLIST1_SAMPLE2_MASK, HSADC_CLIST1_SAMPLE2(value)))
#define HSADC_BWR_CLIST1_SAMPLE2(base, value) (BME_BFI16(&HSADC_CLIST1_REG(base), ((uint16_t)(value) << HSADC_CLIST1_SAMPLE2_SHIFT), HSADC_CLIST1_SAMPLE2_SHIFT, HSADC_CLIST1_SAMPLE2_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST1, field SAMPLE3[15:12] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[3].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST1_SAMPLE3 field. */
#define HSADC_RD_CLIST1_SAMPLE3(base) ((HSADC_CLIST1_REG(base) & HSADC_CLIST1_SAMPLE3_MASK) >> HSADC_CLIST1_SAMPLE3_SHIFT)
#define HSADC_BRD_CLIST1_SAMPLE3(base) (BME_UBFX16(&HSADC_CLIST1_REG(base), HSADC_CLIST1_SAMPLE3_SHIFT, HSADC_CLIST1_SAMPLE3_WIDTH))

/*! @brief Set the SAMPLE3 field to a new value. */
#define HSADC_WR_CLIST1_SAMPLE3(base, value) (HSADC_RMW_CLIST1(base, HSADC_CLIST1_SAMPLE3_MASK, HSADC_CLIST1_SAMPLE3(value)))
#define HSADC_BWR_CLIST1_SAMPLE3(base, value) (BME_BFI16(&HSADC_CLIST1_REG(base), ((uint16_t)(value) << HSADC_CLIST1_SAMPLE3_SHIFT), HSADC_CLIST1_SAMPLE3_SHIFT, HSADC_CLIST1_SAMPLE3_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_CLIST2 - ADC Channel List Register 2
 ******************************************************************************/

/*!
 * @brief HSADC_CLIST2 - ADC Channel List Register 2 (RW)
 *
 * Reset value: 0x7654U
 *
 * This register configures the analog inputs to be sampled. For ANx6 and ANx7
 * please see also Input Multiplex Function for more details.
 */
/*!
 * @name Constants and macros for entire HSADC_CLIST2 register
 */
/*@{*/
#define HSADC_RD_CLIST2(base)    (HSADC_CLIST2_REG(base))
#define HSADC_WR_CLIST2(base, value) (HSADC_CLIST2_REG(base) = (value))
#define HSADC_RMW_CLIST2(base, mask, value) (HSADC_WR_CLIST2(base, (HSADC_RD_CLIST2(base) & ~(mask)) | (value)))
#define HSADC_SET_CLIST2(base, value) (BME_OR16(&HSADC_CLIST2_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CLIST2(base, value) (BME_AND16(&HSADC_CLIST2_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CLIST2(base, value) (BME_XOR16(&HSADC_CLIST2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CLIST2 bitfields
 */

/*!
 * @name Register HSADC_CLIST2, field SAMPLE4[3:0] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[4].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST2_SAMPLE4 field. */
#define HSADC_RD_CLIST2_SAMPLE4(base) ((HSADC_CLIST2_REG(base) & HSADC_CLIST2_SAMPLE4_MASK) >> HSADC_CLIST2_SAMPLE4_SHIFT)
#define HSADC_BRD_CLIST2_SAMPLE4(base) (BME_UBFX16(&HSADC_CLIST2_REG(base), HSADC_CLIST2_SAMPLE4_SHIFT, HSADC_CLIST2_SAMPLE4_WIDTH))

/*! @brief Set the SAMPLE4 field to a new value. */
#define HSADC_WR_CLIST2_SAMPLE4(base, value) (HSADC_RMW_CLIST2(base, HSADC_CLIST2_SAMPLE4_MASK, HSADC_CLIST2_SAMPLE4(value)))
#define HSADC_BWR_CLIST2_SAMPLE4(base, value) (BME_BFI16(&HSADC_CLIST2_REG(base), ((uint16_t)(value) << HSADC_CLIST2_SAMPLE4_SHIFT), HSADC_CLIST2_SAMPLE4_SHIFT, HSADC_CLIST2_SAMPLE4_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST2, field SAMPLE5[7:4] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[5].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST2_SAMPLE5 field. */
#define HSADC_RD_CLIST2_SAMPLE5(base) ((HSADC_CLIST2_REG(base) & HSADC_CLIST2_SAMPLE5_MASK) >> HSADC_CLIST2_SAMPLE5_SHIFT)
#define HSADC_BRD_CLIST2_SAMPLE5(base) (BME_UBFX16(&HSADC_CLIST2_REG(base), HSADC_CLIST2_SAMPLE5_SHIFT, HSADC_CLIST2_SAMPLE5_WIDTH))

/*! @brief Set the SAMPLE5 field to a new value. */
#define HSADC_WR_CLIST2_SAMPLE5(base, value) (HSADC_RMW_CLIST2(base, HSADC_CLIST2_SAMPLE5_MASK, HSADC_CLIST2_SAMPLE5(value)))
#define HSADC_BWR_CLIST2_SAMPLE5(base, value) (BME_BFI16(&HSADC_CLIST2_REG(base), ((uint16_t)(value) << HSADC_CLIST2_SAMPLE5_SHIFT), HSADC_CLIST2_SAMPLE5_SHIFT, HSADC_CLIST2_SAMPLE5_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST2, field SAMPLE6[11:8] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[6].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST2_SAMPLE6 field. */
#define HSADC_RD_CLIST2_SAMPLE6(base) ((HSADC_CLIST2_REG(base) & HSADC_CLIST2_SAMPLE6_MASK) >> HSADC_CLIST2_SAMPLE6_SHIFT)
#define HSADC_BRD_CLIST2_SAMPLE6(base) (BME_UBFX16(&HSADC_CLIST2_REG(base), HSADC_CLIST2_SAMPLE6_SHIFT, HSADC_CLIST2_SAMPLE6_WIDTH))

/*! @brief Set the SAMPLE6 field to a new value. */
#define HSADC_WR_CLIST2_SAMPLE6(base, value) (HSADC_RMW_CLIST2(base, HSADC_CLIST2_SAMPLE6_MASK, HSADC_CLIST2_SAMPLE6(value)))
#define HSADC_BWR_CLIST2_SAMPLE6(base, value) (BME_BFI16(&HSADC_CLIST2_REG(base), ((uint16_t)(value) << HSADC_CLIST2_SAMPLE6_SHIFT), HSADC_CLIST2_SAMPLE6_SHIFT, HSADC_CLIST2_SAMPLE6_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST2, field SAMPLE7[15:12] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[7].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST2_SAMPLE7 field. */
#define HSADC_RD_CLIST2_SAMPLE7(base) ((HSADC_CLIST2_REG(base) & HSADC_CLIST2_SAMPLE7_MASK) >> HSADC_CLIST2_SAMPLE7_SHIFT)
#define HSADC_BRD_CLIST2_SAMPLE7(base) (BME_UBFX16(&HSADC_CLIST2_REG(base), HSADC_CLIST2_SAMPLE7_SHIFT, HSADC_CLIST2_SAMPLE7_WIDTH))

/*! @brief Set the SAMPLE7 field to a new value. */
#define HSADC_WR_CLIST2_SAMPLE7(base, value) (HSADC_RMW_CLIST2(base, HSADC_CLIST2_SAMPLE7_MASK, HSADC_CLIST2_SAMPLE7(value)))
#define HSADC_BWR_CLIST2_SAMPLE7(base, value) (BME_BFI16(&HSADC_CLIST2_REG(base), ((uint16_t)(value) << HSADC_CLIST2_SAMPLE7_SHIFT), HSADC_CLIST2_SAMPLE7_SHIFT, HSADC_CLIST2_SAMPLE7_WIDTH))
/*@}*/

