pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * HSADC_CLIST3 - ADC Channel List Register 3
 ******************************************************************************/

/*!
 * @brief HSADC_CLIST3 - ADC Channel List Register 3 (RW)
 *
 * Reset value: 0xBA98U
 *
 * This register configures the analog inputs to be sampled. For ANx6 and ANx7
 * please see also Input Multiplex Function for more details.
 */
/*!
 * @name Constants and macros for entire HSADC_CLIST3 register
 */
/*@{*/
#define HSADC_RD_CLIST3(base)    (HSADC_CLIST3_REG(base))
#define HSADC_WR_CLIST3(base, value) (HSADC_CLIST3_REG(base) = (value))
#define HSADC_RMW_CLIST3(base, mask, value) (HSADC_WR_CLIST3(base, (HSADC_RD_CLIST3(base) & ~(mask)) | (value)))
#define HSADC_SET_CLIST3(base, value) (BME_OR16(&HSADC_CLIST3_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CLIST3(base, value) (BME_AND16(&HSADC_CLIST3_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CLIST3(base, value) (BME_XOR16(&HSADC_CLIST3_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CLIST3 bitfields
 */

/*!
 * @name Register HSADC_CLIST3, field SAMPLE8[3:0] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[8].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST3_SAMPLE8 field. */
#define HSADC_RD_CLIST3_SAMPLE8(base) ((HSADC_CLIST3_REG(base) & HSADC_CLIST3_SAMPLE8_MASK) >> HSADC_CLIST3_SAMPLE8_SHIFT)
#define HSADC_BRD_CLIST3_SAMPLE8(base) (BME_UBFX16(&HSADC_CLIST3_REG(base), HSADC_CLIST3_SAMPLE8_SHIFT, HSADC_CLIST3_SAMPLE8_WIDTH))

/*! @brief Set the SAMPLE8 field to a new value. */
#define HSADC_WR_CLIST3_SAMPLE8(base, value) (HSADC_RMW_CLIST3(base, HSADC_CLIST3_SAMPLE8_MASK, HSADC_CLIST3_SAMPLE8(value)))
#define HSADC_BWR_CLIST3_SAMPLE8(base, value) (BME_BFI16(&HSADC_CLIST3_REG(base), ((uint16_t)(value) << HSADC_CLIST3_SAMPLE8_SHIFT), HSADC_CLIST3_SAMPLE8_SHIFT, HSADC_CLIST3_SAMPLE8_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST3, field SAMPLE9[7:4] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting ADC_SDIS[9].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST3_SAMPLE9 field. */
#define HSADC_RD_CLIST3_SAMPLE9(base) ((HSADC_CLIST3_REG(base) & HSADC_CLIST3_SAMPLE9_MASK) >> HSADC_CLIST3_SAMPLE9_SHIFT)
#define HSADC_BRD_CLIST3_SAMPLE9(base) (BME_UBFX16(&HSADC_CLIST3_REG(base), HSADC_CLIST3_SAMPLE9_SHIFT, HSADC_CLIST3_SAMPLE9_WIDTH))

/*! @brief Set the SAMPLE9 field to a new value. */
#define HSADC_WR_CLIST3_SAMPLE9(base, value) (HSADC_RMW_CLIST3(base, HSADC_CLIST3_SAMPLE9_MASK, HSADC_CLIST3_SAMPLE9(value)))
#define HSADC_BWR_CLIST3_SAMPLE9(base, value) (BME_BFI16(&HSADC_CLIST3_REG(base), ((uint16_t)(value) << HSADC_CLIST3_SAMPLE9_SHIFT), HSADC_CLIST3_SAMPLE9_SHIFT, HSADC_CLIST3_SAMPLE9_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST3, field SAMPLE10[11:8] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting
 * ADC_SDIS[10].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST3_SAMPLE10 field. */
#define HSADC_RD_CLIST3_SAMPLE10(base) ((HSADC_CLIST3_REG(base) & HSADC_CLIST3_SAMPLE10_MASK) >> HSADC_CLIST3_SAMPLE10_SHIFT)
#define HSADC_BRD_CLIST3_SAMPLE10(base) (BME_UBFX16(&HSADC_CLIST3_REG(base), HSADC_CLIST3_SAMPLE10_SHIFT, HSADC_CLIST3_SAMPLE10_WIDTH))

