pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the SAMPLE10 field to a new value. */
#define HSADC_WR_CLIST3_SAMPLE10(base, value) (HSADC_RMW_CLIST3(base, HSADC_CLIST3_SAMPLE10_MASK, HSADC_CLIST3_SAMPLE10(value)))
#define HSADC_BWR_CLIST3_SAMPLE10(base, value) (BME_BFI16(&HSADC_CLIST3_REG(base), ((uint16_t)(value) << HSADC_CLIST3_SAMPLE10_SHIFT), HSADC_CLIST3_SAMPLE10_SHIFT, HSADC_CLIST3_SAMPLE10_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST3, field SAMPLE11[15:12] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting
 * ADC_SDIS[11].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST3_SAMPLE11 field. */
#define HSADC_RD_CLIST3_SAMPLE11(base) ((HSADC_CLIST3_REG(base) & HSADC_CLIST3_SAMPLE11_MASK) >> HSADC_CLIST3_SAMPLE11_SHIFT)
#define HSADC_BRD_CLIST3_SAMPLE11(base) (BME_UBFX16(&HSADC_CLIST3_REG(base), HSADC_CLIST3_SAMPLE11_SHIFT, HSADC_CLIST3_SAMPLE11_WIDTH))

/*! @brief Set the SAMPLE11 field to a new value. */
#define HSADC_WR_CLIST3_SAMPLE11(base, value) (HSADC_RMW_CLIST3(base, HSADC_CLIST3_SAMPLE11_MASK, HSADC_CLIST3_SAMPLE11(value)))
#define HSADC_BWR_CLIST3_SAMPLE11(base, value) (BME_BFI16(&HSADC_CLIST3_REG(base), ((uint16_t)(value) << HSADC_CLIST3_SAMPLE11_SHIFT), HSADC_CLIST3_SAMPLE11_SHIFT, HSADC_CLIST3_SAMPLE11_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_CLIST4 - ADC Channel List Register 4
 ******************************************************************************/

/*!
 * @brief HSADC_CLIST4 - ADC Channel List Register 4 (RW)
 *
 * Reset value: 0xFEDCU
 *
 * This register configures the analog inputs to be sampled. For ANx6 and ANx7
 * please see also Input Multiplex Function for more details.
 */
/*!
 * @name Constants and macros for entire HSADC_CLIST4 register
 */
/*@{*/
#define HSADC_RD_CLIST4(base)    (HSADC_CLIST4_REG(base))
#define HSADC_WR_CLIST4(base, value) (HSADC_CLIST4_REG(base) = (value))
#define HSADC_RMW_CLIST4(base, mask, value) (HSADC_WR_CLIST4(base, (HSADC_RD_CLIST4(base) & ~(mask)) | (value)))
#define HSADC_SET_CLIST4(base, value) (BME_OR16(&HSADC_CLIST4_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CLIST4(base, value) (BME_AND16(&HSADC_CLIST4_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CLIST4(base, value) (BME_XOR16(&HSADC_CLIST4_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CLIST4 bitfields
 */

/*!
 * @name Register HSADC_CLIST4, field SAMPLE12[3:0] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting
 * ADC_SDIS[12].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST4_SAMPLE12 field. */
#define HSADC_RD_CLIST4_SAMPLE12(base) ((HSADC_CLIST4_REG(base) & HSADC_CLIST4_SAMPLE12_MASK) >> HSADC_CLIST4_SAMPLE12_SHIFT)
#define HSADC_BRD_CLIST4_SAMPLE12(base) (BME_UBFX16(&HSADC_CLIST4_REG(base), HSADC_CLIST4_SAMPLE12_SHIFT, HSADC_CLIST4_SAMPLE12_WIDTH))

/*! @brief Set the SAMPLE12 field to a new value. */
#define HSADC_WR_CLIST4_SAMPLE12(base, value) (HSADC_RMW_CLIST4(base, HSADC_CLIST4_SAMPLE12_MASK, HSADC_CLIST4_SAMPLE12(value)))
#define HSADC_BWR_CLIST4_SAMPLE12(base, value) (BME_BFI16(&HSADC_CLIST4_REG(base), ((uint16_t)(value) << HSADC_CLIST4_SAMPLE12_SHIFT), HSADC_CLIST4_SAMPLE12_SHIFT, HSADC_CLIST4_SAMPLE12_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST4, field SAMPLE13[7:4] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting
 * ADC_SDIS[13].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST4_SAMPLE13 field. */
#define HSADC_RD_CLIST4_SAMPLE13(base) ((HSADC_CLIST4_REG(base) & HSADC_CLIST4_SAMPLE13_MASK) >> HSADC_CLIST4_SAMPLE13_SHIFT)
#define HSADC_BRD_CLIST4_SAMPLE13(base) (BME_UBFX16(&HSADC_CLIST4_REG(base), HSADC_CLIST4_SAMPLE13_SHIFT, HSADC_CLIST4_SAMPLE13_WIDTH))

