pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the SAMPLE13 field to a new value. */
#define HSADC_WR_CLIST4_SAMPLE13(base, value) (HSADC_RMW_CLIST4(base, HSADC_CLIST4_SAMPLE13_MASK, HSADC_CLIST4_SAMPLE13(value)))
#define HSADC_BWR_CLIST4_SAMPLE13(base, value) (BME_BFI16(&HSADC_CLIST4_REG(base), ((uint16_t)(value) << HSADC_CLIST4_SAMPLE13_SHIFT), HSADC_CLIST4_SAMPLE13_SHIFT, HSADC_CLIST4_SAMPLE13_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST4, field SAMPLE14[11:8] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting
 * ADC_SDIS[14].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST4_SAMPLE14 field. */
#define HSADC_RD_CLIST4_SAMPLE14(base) ((HSADC_CLIST4_REG(base) & HSADC_CLIST4_SAMPLE14_MASK) >> HSADC_CLIST4_SAMPLE14_SHIFT)
#define HSADC_BRD_CLIST4_SAMPLE14(base) (BME_UBFX16(&HSADC_CLIST4_REG(base), HSADC_CLIST4_SAMPLE14_SHIFT, HSADC_CLIST4_SAMPLE14_WIDTH))

/*! @brief Set the SAMPLE14 field to a new value. */
#define HSADC_WR_CLIST4_SAMPLE14(base, value) (HSADC_RMW_CLIST4(base, HSADC_CLIST4_SAMPLE14_MASK, HSADC_CLIST4_SAMPLE14(value)))
#define HSADC_BWR_CLIST4_SAMPLE14(base, value) (BME_BFI16(&HSADC_CLIST4_REG(base), ((uint16_t)(value) << HSADC_CLIST4_SAMPLE14_SHIFT), HSADC_CLIST4_SAMPLE14_SHIFT, HSADC_CLIST4_SAMPLE14_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CLIST4, field SAMPLE15[15:12] (RW)
 *
 * This sample and all subsequent samples can be disabled by setting
 * ADC_SDIS[15].
 *
 * Values:
 * - 0b0000 - Single Ended: ANA0, Differential: ANA0+, ANA1-
 * - 0b0001 - Single Ended: ANA1, Differential: ANA0+, ANA1-
 * - 0b0010 - Single Ended: ANA2, Differential: ANA2+, ANA3-
 * - 0b0011 - Single Ended: ANA3, Differential: ANA2+, ANA3-
 * - 0b0100 - Single Ended: ANA4, Differential: ANA4+, ANA5-
 * - 0b0101 - Single Ended: ANA5, Differential: ANA4+, ANA5-
 * - 0b0110 - Single Ended: ANA6, Differential: ANA6+, ANA7-
 * - 0b0111 - Single Ended: ANA7, Differential: ANA6+, ANA7-
 * - 0b1000 - Single Ended: ANB0, Differential: ANB0+, ANB1-
 * - 0b1001 - Single Ended: ANB1, Differential: ANB0+, ANB1-
 * - 0b1010 - Single Ended: ANB2, Differential: ANB2+, ANB3-
 * - 0b1011 - Single Ended: ANB3, Differential: ANB2+, ANB3-
 * - 0b1100 - Single Ended: ANB4, Differential: ANB4+, ANB5-
 * - 0b1101 - Single Ended: ANB5, Differential: ANB4+, ANB5-
 * - 0b1110 - Single Ended: ANB6, Differential: ANB6+, ANB7-
 * - 0b1111 - Single Ended: ANB7, Differential: ANB6+, ANB7-
 */
/*@{*/
/*! @brief Read current value of the HSADC_CLIST4_SAMPLE15 field. */
#define HSADC_RD_CLIST4_SAMPLE15(base) ((HSADC_CLIST4_REG(base) & HSADC_CLIST4_SAMPLE15_MASK) >> HSADC_CLIST4_SAMPLE15_SHIFT)
#define HSADC_BRD_CLIST4_SAMPLE15(base) (BME_UBFX16(&HSADC_CLIST4_REG(base), HSADC_CLIST4_SAMPLE15_SHIFT, HSADC_CLIST4_SAMPLE15_WIDTH))

/*! @brief Set the SAMPLE15 field to a new value. */
#define HSADC_WR_CLIST4_SAMPLE15(base, value) (HSADC_RMW_CLIST4(base, HSADC_CLIST4_SAMPLE15_MASK, HSADC_CLIST4_SAMPLE15(value)))
#define HSADC_BWR_CLIST4_SAMPLE15(base, value) (BME_BFI16(&HSADC_CLIST4_REG(base), ((uint16_t)(value) << HSADC_CLIST4_SAMPLE15_SHIFT), HSADC_CLIST4_SAMPLE15_SHIFT, HSADC_CLIST4_SAMPLE15_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_SDIS - ADC Sample Disable Register
 ******************************************************************************/

/*!
 * @brief HSADC_SDIS - ADC Sample Disable Register (RW)
 *
 * Reset value: 0xF0F0U
 *
 * Each bit of ADC_SDIS corresponds to a SAMPLEx field in one or multiple
 * ADC_CLISTn registers. Eg. bit 0 of ADC_SDIS will enable/disable ADC_CLIST1[SAMPLE0],
 * bit 15 of ADC_SDIS will enable/disable ADC_CLIST4[SAMPLE15]. If an ADC_SDIS
 * bit is clear, then the corresponding SAMPLEx field will be enabled in an ADC
 * scan. If the ADC_SDIS bit is set, then the corresponding SAMPLEx field will be
 * disabled and the ADC scan will be halted and subsequent ADC acquisition will
 * also not occur. Remembering that the ADC will sequentially scan in order
 * SAMPLE0, SAMPLE1, SAMPLE2,... etc. thus if ADC_SDIS=0xFFF7, then an ADC scan will
 * acquire SAMPLE0 while SAMPLE1, SAMPLE2, and all other acquistions will not occur.
 * The 4-bit wide SAMPLEx fields are found in the ADC_CLISTn registers which
 * select a particular ADC channel and whether it will be a differential or single
 * ended conversion.
 */
/*!
 * @name Constants and macros for entire HSADC_SDIS register
 */
/*@{*/
#define HSADC_RD_SDIS(base)      (HSADC_SDIS_REG(base))
#define HSADC_WR_SDIS(base, value) (HSADC_SDIS_REG(base) = (value))
#define HSADC_RMW_SDIS(base, mask, value) (HSADC_WR_SDIS(base, (HSADC_RD_SDIS(base) & ~(mask)) | (value)))
#define HSADC_SET_SDIS(base, value) (BME_OR16(&HSADC_SDIS_REG(base), (uint16_t)(value)))
#define HSADC_CLR_SDIS(base, value) (BME_AND16(&HSADC_SDIS_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_SDIS(base, value) (BME_XOR16(&HSADC_SDIS_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * HSADC_STAT - ADC Status Register
 ******************************************************************************/

/*!
 * @brief HSADC_STAT - ADC Status Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register provides the current status of the ADC module. STAT[HLMTI and
 * LLMTI] bits are cleared by writing 1s to all asserted bits in the limit status
 * register, LIMSTAT. Likewise, the STAT[ZCI] bit, is cleared by writing 1s to
 * all asserted bits in the zero crossing status register, ZXSTAT. The STAT[EOSIx]
 * bits are cleared by writing a one to them. Except for STAT[CIP0, CIP1, DUMMY0,
 * DUMM1, CALON0 and CALON1] this register's bits are sticky. Once set to a one
 * state, they require some specific action to clear them. They are not cleared
 * automatically on the next scan sequence.
 */
/*!
 * @name Constants and macros for entire HSADC_STAT register
 */
/*@{*/
#define HSADC_RD_STAT(base)      (HSADC_STAT_REG(base))
#define HSADC_WR_STAT(base, value) (HSADC_STAT_REG(base) = (value))
#define HSADC_RMW_STAT(base, mask, value) (HSADC_WR_STAT(base, (HSADC_RD_STAT(base) & ~(mask)) | (value)))
#define HSADC_SET_STAT(base, value) (BME_OR16(&HSADC_STAT_REG(base), (uint16_t)(value)))
#define HSADC_CLR_STAT(base, value) (BME_AND16(&HSADC_STAT_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_STAT(base, value) (BME_XOR16(&HSADC_STAT_REG(base), (uint16_t)(value)))
/*@}*/

