pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual HSADC_STAT bitfields
 */

/*!
 * @name Register HSADC_STAT, field CALON0[0] (RO)
 *
 * Values:
 * - 0b0 - Calibration is not running
 * - 0b1 - ADC A is running calibration conversions
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_CALON0 field. */
#define HSADC_RD_STAT_CALON0(base) ((HSADC_STAT_REG(base) & HSADC_STAT_CALON0_MASK) >> HSADC_STAT_CALON0_SHIFT)
#define HSADC_BRD_STAT_CALON0(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_CALON0_SHIFT, HSADC_STAT_CALON0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field CALON1[1] (RO)
 *
 * Values:
 * - 0b0 - Calibration is not running
 * - 0b1 - ADC B is running calibration conversions
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_CALON1 field. */
#define HSADC_RD_STAT_CALON1(base) ((HSADC_STAT_REG(base) & HSADC_STAT_CALON1_MASK) >> HSADC_STAT_CALON1_SHIFT)
#define HSADC_BRD_STAT_CALON1(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_CALON1_SHIFT, HSADC_STAT_CALON1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field DUMMY0[2] (RO)
 *
 * Values:
 * - 0b0 - Dummy conversion is not running
 * - 0b1 - Dummy conversion is running on ADC A
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_DUMMY0 field. */
#define HSADC_RD_STAT_DUMMY0(base) ((HSADC_STAT_REG(base) & HSADC_STAT_DUMMY0_MASK) >> HSADC_STAT_DUMMY0_SHIFT)
#define HSADC_BRD_STAT_DUMMY0(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_DUMMY0_SHIFT, HSADC_STAT_DUMMY0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field DUMMY1[3] (RO)
 *
 * Values:
 * - 0b0 - Dummy conversion is not running
 * - 0b1 - Dummy conversion is running on ADC B
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_DUMMY1 field. */
#define HSADC_RD_STAT_DUMMY1(base) ((HSADC_STAT_REG(base) & HSADC_STAT_DUMMY1_MASK) >> HSADC_STAT_DUMMY1_SHIFT)
#define HSADC_BRD_STAT_DUMMY1(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_DUMMY1_SHIFT, HSADC_STAT_DUMMY1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field EOCALI0[4] (W1C)
 *
 * It is asserted when requested calibrations (single, differential) are ended.
 * If just one type is requested then this flag is asserted at the end of that
 * calibration. It is cleared by writing 1 in the field.
 *
 * Values:
 * - 0b0 - Calibration is not finished.
 * - 0b1 - Calibration is finished on ADC A. The IRQ occurs if CALIB[EOCALIEA]
 *     is asserted.
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_EOCALI0 field. */
#define HSADC_RD_STAT_EOCALI0(base) ((HSADC_STAT_REG(base) & HSADC_STAT_EOCALI0_MASK) >> HSADC_STAT_EOCALI0_SHIFT)
#define HSADC_BRD_STAT_EOCALI0(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_EOCALI0_SHIFT, HSADC_STAT_EOCALI0_WIDTH))

/*! @brief Set the EOCALI0 field to a new value. */
#define HSADC_WR_STAT_EOCALI0(base, value) (HSADC_RMW_STAT(base, (HSADC_STAT_EOCALI0_MASK | HSADC_STAT_EOCALI1_MASK | HSADC_STAT_EOSI0_MASK | HSADC_STAT_EOSI1_MASK), HSADC_STAT_EOCALI0(value)))
#define HSADC_BWR_STAT_EOCALI0(base, value) (BME_BFI16(&HSADC_STAT_REG(base), ((uint16_t)(value) << HSADC_STAT_EOCALI0_SHIFT), HSADC_STAT_EOCALI0_SHIFT, HSADC_STAT_EOCALI0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field EOCALI1[5] (W1C)
 *
 * It is asserted when requested calibrations (single, differential) are ended.
 * If just one type is requested then this flag is asserted at the end of that
 * calibration. It is cleared by writing 1 in the field.
 *
 * Values:
 * - 0b0 - Calibration is not finished.
 * - 0b1 - Calibration is finished on ADC B. The IRQ occurs if CALIB[EOCALIEB]
 *     is asserted.
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_EOCALI1 field. */
#define HSADC_RD_STAT_EOCALI1(base) ((HSADC_STAT_REG(base) & HSADC_STAT_EOCALI1_MASK) >> HSADC_STAT_EOCALI1_SHIFT)
#define HSADC_BRD_STAT_EOCALI1(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_EOCALI1_SHIFT, HSADC_STAT_EOCALI1_WIDTH))

/*! @brief Set the EOCALI1 field to a new value. */
#define HSADC_WR_STAT_EOCALI1(base, value) (HSADC_RMW_STAT(base, (HSADC_STAT_EOCALI1_MASK | HSADC_STAT_EOCALI0_MASK | HSADC_STAT_EOSI0_MASK | HSADC_STAT_EOSI1_MASK), HSADC_STAT_EOCALI1(value)))
#define HSADC_BWR_STAT_EOCALI1(base, value) (BME_BFI16(&HSADC_STAT_REG(base), ((uint16_t)(value) << HSADC_STAT_EOCALI1_SHIFT), HSADC_STAT_EOCALI1_SHIFT, HSADC_STAT_EOCALI1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field HLMTI[8] (RO)
 *
 * If the respective high limit register is enabled by having a value other than
 * 7FF8h, high limit checking is enabled. This interrupt asserts at the
 * completion of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active LIMSTAT[HLS] bits.
 *
 * Values:
 * - 0b0 - No high limit interrupt request
 * - 0b1 - High limit exceeded, IRQ pending if CTRL1[HLMTIE] is set
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_HLMTI field. */
#define HSADC_RD_STAT_HLMTI(base) ((HSADC_STAT_REG(base) & HSADC_STAT_HLMTI_MASK) >> HSADC_STAT_HLMTI_SHIFT)
#define HSADC_BRD_STAT_HLMTI(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_HLMTI_SHIFT, HSADC_STAT_HLMTI_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field LLMTI[9] (RO)
 *
 * If the respective low limit register is enabled by having a value other than
 * 0000h, low limit checking is enabled. This interrupt asserts at the completion
 * of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active LIMSTAT[LLS] bits.
 *
 * Values:
 * - 0b0 - No low limit interrupt request
 * - 0b1 - Low limit exceeded, IRQ pending if CTRL1[LLMTIE] is set
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_LLMTI field. */
#define HSADC_RD_STAT_LLMTI(base) ((HSADC_STAT_REG(base) & HSADC_STAT_LLMTI_MASK) >> HSADC_STAT_LLMTI_SHIFT)
#define HSADC_BRD_STAT_LLMTI(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_LLMTI_SHIFT, HSADC_STAT_LLMTI_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field ZCI[10] (RO)
 *
 * If the respective offset register is configured by having a value greater
 * than 0000h, zero crossing checking is enabled. If the offset register is
 * programmed with 7FF8h, the result will always be less than or equal to zero. On the
 * other hand, if 0000h is programmed into the offset register, the result will
 * always be greater than or equal to zero, and no zero crossing can occur because
 * the sign of the result will not change. This interrupt asserts at the
 * completion of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active ZXSTAT[ZCS] bits.
 *
 * Values:
 * - 0b0 - No zero crossing interrupt request
 * - 0b1 - Zero crossing encountered, IRQ pending if CTRL1[ZCIE] is set
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_ZCI field. */
#define HSADC_RD_STAT_ZCI(base) ((HSADC_STAT_REG(base) & HSADC_STAT_ZCI_MASK) >> HSADC_STAT_ZCI_SHIFT)
#define HSADC_BRD_STAT_ZCI(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_ZCI_SHIFT, HSADC_STAT_ZCI_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field EOSI0[11] (W1C)
 *
 * This bit indicates whether a scan of analog inputs have been completed since
 * the last read of the status register or since a reset. This bit is cleared by
 * writing a one to it. This bit cannot be set by software. STAT[EOSI0] is the
 * preferred bit to poll for scan completion if interrupts are not enabled. In
 * looping scan modes, this interrupt is triggered at the completion of each
 * iteration of the loop. This interrupt is triggered upon the completion of any scan
 * except for the completion of a B converter scan in non-simultaneous parallel scan
 * modes.
 *
 * Values:
 * - 0b0 - A scan cycle has not been completed, no end of scan IRQ pending
 * - 0b1 - A scan cycle has been completed, end of scan IRQ pending
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_EOSI0 field. */
#define HSADC_RD_STAT_EOSI0(base) ((HSADC_STAT_REG(base) & HSADC_STAT_EOSI0_MASK) >> HSADC_STAT_EOSI0_SHIFT)
#define HSADC_BRD_STAT_EOSI0(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_EOSI0_SHIFT, HSADC_STAT_EOSI0_WIDTH))

/*! @brief Set the EOSI0 field to a new value. */
#define HSADC_WR_STAT_EOSI0(base, value) (HSADC_RMW_STAT(base, (HSADC_STAT_EOSI0_MASK | HSADC_STAT_EOCALI0_MASK | HSADC_STAT_EOCALI1_MASK | HSADC_STAT_EOSI1_MASK), HSADC_STAT_EOSI0(value)))
#define HSADC_BWR_STAT_EOSI0(base, value) (BME_BFI16(&HSADC_STAT_REG(base), ((uint16_t)(value) << HSADC_STAT_EOSI0_SHIFT), HSADC_STAT_EOSI0_SHIFT, HSADC_STAT_EOSI0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field EOSI1[12] (W1C)
 *
 * This bit indicates whether a scan of analog inputs have been completed since
 * the last read of the status register or since a reset. This bit is cleared by
 * writing a one to it. This bit cannot be set by software. In looping scan
 * modes, this interrupt is triggered at the completion of each iteration of the loop.
 * This interrupt is triggered only by the completion of a B converter scan in
 * non-simultaneous parallel scan modes.
 *
 * Values:
 * - 0b0 - A scan cycle has not been completed, no end of scan IRQ pending
 * - 0b1 - A scan cycle has been completed, end of scan IRQ pending
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_EOSI1 field. */
#define HSADC_RD_STAT_EOSI1(base) ((HSADC_STAT_REG(base) & HSADC_STAT_EOSI1_MASK) >> HSADC_STAT_EOSI1_SHIFT)
#define HSADC_BRD_STAT_EOSI1(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_EOSI1_SHIFT, HSADC_STAT_EOSI1_WIDTH))

/*! @brief Set the EOSI1 field to a new value. */
#define HSADC_WR_STAT_EOSI1(base, value) (HSADC_RMW_STAT(base, (HSADC_STAT_EOSI1_MASK | HSADC_STAT_EOCALI0_MASK | HSADC_STAT_EOCALI1_MASK | HSADC_STAT_EOSI0_MASK), HSADC_STAT_EOSI1(value)))
#define HSADC_BWR_STAT_EOSI1(base, value) (BME_BFI16(&HSADC_STAT_REG(base), ((uint16_t)(value) << HSADC_STAT_EOSI1_SHIFT), HSADC_STAT_EOSI1_SHIFT, HSADC_STAT_EOSI1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field CIP1[14] (RO)
 *
 * This bit indicates whether a scan is in progress. It also indicates if the
 * ADC is running a dummy conversion or it is running a calibration procedure. This
 * refers only to a B converter scan / activity in non-simultaneous parallel
 * scan modes.
 *
 * Values:
 * - 0b0 - Idle state
 * - 0b1 - A scan cycle is in progress. The ADC will ignore all sync pulses or
 *     start commands
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_CIP1 field. */
#define HSADC_RD_STAT_CIP1(base) ((HSADC_STAT_REG(base) & HSADC_STAT_CIP1_MASK) >> HSADC_STAT_CIP1_SHIFT)
#define HSADC_BRD_STAT_CIP1(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_CIP1_SHIFT, HSADC_STAT_CIP1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_STAT, field CIP0[15] (RO)
 *
 * This bit indicates whether a scan is in progress. It also indicates if the
 * ADC is running a dummy conversion or it is running a calibration procedure. This
 * refers to any scan / activity except a B converter scan in non-simultaneous
 * parallel scan modes.
 *
 * Values:
 * - 0b0 - Idle state
 * - 0b1 - A scan cycle is in progress. The ADC will ignore all sync pulses or
 *     start commands
 */
/*@{*/
/*! @brief Read current value of the HSADC_STAT_CIP0 field. */
#define HSADC_RD_STAT_CIP0(base) ((HSADC_STAT_REG(base) & HSADC_STAT_CIP0_MASK) >> HSADC_STAT_CIP0_SHIFT)
#define HSADC_BRD_STAT_CIP0(base) (BME_UBFX16(&HSADC_STAT_REG(base), HSADC_STAT_CIP0_SHIFT, HSADC_STAT_CIP0_WIDTH))
/*@}*/

