pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * HSADC_RDY - ADC Ready Register
 ******************************************************************************/

/*!
 * @brief HSADC_RDY - ADC Ready Register (RO)
 *
 * Reset value: 0x0000U
 *
 * This register provides the current status of the ADC conversions. RDY[RDYx]
 * bits are cleared by reading their corresponding result registers (RSLTx).
 */
/*!
 * @name Constants and macros for entire HSADC_RDY register
 */
/*@{*/
#define HSADC_RD_RDY(base)       (HSADC_RDY_REG(base))
/*@}*/

/*******************************************************************************
 * HSADC_LOLIMSTAT - ADC Low Limit Status Register
 ******************************************************************************/

/*!
 * @brief HSADC_LOLIMSTAT - ADC Low Limit Status Register (W1C)
 *
 * Reset value: 0x0000U
 *
 * The low limit status register latches in the result of the comparison between
 * the result of the sample and the respective low limit register, LOLIM0-15.
 * Here is an example: If the result for the channel programmed in CLIST1[SAMPLE0]
 * is lower than the value programmed into the Low Limit Register zero, then the
 * LIMSTAT[LLS0] bit is set to one. An interrupt is generated if the
 * CTRL1[LLMTIE] bit is set. These bits are sticky. They are not cleared automatically by
 * subsequent conversions. Each bit is cleared only by writing a value of one to
 * that specific bit.
 */
/*!
 * @name Constants and macros for entire HSADC_LOLIMSTAT register
 */
/*@{*/
#define HSADC_RD_LOLIMSTAT(base) (HSADC_LOLIMSTAT_REG(base))
#define HSADC_WR_LOLIMSTAT(base, value) (HSADC_LOLIMSTAT_REG(base) = (value))
#define HSADC_RMW_LOLIMSTAT(base, mask, value) (HSADC_WR_LOLIMSTAT(base, (HSADC_RD_LOLIMSTAT(base) & ~(mask)) | (value)))
#define HSADC_SET_LOLIMSTAT(base, value) (BME_OR16(&HSADC_LOLIMSTAT_REG(base), (uint16_t)(value)))
#define HSADC_CLR_LOLIMSTAT(base, value) (BME_AND16(&HSADC_LOLIMSTAT_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_LOLIMSTAT(base, value) (BME_XOR16(&HSADC_LOLIMSTAT_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * HSADC_HILIMSTAT - ADC High Limit Status Register
 ******************************************************************************/

/*!
 * @brief HSADC_HILIMSTAT - ADC High Limit Status Register (W1C)
 *
 * Reset value: 0x0000U
 *
 * The high limit status register latches in the result of the comparison
 * between the result of the sample and the respective high limit register, HILIM0-15.
 * Here is an example: If the result for the channel programmed in
 * CLIST1[SAMPLE0] is greater than the value programmed into the High Limit Register zero, then
 * the HILIMSTAT[HLS0] bit is set to one. An interrupt is generated if the
 * CTRL1[HLMTIE] bit is set. These bits are sticky. They are not cleared automatically
 * by subsequent conversions. Each bit is cleared only by writing a value of one
 * to that specific bit.
 */
/*!
 * @name Constants and macros for entire HSADC_HILIMSTAT register
 */
/*@{*/
#define HSADC_RD_HILIMSTAT(base) (HSADC_HILIMSTAT_REG(base))
#define HSADC_WR_HILIMSTAT(base, value) (HSADC_HILIMSTAT_REG(base) = (value))
#define HSADC_RMW_HILIMSTAT(base, mask, value) (HSADC_WR_HILIMSTAT(base, (HSADC_RD_HILIMSTAT(base) & ~(mask)) | (value)))
#define HSADC_SET_HILIMSTAT(base, value) (BME_OR16(&HSADC_HILIMSTAT_REG(base), (uint16_t)(value)))
#define HSADC_CLR_HILIMSTAT(base, value) (BME_AND16(&HSADC_HILIMSTAT_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_HILIMSTAT(base, value) (BME_XOR16(&HSADC_HILIMSTAT_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * HSADC_ZXSTAT - ADC Zero Crossing Status Register
 ******************************************************************************/

/*!
 * @brief HSADC_ZXSTAT - ADC Zero Crossing Status Register (W1C)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire HSADC_ZXSTAT register
 */
/*@{*/
#define HSADC_RD_ZXSTAT(base)    (HSADC_ZXSTAT_REG(base))
#define HSADC_WR_ZXSTAT(base, value) (HSADC_ZXSTAT_REG(base) = (value))
#define HSADC_RMW_ZXSTAT(base, mask, value) (HSADC_WR_ZXSTAT(base, (HSADC_RD_ZXSTAT(base) & ~(mask)) | (value)))
#define HSADC_SET_ZXSTAT(base, value) (BME_OR16(&HSADC_ZXSTAT_REG(base), (uint16_t)(value)))
#define HSADC_CLR_ZXSTAT(base, value) (BME_AND16(&HSADC_ZXSTAT_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_ZXSTAT(base, value) (BME_XOR16(&HSADC_ZXSTAT_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * HSADC_RSLT - ADC Result Registers with sign extension
 ******************************************************************************/

/*!
 * @brief HSADC_RSLT - ADC Result Registers with sign extension (RW)
 *
 * Reset value: 0x0000U
 *
 * The result registers contain the converted results from a scan. The
 * CLIST1[SAMPLE0] result is loaded into RSLT0, CLIST1[SAMPLE1] result in RSLT1, and so
 * on. In a parallel scan mode, the first channel pair designated by
 * CLIST1[SAMPLE0] and CLIST3[SAMPLE8] are stored in RSLT0 and RSLT8, respectively. When
 * writing to this register, only the RSLT portion of the value written is used. This
 * value is modified and the result of the subtraction is stored. The SEXT bit is
 * only set as a result of this subtraction and is not directly determined by the
 * value written. When using conversions of 10, 8, or 6 bits resolution, only
 * the MSB bits (10, or 8, or 6 bits) of the RSLT portion should be considered. The
 * remaining bits have no meaning.
 */
/*!
 * @name Constants and macros for entire HSADC_RSLT register
 */
/*@{*/
#define HSADC_RD_RSLT(base, index) (HSADC_RSLT_REG(base, index))
#define HSADC_WR_RSLT(base, index, value) (HSADC_RSLT_REG(base, index) = (value))
#define HSADC_RMW_RSLT(base, index, mask, value) (HSADC_WR_RSLT(base, index, (HSADC_RD_RSLT(base, index) & ~(mask)) | (value)))
#define HSADC_SET_RSLT(base, index, value) (BME_OR16(&HSADC_RSLT_REG(base, index), (uint16_t)(value)))
#define HSADC_CLR_RSLT(base, index, value) (BME_AND16(&HSADC_RSLT_REG(base, index), (uint16_t)(~(value))))
#define HSADC_TOG_RSLT(base, index, value) (BME_XOR16(&HSADC_RSLT_REG(base, index), (uint16_t)(value)))
/*@}*/

