pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual HSADC_RSLT bitfields
 */

/*!
 * @name Register HSADC_RSLT, field RSLT[14:3] (RW)
 *
 * RSLT can be interpreted as either a signed integer or a signed fractional
 * number. As a signed fractional number, the RSLT can be used directly. As a signed
 * integer, it is an option to right shift with sign extend (ASR) three places
 * and interpret the number, or accept the number as presented, knowing there are
 * missing codes. The lower three bits are always going to be zero. Negative
 * results, RSLT*[SEXT] = 1, are always presented in two's complement format. If it
 * is a requirement of your application that the result registers always be
 * positive, the offset registers must always be set to zero. The interpretation of the
 * numbers programmed into the limit and offset registers, LOLIM, HILIM, and
 * OFFST should match your interpretation of the result register.
 */
/*@{*/
/*! @brief Read current value of the HSADC_RSLT_RSLT field. */
#define HSADC_RD_RSLT_RSLT(base, index) ((HSADC_RSLT_REG(base, index) & HSADC_RSLT_RSLT_MASK) >> HSADC_RSLT_RSLT_SHIFT)
#define HSADC_BRD_RSLT_RSLT(base, index) (HSADC_RD_RSLT_RSLT(base, index))

/*! @brief Set the RSLT field to a new value. */
#define HSADC_WR_RSLT_RSLT(base, index, value) (HSADC_RMW_RSLT(base, index, HSADC_RSLT_RSLT_MASK, HSADC_RSLT_RSLT(value)))
#define HSADC_BWR_RSLT_RSLT(base, index, value) (HSADC_WR_RSLT_RSLT(base, index, value))
/*@}*/

/*!
 * @name Register HSADC_RSLT, field SEXT[15] (RO)
 *
 * This is the sign-extend bit of the result. RSLT*[SEXT] set to one implies a
 * negative result; RSLT*[SEXT] set to zero implies a positive result. If unsigned
 * results are required, then the respective offset register must be set to a
 * value of zero.
 */
/*@{*/
/*! @brief Read current value of the HSADC_RSLT_SEXT field. */
#define HSADC_RD_RSLT_SEXT(base, index) ((HSADC_RSLT_REG(base, index) & HSADC_RSLT_SEXT_MASK) >> HSADC_RSLT_SEXT_SHIFT)
#define HSADC_BRD_RSLT_SEXT(base, index) (BME_UBFX16(&HSADC_RSLT_REG(base, index), HSADC_RSLT_SEXT_SHIFT, HSADC_RSLT_SEXT_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_LOLIM - ADC Low Limit Registers
 ******************************************************************************/

/*!
 * @brief HSADC_LOLIM - ADC Low Limit Registers (RW)
 *
 * Reset value: 0x0000U
 *
 * Each ADC sample is compared against the values in the limit registers. The
 * comparison is based upon the raw conversion value with no offset correction
 * applied. The limit register used corresponds to the result register the value will
 * be written to. The high limit register is used for the comparison of Result >
 * High Limit. The low limit register is used for the comparison of Result < Low
 * Limit. The limit checking can be disabled by programming the respective limit
 * register with 7FF8h for the high limit and 0000h for the low limit. At reset,
 * limit checking is disabled.
 */
/*!
 * @name Constants and macros for entire HSADC_LOLIM register
 */
/*@{*/
#define HSADC_RD_LOLIM(base, index) (HSADC_LOLIM_REG(base, index))
#define HSADC_WR_LOLIM(base, index, value) (HSADC_LOLIM_REG(base, index) = (value))
#define HSADC_RMW_LOLIM(base, index, mask, value) (HSADC_WR_LOLIM(base, index, (HSADC_RD_LOLIM(base, index) & ~(mask)) | (value)))
#define HSADC_SET_LOLIM(base, index, value) (BME_OR16(&HSADC_LOLIM_REG(base, index), (uint16_t)(value)))
#define HSADC_CLR_LOLIM(base, index, value) (BME_AND16(&HSADC_LOLIM_REG(base, index), (uint16_t)(~(value))))
#define HSADC_TOG_LOLIM(base, index, value) (BME_XOR16(&HSADC_LOLIM_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_LOLIM bitfields
 */

/*!
 * @name Register HSADC_LOLIM, field LLMT[14:3] (RW)
 */
/*@{*/
/*! @brief Read current value of the HSADC_LOLIM_LLMT field. */
#define HSADC_RD_LOLIM_LLMT(base, index) ((HSADC_LOLIM_REG(base, index) & HSADC_LOLIM_LLMT_MASK) >> HSADC_LOLIM_LLMT_SHIFT)
#define HSADC_BRD_LOLIM_LLMT(base, index) (HSADC_RD_LOLIM_LLMT(base, index))

/*! @brief Set the LLMT field to a new value. */
#define HSADC_WR_LOLIM_LLMT(base, index, value) (HSADC_RMW_LOLIM(base, index, HSADC_LOLIM_LLMT_MASK, HSADC_LOLIM_LLMT(value)))
#define HSADC_BWR_LOLIM_LLMT(base, index, value) (HSADC_WR_LOLIM_LLMT(base, index, value))
/*@}*/

/*******************************************************************************
 * HSADC_HILIM - ADC High Limit Registers
 ******************************************************************************/

/*!
 * @brief HSADC_HILIM - ADC High Limit Registers (RW)
 *
 * Reset value: 0x7FF8U
 *
 * Each ADC sample is compared against the values in the limit registers. The
 * comparison is based upon the raw conversion value with no offset correction
 * applied. The limit register used corresponds to the result register the value will
 * be written to. The high limit register is used for the comparison of Result >
 * High Limit. The low limit register is used for the comparison of Result < Low
 * Limit. The limit checking can be disabled by programming the respective limit
 * register with 7FF8h for the high limit and 0000h for the low limit. At reset,
 * limit checking is disabled.
 */
/*!
 * @name Constants and macros for entire HSADC_HILIM register
 */
/*@{*/
#define HSADC_RD_HILIM(base, index) (HSADC_HILIM_REG(base, index))
#define HSADC_WR_HILIM(base, index, value) (HSADC_HILIM_REG(base, index) = (value))
#define HSADC_RMW_HILIM(base, index, mask, value) (HSADC_WR_HILIM(base, index, (HSADC_RD_HILIM(base, index) & ~(mask)) | (value)))
#define HSADC_SET_HILIM(base, index, value) (BME_OR16(&HSADC_HILIM_REG(base, index), (uint16_t)(value)))
#define HSADC_CLR_HILIM(base, index, value) (BME_AND16(&HSADC_HILIM_REG(base, index), (uint16_t)(~(value))))
#define HSADC_TOG_HILIM(base, index, value) (BME_XOR16(&HSADC_HILIM_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_HILIM bitfields
 */

/*!
 * @name Register HSADC_HILIM, field HLMT[14:3] (RW)
 */
/*@{*/
/*! @brief Read current value of the HSADC_HILIM_HLMT field. */
#define HSADC_RD_HILIM_HLMT(base, index) ((HSADC_HILIM_REG(base, index) & HSADC_HILIM_HLMT_MASK) >> HSADC_HILIM_HLMT_SHIFT)
#define HSADC_BRD_HILIM_HLMT(base, index) (HSADC_RD_HILIM_HLMT(base, index))

/*! @brief Set the HLMT field to a new value. */
#define HSADC_WR_HILIM_HLMT(base, index, value) (HSADC_RMW_HILIM(base, index, HSADC_HILIM_HLMT_MASK, HSADC_HILIM_HLMT(value)))
#define HSADC_BWR_HILIM_HLMT(base, index, value) (HSADC_WR_HILIM_HLMT(base, index, value))
/*@}*/

