pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * HSADC_OFFST - ADC Offset Registers
 ******************************************************************************/

/*!
 * @brief HSADC_OFFST - ADC Offset Registers (RW)
 *
 * Reset value: 0x0000U
 *
 * The value of the offset register is used to correct the ADC result before it
 * is stored in the RSLT registers. The offset value is subtracted from the ADC
 * result. To obtain unsigned results, program the respective offset register with
 * a value of $0000, thus giving a result range of $0000 to $7FF8.
 */
/*!
 * @name Constants and macros for entire HSADC_OFFST register
 */
/*@{*/
#define HSADC_RD_OFFST(base, index) (HSADC_OFFST_REG(base, index))
#define HSADC_WR_OFFST(base, index, value) (HSADC_OFFST_REG(base, index) = (value))
#define HSADC_RMW_OFFST(base, index, mask, value) (HSADC_WR_OFFST(base, index, (HSADC_RD_OFFST(base, index) & ~(mask)) | (value)))
#define HSADC_SET_OFFST(base, index, value) (BME_OR16(&HSADC_OFFST_REG(base, index), (uint16_t)(value)))
#define HSADC_CLR_OFFST(base, index, value) (BME_AND16(&HSADC_OFFST_REG(base, index), (uint16_t)(~(value))))
#define HSADC_TOG_OFFST(base, index, value) (BME_XOR16(&HSADC_OFFST_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_OFFST bitfields
 */

/*!
 * @name Register HSADC_OFFST, field OFFSET[14:3] (RW)
 */
/*@{*/
/*! @brief Read current value of the HSADC_OFFST_OFFSET field. */
#define HSADC_RD_OFFST_OFFSET(base, index) ((HSADC_OFFST_REG(base, index) & HSADC_OFFST_OFFSET_MASK) >> HSADC_OFFST_OFFSET_SHIFT)
#define HSADC_BRD_OFFST_OFFSET(base, index) (HSADC_RD_OFFST_OFFSET(base, index))

/*! @brief Set the OFFSET field to a new value. */
#define HSADC_WR_OFFST_OFFSET(base, index, value) (HSADC_RMW_OFFST(base, index, HSADC_OFFST_OFFSET_MASK, HSADC_OFFST_OFFSET(value)))
#define HSADC_BWR_OFFST_OFFSET(base, index, value) (HSADC_WR_OFFST_OFFSET(base, index, value))
/*@}*/

/*******************************************************************************
 * HSADC_PWR - ADC Power Control Register
 ******************************************************************************/

/*!
 * @brief HSADC_PWR - ADC Power Control Register (RW)
 *
 * Reset value: 0x1D27U
 *
 * This register controls the power management features of the ADC module. There
 * are individual manual power down controls for the two ADC converters and the
 * voltage reference generators. There are also five distinct power modes. The
 * following terms are used to describe power modes and their related controls.
 * Power down state Each converter and voltage reference generator can individually
 * be put into a power down state. When powered down, the unit consumes no power.
 * Results of scans referencing a powered down converter are undefined. At least
 * one converter must be powered up to use the ADC module. Manual power down
 * controls Each converter and voltage reference generator have a manual power
 * control bit capable of putting that component into the power down state. Converters
 * have other mechanisms that can automatically put them into the power down
 * state. Idle state The ADC module is idle when neither of the two converters has a
 * scan in process. Active state The ADC module is active when at least one of
 * the two converters has a scan in process. Startup delay Auto-powerdown and
 * auto-standby power modes cause a startup delay when the ADC module goes between
 * the power down and active states to allow time power up the internal ADC LDO.
 * Dummy conversion or calibration delay Auto-powerdown and auto-standby power
 * modes cause a dummy conversion execution delay or a calibration execution delay
 * when the ADC module goes between the idle and active states to initiate the ADC
 * internal logic.
 */
/*!
 * @name Constants and macros for entire HSADC_PWR register
 */
/*@{*/
#define HSADC_RD_PWR(base)       (HSADC_PWR_REG(base))
#define HSADC_WR_PWR(base, value) (HSADC_PWR_REG(base) = (value))
#define HSADC_RMW_PWR(base, mask, value) (HSADC_WR_PWR(base, (HSADC_RD_PWR(base) & ~(mask)) | (value)))
#define HSADC_SET_PWR(base, value) (BME_OR16(&HSADC_PWR_REG(base), (uint16_t)(value)))
#define HSADC_CLR_PWR(base, value) (BME_AND16(&HSADC_PWR_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_PWR(base, value) (BME_XOR16(&HSADC_PWR_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_PWR bitfields
 */

/*!
 * @name Register HSADC_PWR, field PD0[0] (RW)
 *
 * This bit forces ADC converter A to power down. Asserting this bit powers down
 * converter A immediately, except when it is in power-up phase. The results of
 * a scan using converter A will be invalid while PWR[PD0] is asserted. When
 * PWR[PD0] is cleared, converter A is either continuously powered up (PWR[APD] = 0)
 * or automatically powered up when needed (PWR[APD]=1). When clearing this bit
 * in any power mode except auto-powerdown (PWR[APD]=1) or auto-standby
 * (PWR[ASB]=1), wait (PWR[PUDELAY] x 32) ADC clock cycles before initiating a scan to
 * stabilize power levels within the converter. The PWR[PSTS0] bit can be polled to
 * determine when the (PWR[PUDELAY] x 32) time has elapsed. Failure to follow this
 * procedure can result in loss of accuracy of the calibration procedure and of
 * the initial samples. During power-up delay phase if the stop request (STOP0)
 * is set, the power-down request is only recognized at the end of this phase,
 * after the ADC reset is applied (two ADC clock cycles).
 *
 * Values:
 * - 0b0 - Power Up ADC converter A
 * - 0b1 - Power Down ADC converter A
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PD0 field. */
#define HSADC_RD_PWR_PD0(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PD0_MASK) >> HSADC_PWR_PD0_SHIFT)
#define HSADC_BRD_PWR_PD0(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PD0_SHIFT, HSADC_PWR_PD0_WIDTH))

/*! @brief Set the PD0 field to a new value. */
#define HSADC_WR_PWR_PD0(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_PD0_MASK, HSADC_PWR_PD0(value)))
#define HSADC_BWR_PWR_PD0(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_PD0_SHIFT), HSADC_PWR_PD0_SHIFT, HSADC_PWR_PD0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field PD1[1] (RW)
 *
 * This bit forces ADC converter B to power down. Asserting this bit powers down
 * converter B immediately, except when it is in power-up phase. The results of
 * a scan using converter B will be invalid while PWR[PD1] is asserted. When
 * PWR[PD1] is cleared, converter B is either continuously powered up (PWR[APD] = 0)
 * or automatically powered up when needed (PWR[APD]=1). When clearing this bit
 * in any power mode except auto-powerdown (PWR[APD]=1) or auto-standby
 * (PWR[ASB]=1), wait (PWR[PUDELAY] x 32) ADC clock cycles before initiating a scan to
 * stabilize power levels within the converter. The PWR[PSTS1] bit can be polled to
 * determine when the (PWR[PUDELAY] x 32) time has elapsed. Failure to follow this
 * procedure can result in loss of accuracy of the calibration procedure and of
 * the initial samples. During power-up delay phase if the stop request (STOP1)
 * is set, the power-down request is only recognized at the end of this phase,
 * after the ADC reset is applied (two ADC clock cycles).
 *
 * Values:
 * - 0b0 - Power Up ADC converter B
 * - 0b1 - Power Down ADC converter B
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PD1 field. */
#define HSADC_RD_PWR_PD1(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PD1_MASK) >> HSADC_PWR_PD1_SHIFT)
#define HSADC_BRD_PWR_PD1(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PD1_SHIFT, HSADC_PWR_PD1_WIDTH))

/*! @brief Set the PD1 field to a new value. */
#define HSADC_WR_PWR_PD1(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_PD1_MASK, HSADC_PWR_PD1(value)))
#define HSADC_BWR_PWR_PD1(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_PD1_SHIFT), HSADC_PWR_PD1_SHIFT, HSADC_PWR_PD1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field APD[3] (RW)
 *
 * Auto-powerdown mode powers down converters when not in use for a scan.
 * PWR[APD] takes precedence over PWR[ASB]. When a scan is started in PWR[APD] mode, a
 * delay of (PWR[PUDELAY] x 32) ADC clock cycles is imposed during which the
 * needed converter(s), if idle, are powered up. The ADC will then initiate a scan
 * equivalent to that done when PWR[APD] is not active. When the scan is completed,
 * the converter(s) are powered down again. If PWR[ASB or APD] is asserted while
 * a scan is in progress, that scan is unaffected and the ADC will wait to enter
 * its low power state until after all conversions are complete and both ADCs
 * are idle. PWR[ASB and APD] are not useful in looping modes. The continuous
 * nature of scanning means that the low power state can never be entered.
 *
 * Values:
 * - 0b0 - Auto Powerdown Mode is not active
 * - 0b1 - Auto Powerdown Mode is active
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_APD field. */
#define HSADC_RD_PWR_APD(base) ((HSADC_PWR_REG(base) & HSADC_PWR_APD_MASK) >> HSADC_PWR_APD_SHIFT)
#define HSADC_BRD_PWR_APD(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_APD_SHIFT, HSADC_PWR_APD_WIDTH))

/*! @brief Set the APD field to a new value. */
#define HSADC_WR_PWR_APD(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_APD_MASK, HSADC_PWR_APD(value)))
#define HSADC_BWR_PWR_APD(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_APD_SHIFT), HSADC_PWR_APD_SHIFT, HSADC_PWR_APD_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field PUDELAY[9:4] (RW)
 *
 * This 6-bit field multiplied by 32 determines the number of ADC clocks
 * provided to power up an ADC converter (after setting PWR[PD0 or PD1] to 0) before
 * allowing a scan to start. It also determines the number of ADC clocks of delay
 * provided in auto-powerdown (APD) and auto-standby (ASB) modes between when the
 * ADC goes from the idle to active state and when the scan is allowed to start.
 * The default value is 18 that means a power-up time of about 18x32 ADC clocks.
 * Accuracy of the initial conversions in a scan will be degraded if PWR[PUDELAY]
 * is set to a too small value. PWR[PUDELAY] defaults to a value that is
 * typically sufficient for any power mode. The latency of a scan can be reduced by
 * reducing PWR[PUDELAY] to the lowest value for which accuracy is not degraded. Refer
 * to the data sheet for further details.
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PUDELAY field. */
#define HSADC_RD_PWR_PUDELAY(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PUDELAY_MASK) >> HSADC_PWR_PUDELAY_SHIFT)
#define HSADC_BRD_PWR_PUDELAY(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PUDELAY_SHIFT, HSADC_PWR_PUDELAY_WIDTH))

/*! @brief Set the PUDELAY field to a new value. */
#define HSADC_WR_PWR_PUDELAY(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_PUDELAY_MASK, HSADC_PWR_PUDELAY(value)))
#define HSADC_BWR_PWR_PUDELAY(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_PUDELAY_SHIFT), HSADC_PWR_PUDELAY_SHIFT, HSADC_PWR_PUDELAY_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field PSTS0[10] (RO)
 *
 * This bit is asserted immediately following a write of "1" to PWR[PD0]. It is
 * de-asserted (PWR[PUDELAY] x 32) ADC clock cycles after a write of "0" to
 * PWR[PD0] if PWR[APD] is "0". This bit can be read as a status bit to determine when
 * the ADC is ready for operation. During auto-powerdown mode, this bit
 * indicates the current powered state of converter A.
 *
 * Values:
 * - 0b0 - ADC Converter A is currently powered up
 * - 0b1 - ADC Converter A is currently powered down
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PSTS0 field. */
#define HSADC_RD_PWR_PSTS0(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PSTS0_MASK) >> HSADC_PWR_PSTS0_SHIFT)
#define HSADC_BRD_PWR_PSTS0(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PSTS0_SHIFT, HSADC_PWR_PSTS0_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field PSTS1[11] (RO)
 *
 * This bit is asserted immediately following a write of "1" to PWR[PD1]. It is
 * de-asserted (PWR[PUDELAY] x 32) ADC clock cycles after a write of "0" to
 * PWR[PD1] if PWR[APD] is "0". This bit can be read as a status bit to determine when
 * the ADC is ready for operation. During auto-powerdown mode, this bit
 * indicates the current powered state of converter B.
 *
 * Values:
 * - 0b0 - ADC Converter B is currently powered up
 * - 0b1 - ADC Converter B is currently powered down
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_PSTS1 field. */
#define HSADC_RD_PWR_PSTS1(base) ((HSADC_PWR_REG(base) & HSADC_PWR_PSTS1_MASK) >> HSADC_PWR_PSTS1_SHIFT)
#define HSADC_BRD_PWR_PSTS1(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_PSTS1_SHIFT, HSADC_PWR_PSTS1_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_PWR, field ASB[15] (RW)
 *
 * This bit selects auto-standby mode. PWR[ASB] is ignored if PWR[APD] is 1.
 * When the ADC is idle, auto-standby mode selects the standby clock as the ADC
 * clock source and puts the converters into standby mode. At the start of any scan,
 * the conversion clock is selected as the ADC clock and then a delay of
 * (PWR[PUDELAY] x32) ADC clock cycles and one ADC dummy conversion or the calibration
 * cycle is imposed for ADC levels to stabilize. After this delay, the ADC will
 * initiate the scan. When the ADC returns to the idle state, the standby clock is
 * again selected and the converters revert to the standby state. In usual
 * applications the PWR[ASB] is set prior to clearing PWR[PD1/0]. Otherwise the high
 * speed conversion clock is used in the power-up delay counting before going to
 * standby idle state.
 *
 * Values:
 * - 0b0 - Auto standby mode disabled
 * - 0b1 - Auto standby mode enabled
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR_ASB field. */
#define HSADC_RD_PWR_ASB(base) ((HSADC_PWR_REG(base) & HSADC_PWR_ASB_MASK) >> HSADC_PWR_ASB_SHIFT)
#define HSADC_BRD_PWR_ASB(base) (BME_UBFX16(&HSADC_PWR_REG(base), HSADC_PWR_ASB_SHIFT, HSADC_PWR_ASB_WIDTH))

/*! @brief Set the ASB field to a new value. */
#define HSADC_WR_PWR_ASB(base, value) (HSADC_RMW_PWR(base, HSADC_PWR_ASB_MASK, HSADC_PWR_ASB(value)))
#define HSADC_BWR_PWR_ASB(base, value) (BME_BFI16(&HSADC_PWR_REG(base), ((uint16_t)(value) << HSADC_PWR_ASB_SHIFT), HSADC_PWR_ASB_SHIFT, HSADC_PWR_ASB_WIDTH))
/*@}*/

