pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * HSADC_SCTRL - ADC Scan Control Register
 ******************************************************************************/

/*!
 * @brief HSADC_SCTRL - ADC Scan Control Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is an extension to the CLIST1-4 registers, providing the
 * ability to pause and await a new sync while processing samples programmed in the
 * CLIST*[SAMPLE0-SAMPLE15] fields. These 16 control bits are used to determine
 * whether a sample in a scan occurs immediately or if the sample waits for an
 * enabled sync input to occur. The sync input must occur after the conversion of the
 * current sample completes. During sequential mode scans, the SCTRL[SC] bits are
 * used in order from SC0 to SC15. During simultaneous parallel scan modes, the
 * bits are used in order from SC0 to SC3 and SC8-SC11. In non-simultaneous
 * parallel scans, ADCA uses the bits in order from SC0 to SC3 followed by SC8 to SC11.
 * ADCB will use bits SC4 to SC7 followed by SC12 to SC15 in non-simultaneous
 * parallel scans. When setting SCTRL[SC0], don't set CTRL1[START0] or
 * CTRL2[START1]. Just clear CTRL1[STOP0] or CTRL2[STOP1] and the first enabled sync input
 * will start the scan. Setting SC0 delays sample 0 until a sync pulse occurs.
 * Setting SC1 delays sample 1 until a sync pulse occurs after completing sample 0.
 */
/*!
 * @name Constants and macros for entire HSADC_SCTRL register
 */
/*@{*/
#define HSADC_RD_SCTRL(base)     (HSADC_SCTRL_REG(base))
#define HSADC_WR_SCTRL(base, value) (HSADC_SCTRL_REG(base) = (value))
#define HSADC_RMW_SCTRL(base, mask, value) (HSADC_WR_SCTRL(base, (HSADC_RD_SCTRL(base) & ~(mask)) | (value)))
#define HSADC_SET_SCTRL(base, value) (BME_OR16(&HSADC_SCTRL_REG(base), (uint16_t)(value)))
#define HSADC_CLR_SCTRL(base, value) (BME_AND16(&HSADC_SCTRL_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_SCTRL(base, value) (BME_XOR16(&HSADC_SCTRL_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * HSADC_PWR2 - ADC Power Control Register
 ******************************************************************************/

/*!
 * @brief HSADC_PWR2 - ADC Power Control Register (RW)
 *
 * Reset value: 0x0400U
 */
/*!
 * @name Constants and macros for entire HSADC_PWR2 register
 */
/*@{*/
#define HSADC_RD_PWR2(base)      (HSADC_PWR2_REG(base))
#define HSADC_WR_PWR2(base, value) (HSADC_PWR2_REG(base) = (value))
#define HSADC_RMW_PWR2(base, mask, value) (HSADC_WR_PWR2(base, (HSADC_RD_PWR2(base) & ~(mask)) | (value)))
#define HSADC_SET_PWR2(base, value) (BME_OR16(&HSADC_PWR2_REG(base), (uint16_t)(value)))
#define HSADC_CLR_PWR2(base, value) (BME_AND16(&HSADC_PWR2_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_PWR2(base, value) (BME_XOR16(&HSADC_PWR2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_PWR2 bitfields
 */

/*!
 * @name Register HSADC_PWR2, field DIV1[13:8] (RW)
 *
 * The divider circuit operates in the same manner as the CTRL2[DIV0] field but
 * is used to generate the clock used by ADCB during parallel non-simultaneous
 * scan modes.
 */
/*@{*/
/*! @brief Read current value of the HSADC_PWR2_DIV1 field. */
#define HSADC_RD_PWR2_DIV1(base) ((HSADC_PWR2_REG(base) & HSADC_PWR2_DIV1_MASK) >> HSADC_PWR2_DIV1_SHIFT)
#define HSADC_BRD_PWR2_DIV1(base) (BME_UBFX16(&HSADC_PWR2_REG(base), HSADC_PWR2_DIV1_SHIFT, HSADC_PWR2_DIV1_WIDTH))

/*! @brief Set the DIV1 field to a new value. */
#define HSADC_WR_PWR2_DIV1(base, value) (HSADC_RMW_PWR2(base, HSADC_PWR2_DIV1_MASK, HSADC_PWR2_DIV1(value)))
#define HSADC_BWR_PWR2_DIV1(base, value) (BME_BFI16(&HSADC_PWR2_REG(base), ((uint16_t)(value) << HSADC_PWR2_DIV1_SHIFT), HSADC_PWR2_DIV1_SHIFT, HSADC_PWR2_DIV1_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_CTRL3 - ADC Control Register 3
 ******************************************************************************/

/*!
 * @brief HSADC_CTRL3 - ADC Control Register 3 (RW)
 *
 * Reset value: 0x0300U
 */
/*!
 * @name Constants and macros for entire HSADC_CTRL3 register
 */
/*@{*/
#define HSADC_RD_CTRL3(base)     (HSADC_CTRL3_REG(base))
#define HSADC_WR_CTRL3(base, value) (HSADC_CTRL3_REG(base) = (value))
#define HSADC_RMW_CTRL3(base, mask, value) (HSADC_WR_CTRL3(base, (HSADC_RD_CTRL3(base) & ~(mask)) | (value)))
#define HSADC_SET_CTRL3(base, value) (BME_OR16(&HSADC_CTRL3_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CTRL3(base, value) (BME_AND16(&HSADC_CTRL3_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CTRL3(base, value) (BME_XOR16(&HSADC_CTRL3_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CTRL3 bitfields
 */

/*!
 * @name Register HSADC_CTRL3, field DMASRC[6] (RW)
 *
 * During sequential and simultaneous parallel scan modes CTRL3[DMASRC] selects
 * between EOSI0 and RDY bits as the DMA source. During non-simultaneous parallel
 * scan mode CTRL3[DMASRC] selects between EOSI0/EOSI1 for converters A and B,
 * and the RDY bits as the DMA source.
 *
 * Values:
 * - 0b0 - DMA trigger source is end of scan interrupt
 * - 0b1 - DMA trigger source is RDY bits
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL3_DMASRC field. */
#define HSADC_RD_CTRL3_DMASRC(base) ((HSADC_CTRL3_REG(base) & HSADC_CTRL3_DMASRC_MASK) >> HSADC_CTRL3_DMASRC_SHIFT)
#define HSADC_BRD_CTRL3_DMASRC(base) (BME_UBFX16(&HSADC_CTRL3_REG(base), HSADC_CTRL3_DMASRC_SHIFT, HSADC_CTRL3_DMASRC_WIDTH))

/*! @brief Set the DMASRC field to a new value. */
#define HSADC_WR_CTRL3_DMASRC(base, value) (HSADC_RMW_CTRL3(base, HSADC_CTRL3_DMASRC_MASK, HSADC_CTRL3_DMASRC(value)))
#define HSADC_BWR_CTRL3_DMASRC(base, value) (BME_BFI16(&HSADC_CTRL3_REG(base), ((uint16_t)(value) << HSADC_CTRL3_DMASRC_SHIFT), HSADC_CTRL3_DMASRC_SHIFT, HSADC_CTRL3_DMASRC_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CTRL3, field ADCRES[9:8] (RW)
 *
 * Selects the ADC A and B conversion result resolution.
 *
 * Values:
 * - 0b00 - 6-bit mode
 * - 0b01 - 8-bit mode
 * - 0b10 - 10-bit mode
 * - 0b11 - 12-bit mode
 */
/*@{*/
/*! @brief Read current value of the HSADC_CTRL3_ADCRES field. */
#define HSADC_RD_CTRL3_ADCRES(base) ((HSADC_CTRL3_REG(base) & HSADC_CTRL3_ADCRES_MASK) >> HSADC_CTRL3_ADCRES_SHIFT)
#define HSADC_BRD_CTRL3_ADCRES(base) (BME_UBFX16(&HSADC_CTRL3_REG(base), HSADC_CTRL3_ADCRES_SHIFT, HSADC_CTRL3_ADCRES_WIDTH))

/*! @brief Set the ADCRES field to a new value. */
#define HSADC_WR_CTRL3_ADCRES(base, value) (HSADC_RMW_CTRL3(base, HSADC_CTRL3_ADCRES_MASK, HSADC_CTRL3_ADCRES(value)))
#define HSADC_BWR_CTRL3_ADCRES(base, value) (BME_BFI16(&HSADC_CTRL3_REG(base), ((uint16_t)(value) << HSADC_CTRL3_ADCRES_SHIFT), HSADC_CTRL3_ADCRES_SHIFT, HSADC_CTRL3_ADCRES_WIDTH))
/*@}*/

