pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * HSADC_SCHLTEN - ADC Scan Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief HSADC_SCHLTEN - ADC Scan Interrupt Enable Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is used with the ready register (RDY) to select the samples
 * that will generate a scan interrupt.
 */
/*!
 * @name Constants and macros for entire HSADC_SCHLTEN register
 */
/*@{*/
#define HSADC_RD_SCHLTEN(base)   (HSADC_SCHLTEN_REG(base))
#define HSADC_WR_SCHLTEN(base, value) (HSADC_SCHLTEN_REG(base) = (value))
#define HSADC_RMW_SCHLTEN(base, mask, value) (HSADC_WR_SCHLTEN(base, (HSADC_RD_SCHLTEN(base) & ~(mask)) | (value)))
#define HSADC_SET_SCHLTEN(base, value) (BME_OR16(&HSADC_SCHLTEN_REG(base), (uint16_t)(value)))
#define HSADC_CLR_SCHLTEN(base, value) (BME_AND16(&HSADC_SCHLTEN_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_SCHLTEN(base, value) (BME_XOR16(&HSADC_SCHLTEN_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * HSADC_SAMPTIM - ADC Sampling Time Configuration Register
 ******************************************************************************/

/*!
 * @brief HSADC_SAMPTIM - ADC Sampling Time Configuration Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is used to configure the required sampling time for ADCA and
 * ADCB.
 */
/*!
 * @name Constants and macros for entire HSADC_SAMPTIM register
 */
/*@{*/
#define HSADC_RD_SAMPTIM(base)   (HSADC_SAMPTIM_REG(base))
#define HSADC_WR_SAMPTIM(base, value) (HSADC_SAMPTIM_REG(base) = (value))
#define HSADC_RMW_SAMPTIM(base, mask, value) (HSADC_WR_SAMPTIM(base, (HSADC_RD_SAMPTIM(base) & ~(mask)) | (value)))
#define HSADC_SET_SAMPTIM(base, value) (BME_OR16(&HSADC_SAMPTIM_REG(base), (uint16_t)(value)))
#define HSADC_CLR_SAMPTIM(base, value) (BME_AND16(&HSADC_SAMPTIM_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_SAMPTIM(base, value) (BME_XOR16(&HSADC_SAMPTIM_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_SAMPTIM bitfields
 */

/*!
 * @name Register HSADC_SAMPTIM, field SAMPT_A[7:0] (RW)
 *
 * This field is used to configure the sampling time for ADC A. The sampling
 * time is related to the ADC A clock period (TclkA). The resultant sampling time is
 * (1.5 + SAMPT_A) x TclkA.
 */
/*@{*/
/*! @brief Read current value of the HSADC_SAMPTIM_SAMPT_A field. */
#define HSADC_RD_SAMPTIM_SAMPT_A(base) ((HSADC_SAMPTIM_REG(base) & HSADC_SAMPTIM_SAMPT_A_MASK) >> HSADC_SAMPTIM_SAMPT_A_SHIFT)
#define HSADC_BRD_SAMPTIM_SAMPT_A(base) (BME_UBFX16(&HSADC_SAMPTIM_REG(base), HSADC_SAMPTIM_SAMPT_A_SHIFT, HSADC_SAMPTIM_SAMPT_A_WIDTH))

/*! @brief Set the SAMPT_A field to a new value. */
#define HSADC_WR_SAMPTIM_SAMPT_A(base, value) (HSADC_RMW_SAMPTIM(base, HSADC_SAMPTIM_SAMPT_A_MASK, HSADC_SAMPTIM_SAMPT_A(value)))
#define HSADC_BWR_SAMPTIM_SAMPT_A(base, value) (BME_BFI16(&HSADC_SAMPTIM_REG(base), ((uint16_t)(value) << HSADC_SAMPTIM_SAMPT_A_SHIFT), HSADC_SAMPTIM_SAMPT_A_SHIFT, HSADC_SAMPTIM_SAMPT_A_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_SAMPTIM, field SAMPT_B[15:8] (RW)
 *
 * This field is used to configure the sampling time for ADC B. The sampling
 * time is related to the ADC B clock period (TclkB). The resultant sampling time is
 * (1.5 + SAMPT_B) x TclkB. OBS: In sequential or parallel simultaneous mode the
 * effective value is SAMPT_A.
 */
/*@{*/
/*! @brief Read current value of the HSADC_SAMPTIM_SAMPT_B field. */
#define HSADC_RD_SAMPTIM_SAMPT_B(base) ((HSADC_SAMPTIM_REG(base) & HSADC_SAMPTIM_SAMPT_B_MASK) >> HSADC_SAMPTIM_SAMPT_B_SHIFT)
#define HSADC_BRD_SAMPTIM_SAMPT_B(base) (BME_UBFX16(&HSADC_SAMPTIM_REG(base), HSADC_SAMPTIM_SAMPT_B_SHIFT, HSADC_SAMPTIM_SAMPT_B_WIDTH))

/*! @brief Set the SAMPT_B field to a new value. */
#define HSADC_WR_SAMPTIM_SAMPT_B(base, value) (HSADC_RMW_SAMPTIM(base, HSADC_SAMPTIM_SAMPT_B_MASK, HSADC_SAMPTIM_SAMPT_B(value)))
#define HSADC_BWR_SAMPTIM_SAMPT_B(base, value) (BME_BFI16(&HSADC_SAMPTIM_REG(base), ((uint16_t)(value) << HSADC_SAMPTIM_SAMPT_B_SHIFT), HSADC_SAMPTIM_SAMPT_B_SHIFT, HSADC_SAMPTIM_SAMPT_B_WIDTH))
/*@}*/

/*******************************************************************************
 * HSADC_CALIB - ADCs Calibration Configuration
 ******************************************************************************/

/*!
 * @brief HSADC_CALIB - ADCs Calibration Configuration (RW)
 *
 * Reset value: 0x0000U
 *
 * This register controls the request of calibration for ADC A and B. The values
 * obtained from this ADC internal calibration process are used in the ADCs
 * calibration sub-block.
 */
/*!
 * @name Constants and macros for entire HSADC_CALIB register
 */
/*@{*/
#define HSADC_RD_CALIB(base)     (HSADC_CALIB_REG(base))
#define HSADC_WR_CALIB(base, value) (HSADC_CALIB_REG(base) = (value))
#define HSADC_RMW_CALIB(base, mask, value) (HSADC_WR_CALIB(base, (HSADC_RD_CALIB(base) & ~(mask)) | (value)))
#define HSADC_SET_CALIB(base, value) (BME_OR16(&HSADC_CALIB_REG(base), (uint16_t)(value)))
#define HSADC_CLR_CALIB(base, value) (BME_AND16(&HSADC_CALIB_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_CALIB(base, value) (BME_XOR16(&HSADC_CALIB_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_CALIB bitfields
 */

/*!
 * @name Register HSADC_CALIB, field REQSINGA[0] (RW)
 *
 * This bit is used to request to ADC A to run automatically the conversions to
 * obtain the calibration value for single ended analog input mode. This
 * calibration value is used by the ADC A for each single-ended input conversion.
 *
 * Values:
 * - 0b0 - Calibration value calculation is not requested to be run on ADC A.
 * - 0b1 - Calibration value calculation for single-ended input mode is
 *     requested to be run on ADC A.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALIB_REQSINGA field. */
#define HSADC_RD_CALIB_REQSINGA(base) ((HSADC_CALIB_REG(base) & HSADC_CALIB_REQSINGA_MASK) >> HSADC_CALIB_REQSINGA_SHIFT)
#define HSADC_BRD_CALIB_REQSINGA(base) (BME_UBFX16(&HSADC_CALIB_REG(base), HSADC_CALIB_REQSINGA_SHIFT, HSADC_CALIB_REQSINGA_WIDTH))

/*! @brief Set the REQSINGA field to a new value. */
#define HSADC_WR_CALIB_REQSINGA(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_REQSINGA_MASK, HSADC_CALIB_REQSINGA(value)))
#define HSADC_BWR_CALIB_REQSINGA(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_REQSINGA_SHIFT), HSADC_CALIB_REQSINGA_SHIFT, HSADC_CALIB_REQSINGA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field REQDIFA[1] (RW)
 *
 * This bit is used to request to ADC A to run automatically the conversions to
 * obtain the calibration value for differential analog input mode. This
 * calibration factor is used by the ADC A for each differential conversion.
 *
 * Values:
 * - 0b0 - Calibration value calculation is not requested to ADC A.
 * - 0b1 - Calibration value calculation for differential input mode is
 *     requested to be run on ADC A.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALIB_REQDIFA field. */
#define HSADC_RD_CALIB_REQDIFA(base) ((HSADC_CALIB_REG(base) & HSADC_CALIB_REQDIFA_MASK) >> HSADC_CALIB_REQDIFA_SHIFT)
#define HSADC_BRD_CALIB_REQDIFA(base) (BME_UBFX16(&HSADC_CALIB_REG(base), HSADC_CALIB_REQDIFA_SHIFT, HSADC_CALIB_REQDIFA_WIDTH))

/*! @brief Set the REQDIFA field to a new value. */
#define HSADC_WR_CALIB_REQDIFA(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_REQDIFA_MASK, HSADC_CALIB_REQDIFA(value)))
#define HSADC_BWR_CALIB_REQDIFA(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_REQDIFA_SHIFT), HSADC_CALIB_REQDIFA_SHIFT, HSADC_CALIB_REQDIFA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field BYPA[2] (RW)
 *
 * This bit field is used to bypass the calibration sum operation on ADC A.
 *
 * Values:
 * - 0b0 - ADC A block uses the calibration values to obtain the final
 *     conversion result (differential or single-ended mode)
 * - 0b1 - Calibration operation is bypassed on ADC A.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALIB_BYPA field. */
#define HSADC_RD_CALIB_BYPA(base) ((HSADC_CALIB_REG(base) & HSADC_CALIB_BYPA_MASK) >> HSADC_CALIB_BYPA_SHIFT)
#define HSADC_BRD_CALIB_BYPA(base) (BME_UBFX16(&HSADC_CALIB_REG(base), HSADC_CALIB_BYPA_SHIFT, HSADC_CALIB_BYPA_WIDTH))

