pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the BYPA field to a new value. */
#define HSADC_WR_CALIB_BYPA(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_BYPA_MASK, HSADC_CALIB_BYPA(value)))
#define HSADC_BWR_CALIB_BYPA(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_BYPA_SHIFT), HSADC_CALIB_BYPA_SHIFT, HSADC_CALIB_BYPA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field CAL_REQA[3] (WORZ)
 *
 * This calibration request is recognized at the end of a scan. It is
 * recommended to disable the scan start trigger when this calibration starts, otherwise a
 * delay can occur to start the next scan. This request is automatically cleared
 * when the calibration is started. The calibrations to be done are indicated by
 * bit fields ADC_CALIB[REQSINGA] and ADC_CALIB[REQDIFFA].
 *
 * Values:
 * - 0b0 - None.
 * - 0b1 - Calibration request for ADC A.
 */
/*@{*/
/*! @brief Set the CAL_REQA field to a new value. */
#define HSADC_WR_CALIB_CAL_REQA(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_CAL_REQA_MASK, HSADC_CALIB_CAL_REQA(value)))
#define HSADC_BWR_CALIB_CAL_REQA(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_CAL_REQA_SHIFT), HSADC_CALIB_CAL_REQA_SHIFT, HSADC_CALIB_CAL_REQA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field REQSINGB[4] (RW)
 *
 * This bit is used to request to ADC B to run automatically the conversions to
 * obtain the calibration value for single-ended analog input mode. This
 * calibration factor is used by the ADC B for each single-ended input conversion.
 *
 * Values:
 * - 0b0 - Calibration value calculation is not requested to be run on ADC B.
 * - 0b1 - Calibration value calculation for single-ended input mode is
 *     requested to be run on ADC B.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALIB_REQSINGB field. */
#define HSADC_RD_CALIB_REQSINGB(base) ((HSADC_CALIB_REG(base) & HSADC_CALIB_REQSINGB_MASK) >> HSADC_CALIB_REQSINGB_SHIFT)
#define HSADC_BRD_CALIB_REQSINGB(base) (BME_UBFX16(&HSADC_CALIB_REG(base), HSADC_CALIB_REQSINGB_SHIFT, HSADC_CALIB_REQSINGB_WIDTH))

/*! @brief Set the REQSINGB field to a new value. */
#define HSADC_WR_CALIB_REQSINGB(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_REQSINGB_MASK, HSADC_CALIB_REQSINGB(value)))
#define HSADC_BWR_CALIB_REQSINGB(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_REQSINGB_SHIFT), HSADC_CALIB_REQSINGB_SHIFT, HSADC_CALIB_REQSINGB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field REQDIFB[5] (RW)
 *
 * This bit is used to request to ADC B to run automatically the conversions to
 * obtain the calibration value for differential analog input mode. This
 * calibration factor is used by the ADC B for each differential conversion.
 *
 * Values:
 * - 0b0 - Calibration value calculation is not requested to be run on ADC B.
 * - 0b1 - Calibration value calculation for differential input mode is
 *     requested to be run onr ADC B
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALIB_REQDIFB field. */
#define HSADC_RD_CALIB_REQDIFB(base) ((HSADC_CALIB_REG(base) & HSADC_CALIB_REQDIFB_MASK) >> HSADC_CALIB_REQDIFB_SHIFT)
#define HSADC_BRD_CALIB_REQDIFB(base) (BME_UBFX16(&HSADC_CALIB_REG(base), HSADC_CALIB_REQDIFB_SHIFT, HSADC_CALIB_REQDIFB_WIDTH))

/*! @brief Set the REQDIFB field to a new value. */
#define HSADC_WR_CALIB_REQDIFB(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_REQDIFB_MASK, HSADC_CALIB_REQDIFB(value)))
#define HSADC_BWR_CALIB_REQDIFB(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_REQDIFB_SHIFT), HSADC_CALIB_REQDIFB_SHIFT, HSADC_CALIB_REQDIFB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field BYPB[6] (RW)
 *
 * This bit field is used to bypass the calibration sum operation on ADC B.
 *
 * Values:
 * - 0b0 - ADC B block uses the calibration values to obtain the final
 *     conversion result (differential or single-ended mode)
 * - 0b1 - Calibration operation is bypassed on ADC B.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALIB_BYPB field. */
#define HSADC_RD_CALIB_BYPB(base) ((HSADC_CALIB_REG(base) & HSADC_CALIB_BYPB_MASK) >> HSADC_CALIB_BYPB_SHIFT)
#define HSADC_BRD_CALIB_BYPB(base) (BME_UBFX16(&HSADC_CALIB_REG(base), HSADC_CALIB_BYPB_SHIFT, HSADC_CALIB_BYPB_WIDTH))

/*! @brief Set the BYPB field to a new value. */
#define HSADC_WR_CALIB_BYPB(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_BYPB_MASK, HSADC_CALIB_BYPB(value)))
#define HSADC_BWR_CALIB_BYPB(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_BYPB_SHIFT), HSADC_CALIB_BYPB_SHIFT, HSADC_CALIB_BYPB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field CAL_REQB[7] (WORZ)
 *
 * This calibration request is recognized at the end of a scan. It is
 * recommended to disable the scan start trigger when this calibration starts, otherwise a
 * delay can occur to start the next scan. This request is automatically cleared
 * when the calibration is started. The calibrations to be done are indicated by
 * bit fields ADC_CALIB[REQSINGB] and ADC_CALIB[REQDIFFB]. However in
 * simultaneous mode of operation (sequential mode or parallel and simultaneous operation)
 * the ADC B uses the configuration for ADC A.
 *
 * Values:
 * - 0b0 - Calibration is not requested.
 * - 0b1 - Calibration is requested for ADC B.
 */
/*@{*/
/*! @brief Set the CAL_REQB field to a new value. */
#define HSADC_WR_CALIB_CAL_REQB(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_CAL_REQB_MASK, HSADC_CALIB_CAL_REQB(value)))
#define HSADC_BWR_CALIB_CAL_REQB(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_CAL_REQB_SHIFT), HSADC_CALIB_CAL_REQB_SHIFT, HSADC_CALIB_CAL_REQB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field EOCALIEA[8] (RW)
 *
 * This bit enables an EOCALIA interrupt to be generated when the requested
 * calibrations for ADC A are finished.
 *
 * Values:
 * - 0b0 - Interrupt is not enabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALIB_EOCALIEA field. */
#define HSADC_RD_CALIB_EOCALIEA(base) ((HSADC_CALIB_REG(base) & HSADC_CALIB_EOCALIEA_MASK) >> HSADC_CALIB_EOCALIEA_SHIFT)
#define HSADC_BRD_CALIB_EOCALIEA(base) (BME_UBFX16(&HSADC_CALIB_REG(base), HSADC_CALIB_EOCALIEA_SHIFT, HSADC_CALIB_EOCALIEA_WIDTH))

/*! @brief Set the EOCALIEA field to a new value. */
#define HSADC_WR_CALIB_EOCALIEA(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_EOCALIEA_MASK, HSADC_CALIB_EOCALIEA(value)))
#define HSADC_BWR_CALIB_EOCALIEA(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_EOCALIEA_SHIFT), HSADC_CALIB_EOCALIEA_SHIFT, HSADC_CALIB_EOCALIEA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_CALIB, field EOCALIEB[9] (RW)
 *
 * This bit enables an EOCALIB interrupt to be generated when the requested
 * calibrations for ADC B are finished.
 *
 * Values:
 * - 0b0 - Interrupt is not enabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the HSADC_CALIB_EOCALIEB field. */
#define HSADC_RD_CALIB_EOCALIEB(base) ((HSADC_CALIB_REG(base) & HSADC_CALIB_EOCALIEB_MASK) >> HSADC_CALIB_EOCALIEB_SHIFT)
#define HSADC_BRD_CALIB_EOCALIEB(base) (BME_UBFX16(&HSADC_CALIB_REG(base), HSADC_CALIB_EOCALIEB_SHIFT, HSADC_CALIB_EOCALIEB_WIDTH))

/*! @brief Set the EOCALIEB field to a new value. */
#define HSADC_WR_CALIB_EOCALIEB(base, value) (HSADC_RMW_CALIB(base, HSADC_CALIB_EOCALIEB_MASK, HSADC_CALIB_EOCALIEB(value)))
#define HSADC_BWR_CALIB_EOCALIEB(base, value) (BME_BFI16(&HSADC_CALIB_REG(base), ((uint16_t)(value) << HSADC_CALIB_EOCALIEB_SHIFT), HSADC_CALIB_EOCALIEB_SHIFT, HSADC_CALIB_EOCALIEB_WIDTH))
/*@}*/

