pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * HSADC_MUX67_SEL - MUX6_7 Selection Controls Register
 ******************************************************************************/

/*!
 * @brief HSADC_MUX67_SEL - MUX6_7 Selection Controls Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register controls the MUXes for analog inputs CH6 and CH7 on ADC A and
 * ADC B. They are used together with SAMPLEx, CHNCFG_L and CHNCFG_H. Please see
 * Input Multiplex Function for more details.
 */
/*!
 * @name Constants and macros for entire HSADC_MUX67_SEL register
 */
/*@{*/
#define HSADC_RD_MUX67_SEL(base) (HSADC_MUX67_SEL_REG(base))
#define HSADC_WR_MUX67_SEL(base, value) (HSADC_MUX67_SEL_REG(base) = (value))
#define HSADC_RMW_MUX67_SEL(base, mask, value) (HSADC_WR_MUX67_SEL(base, (HSADC_RD_MUX67_SEL(base) & ~(mask)) | (value)))
#define HSADC_SET_MUX67_SEL(base, value) (BME_OR16(&HSADC_MUX67_SEL_REG(base), (uint16_t)(value)))
#define HSADC_CLR_MUX67_SEL(base, value) (BME_AND16(&HSADC_MUX67_SEL_REG(base), (uint16_t)(~(value))))
#define HSADC_TOG_MUX67_SEL(base, value) (BME_XOR16(&HSADC_MUX67_SEL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual HSADC_MUX67_SEL bitfields
 */

/*!
 * @name Register HSADC_MUX67_SEL, field CH6_SELA[2:0] (RW)
 *
 * This bit field is used to control the 8-1 MUX to select an input to the ADC A
 * when using SAMPLEx = 6. The signals connected to the inputs 0~7 of the MUX is
 * defined in the SoC.
 */
/*@{*/
/*! @brief Read current value of the HSADC_MUX67_SEL_CH6_SELA field. */
#define HSADC_RD_MUX67_SEL_CH6_SELA(base) ((HSADC_MUX67_SEL_REG(base) & HSADC_MUX67_SEL_CH6_SELA_MASK) >> HSADC_MUX67_SEL_CH6_SELA_SHIFT)
#define HSADC_BRD_MUX67_SEL_CH6_SELA(base) (BME_UBFX16(&HSADC_MUX67_SEL_REG(base), HSADC_MUX67_SEL_CH6_SELA_SHIFT, HSADC_MUX67_SEL_CH6_SELA_WIDTH))

/*! @brief Set the CH6_SELA field to a new value. */
#define HSADC_WR_MUX67_SEL_CH6_SELA(base, value) (HSADC_RMW_MUX67_SEL(base, HSADC_MUX67_SEL_CH6_SELA_MASK, HSADC_MUX67_SEL_CH6_SELA(value)))
#define HSADC_BWR_MUX67_SEL_CH6_SELA(base, value) (BME_BFI16(&HSADC_MUX67_SEL_REG(base), ((uint16_t)(value) << HSADC_MUX67_SEL_CH6_SELA_SHIFT), HSADC_MUX67_SEL_CH6_SELA_SHIFT, HSADC_MUX67_SEL_CH6_SELA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_MUX67_SEL, field CH7_SELA[6:4] (RW)
 *
 * This bit field is used to control the 8-1 MUX to select an input to the ADC A
 * when using SAMPLEx = 7. The signals connected to the inputs 0~7 of the MUX is
 * defined in the SoC.
 */
/*@{*/
/*! @brief Read current value of the HSADC_MUX67_SEL_CH7_SELA field. */
#define HSADC_RD_MUX67_SEL_CH7_SELA(base) ((HSADC_MUX67_SEL_REG(base) & HSADC_MUX67_SEL_CH7_SELA_MASK) >> HSADC_MUX67_SEL_CH7_SELA_SHIFT)
#define HSADC_BRD_MUX67_SEL_CH7_SELA(base) (BME_UBFX16(&HSADC_MUX67_SEL_REG(base), HSADC_MUX67_SEL_CH7_SELA_SHIFT, HSADC_MUX67_SEL_CH7_SELA_WIDTH))

/*! @brief Set the CH7_SELA field to a new value. */
#define HSADC_WR_MUX67_SEL_CH7_SELA(base, value) (HSADC_RMW_MUX67_SEL(base, HSADC_MUX67_SEL_CH7_SELA_MASK, HSADC_MUX67_SEL_CH7_SELA(value)))
#define HSADC_BWR_MUX67_SEL_CH7_SELA(base, value) (BME_BFI16(&HSADC_MUX67_SEL_REG(base), ((uint16_t)(value) << HSADC_MUX67_SEL_CH7_SELA_SHIFT), HSADC_MUX67_SEL_CH7_SELA_SHIFT, HSADC_MUX67_SEL_CH7_SELA_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_MUX67_SEL, field CH6_SELB[10:8] (RW)
 *
 * This bit field is used to control the 8-1 MUX to select an input to the ADC B
 * when using SAMPLEx = 14 (4'b1110). The signals connected to the inputs 0~7 of
 * the MUX is defined in the SoC
 */
/*@{*/
/*! @brief Read current value of the HSADC_MUX67_SEL_CH6_SELB field. */
#define HSADC_RD_MUX67_SEL_CH6_SELB(base) ((HSADC_MUX67_SEL_REG(base) & HSADC_MUX67_SEL_CH6_SELB_MASK) >> HSADC_MUX67_SEL_CH6_SELB_SHIFT)
#define HSADC_BRD_MUX67_SEL_CH6_SELB(base) (BME_UBFX16(&HSADC_MUX67_SEL_REG(base), HSADC_MUX67_SEL_CH6_SELB_SHIFT, HSADC_MUX67_SEL_CH6_SELB_WIDTH))

/*! @brief Set the CH6_SELB field to a new value. */
#define HSADC_WR_MUX67_SEL_CH6_SELB(base, value) (HSADC_RMW_MUX67_SEL(base, HSADC_MUX67_SEL_CH6_SELB_MASK, HSADC_MUX67_SEL_CH6_SELB(value)))
#define HSADC_BWR_MUX67_SEL_CH6_SELB(base, value) (BME_BFI16(&HSADC_MUX67_SEL_REG(base), ((uint16_t)(value) << HSADC_MUX67_SEL_CH6_SELB_SHIFT), HSADC_MUX67_SEL_CH6_SELB_SHIFT, HSADC_MUX67_SEL_CH6_SELB_WIDTH))
/*@}*/

/*!
 * @name Register HSADC_MUX67_SEL, field CH7_SELB[14:12] (RW)
 *
 * This bit field is used to control the 8-1 MUX to select an input to the ADC B
 * when using SAMPLEx = 15 (4'b1111). The signals connected to the inputs 0~7 of
 * the MUX is defined in the SoC
 */
/*@{*/
/*! @brief Read current value of the HSADC_MUX67_SEL_CH7_SELB field. */
#define HSADC_RD_MUX67_SEL_CH7_SELB(base) ((HSADC_MUX67_SEL_REG(base) & HSADC_MUX67_SEL_CH7_SELB_MASK) >> HSADC_MUX67_SEL_CH7_SELB_SHIFT)
#define HSADC_BRD_MUX67_SEL_CH7_SELB(base) (BME_UBFX16(&HSADC_MUX67_SEL_REG(base), HSADC_MUX67_SEL_CH7_SELB_SHIFT, HSADC_MUX67_SEL_CH7_SELB_WIDTH))

/*! @brief Set the CH7_SELB field to a new value. */
#define HSADC_WR_MUX67_SEL_CH7_SELB(base, value) (HSADC_RMW_MUX67_SEL(base, HSADC_MUX67_SEL_CH7_SELB_MASK, HSADC_MUX67_SEL_CH7_SELB(value)))
#define HSADC_BWR_MUX67_SEL_CH7_SELB(base, value) (BME_BFI16(&HSADC_MUX67_SEL_REG(base), ((uint16_t)(value) << HSADC_MUX67_SEL_CH7_SELB_SHIFT), HSADC_MUX67_SEL_CH7_SELB_SHIFT, HSADC_MUX67_SEL_CH7_SELB_WIDTH))
/*@}*/

/*
 * MKV58F22 I2C
 *
 * Inter-Integrated Circuit
 *
 * Registers defined in this header file:
 * - I2C_A1 - I2C Address Register 1
 * - I2C_F - I2C Frequency Divider register
 * - I2C_C1 - I2C Control Register 1
 * - I2C_S - I2C Status register
 * - I2C_D - I2C Data I/O register
 * - I2C_C2 - I2C Control Register 2
 * - I2C_FLT - I2C Programmable Input Glitch Filter Register
 * - I2C_RA - I2C Range Address register
 * - I2C_SMB - I2C SMBus Control and Status register
 * - I2C_A2 - I2C Address Register 2
 * - I2C_SLTH - I2C SCL Low Timeout Register High
 * - I2C_SLTL - I2C SCL Low Timeout Register Low
 */

#define I2C_INSTANCE_COUNT (2U) /*!< Number of instances of the I2C module. */
#define I2C0_IDX (0U) /*!< Instance number for I2C0. */
#define I2C1_IDX (1U) /*!< Instance number for I2C1. */

