pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the FILTF field to a new value. */
#define LLWU_WR_FILT3_FILTF(base, value) (LLWU_RMW_FILT3(base, LLWU_FILT3_FILTF_MASK, LLWU_FILT3_FILTF(value)))
#define LLWU_BWR_FILT3_FILTF(base, value) (BME_BFI8(&LLWU_FILT3_REG(base), ((uint8_t)(value) << LLWU_FILT3_FILTF_SHIFT), LLWU_FILT3_FILTF_SHIFT, LLWU_FILT3_FILTF_WIDTH))
/*@}*/

/*******************************************************************************
 * LLWU_FILT4 - LLWU Pin Filter 4 register
 ******************************************************************************/

/*!
 * @brief LLWU_FILT4 - LLWU Pin Filter 4 register (RW)
 *
 * Reset value: 0x00U
 *
 * LLWU_FILT4 is a control and status register that is used to enable/disable
 * the digital filter 4 features for an external pin. This register is reset on
 * Chip Reset not VLLS and by reset types that trigger Chip Reset not VLLS. It is
 * unaffected by reset types that do not trigger Chip Reset not VLLS. See the
 * IntroductionInformation found here describes the registers of the Reset Control
 * Module (RCM). The RCM implements many of the reset functions for the chip. See
 * the chip's reset chapter for more information. details for more information.
 */
/*!
 * @name Constants and macros for entire LLWU_FILT4 register
 */
/*@{*/
#define LLWU_RD_FILT4(base)      (LLWU_FILT4_REG(base))
#define LLWU_WR_FILT4(base, value) (LLWU_FILT4_REG(base) = (value))
#define LLWU_RMW_FILT4(base, mask, value) (LLWU_WR_FILT4(base, (LLWU_RD_FILT4(base) & ~(mask)) | (value)))
#define LLWU_SET_FILT4(base, value) (BME_OR8(&LLWU_FILT4_REG(base), (uint8_t)(value)))
#define LLWU_CLR_FILT4(base, value) (BME_AND8(&LLWU_FILT4_REG(base), (uint8_t)(~(value))))
#define LLWU_TOG_FILT4(base, value) (BME_XOR8(&LLWU_FILT4_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual LLWU_FILT4 bitfields
 */

/*!
 * @name Register LLWU_FILT4, field FILTSEL[4:0] (RW)
 *
 * Selects 1 of the wakeup pins to be muxed into the filter.
 *
 * Values:
 * - 0b00000 - Select LLWU_P0 for filter
 * - 0b11111 - Select LLWU_P31 for filter
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT4_FILTSEL field. */
#define LLWU_RD_FILT4_FILTSEL(base) ((LLWU_FILT4_REG(base) & LLWU_FILT4_FILTSEL_MASK) >> LLWU_FILT4_FILTSEL_SHIFT)
#define LLWU_BRD_FILT4_FILTSEL(base) (BME_UBFX8(&LLWU_FILT4_REG(base), LLWU_FILT4_FILTSEL_SHIFT, LLWU_FILT4_FILTSEL_WIDTH))

/*! @brief Set the FILTSEL field to a new value. */
#define LLWU_WR_FILT4_FILTSEL(base, value) (LLWU_RMW_FILT4(base, (LLWU_FILT4_FILTSEL_MASK | LLWU_FILT4_FILTF_MASK), LLWU_FILT4_FILTSEL(value)))
#define LLWU_BWR_FILT4_FILTSEL(base, value) (BME_BFI8(&LLWU_FILT4_REG(base), ((uint8_t)(value) << LLWU_FILT4_FILTSEL_SHIFT), LLWU_FILT4_FILTSEL_SHIFT, LLWU_FILT4_FILTSEL_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT4, field FILTE[6:5] (RW)
 *
 * Controls the digital filter options for the external pin detect.
 *
 * Values:
 * - 0b00 - Filter disabled
 * - 0b01 - Filter posedge detect enabled
 * - 0b10 - Filter negedge detect enabled
 * - 0b11 - Filter any edge detect enabled
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT4_FILTE field. */
#define LLWU_RD_FILT4_FILTE(base) ((LLWU_FILT4_REG(base) & LLWU_FILT4_FILTE_MASK) >> LLWU_FILT4_FILTE_SHIFT)
#define LLWU_BRD_FILT4_FILTE(base) (BME_UBFX8(&LLWU_FILT4_REG(base), LLWU_FILT4_FILTE_SHIFT, LLWU_FILT4_FILTE_WIDTH))

/*! @brief Set the FILTE field to a new value. */
#define LLWU_WR_FILT4_FILTE(base, value) (LLWU_RMW_FILT4(base, (LLWU_FILT4_FILTE_MASK | LLWU_FILT4_FILTF_MASK), LLWU_FILT4_FILTE(value)))
#define LLWU_BWR_FILT4_FILTE(base, value) (BME_BFI8(&LLWU_FILT4_REG(base), ((uint8_t)(value) << LLWU_FILT4_FILTE_SHIFT), LLWU_FILT4_FILTE_SHIFT, LLWU_FILT4_FILTE_WIDTH))
/*@}*/

/*!
 * @name Register LLWU_FILT4, field FILTF[7] (W1C)
 *
 * Indicates that the filtered external wakeup pin, selected by FILTSEL, was a
 * source of exiting a low-leakage power mode. To clear the flag write a one to
 * FILTF.
 *
 * Values:
 * - 0b0 - Pin Filter 4 was not a wakeup source
 * - 0b1 - Pin Filter 4 was a wakeup source
 */
/*@{*/
/*! @brief Read current value of the LLWU_FILT4_FILTF field. */
#define LLWU_RD_FILT4_FILTF(base) ((LLWU_FILT4_REG(base) & LLWU_FILT4_FILTF_MASK) >> LLWU_FILT4_FILTF_SHIFT)
#define LLWU_BRD_FILT4_FILTF(base) (BME_UBFX8(&LLWU_FILT4_REG(base), LLWU_FILT4_FILTF_SHIFT, LLWU_FILT4_FILTF_WIDTH))

/*! @brief Set the FILTF field to a new value. */
#define LLWU_WR_FILT4_FILTF(base, value) (LLWU_RMW_FILT4(base, LLWU_FILT4_FILTF_MASK, LLWU_FILT4_FILTF(value)))
#define LLWU_BWR_FILT4_FILTF(base, value) (BME_BFI8(&LLWU_FILT4_REG(base), ((uint8_t)(value) << LLWU_FILT4_FILTF_SHIFT), LLWU_FILT4_FILTF_SHIFT, LLWU_FILT4_FILTF_WIDTH))
/*@}*/

/*
 * MKV58F22 LPTMR
 *
 * Low Power Timer
 *
 * Registers defined in this header file:
 * - LPTMR_CSR - Low Power Timer Control Status Register
 * - LPTMR_PSR - Low Power Timer Prescale Register
 * - LPTMR_CMR - Low Power Timer Compare Register
 * - LPTMR_CNR - Low Power Timer Counter Register
 */

#define LPTMR_INSTANCE_COUNT (1U) /*!< Number of instances of the LPTMR module. */
#define LPTMR0_IDX (0U) /*!< Instance number for LPTMR0. */

/*******************************************************************************
 * LPTMR_CSR - Low Power Timer Control Status Register
 ******************************************************************************/

/*!
 * @brief LPTMR_CSR - Low Power Timer Control Status Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire LPTMR_CSR register
 */
/*@{*/
#define LPTMR_RD_CSR(base)       (LPTMR_CSR_REG(base))
#define LPTMR_WR_CSR(base, value) (LPTMR_CSR_REG(base) = (value))
#define LPTMR_RMW_CSR(base, mask, value) (LPTMR_WR_CSR(base, (LPTMR_RD_CSR(base) & ~(mask)) | (value)))
#define LPTMR_SET_CSR(base, value) (BME_OR32(&LPTMR_CSR_REG(base), (uint32_t)(value)))
#define LPTMR_CLR_CSR(base, value) (BME_AND32(&LPTMR_CSR_REG(base), (uint32_t)(~(value))))
#define LPTMR_TOG_CSR(base, value) (BME_XOR32(&LPTMR_CSR_REG(base), (uint32_t)(value)))
/*@}*/

