pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * MKV58F22 MCM
 *
 * Core Platform Miscellaneous Control Module
 *
 * Registers defined in this header file:
 * - MCM_PCT - Processor core type
 * - MCM_CR - Control Register
 * - MCM_ISCR - Interrupt Status and Control Register
 * - MCM_CPO - Compute Only Operation Control Register
 * - MCM_LMEM - Local Memory General Descriptor Register
 */

#define MCM_INSTANCE_COUNT (1U) /*!< Number of instances of the MCM module. */
#define MCM_IDX (0U) /*!< Instance number for MCM. */

/*******************************************************************************
 * MCM_PCT - Processor core type
 ******************************************************************************/

/*!
 * @brief MCM_PCT - Processor core type (RO)
 *
 * Reset value: 0xAC700000U
 *
 * The PCT is a 16-bit read-only register specifying the architecture of the
 * processor core within the platform in the device. The state of this register is
 * defined by a module input signal; it can only be read from the IPS programming
 * model. Any attempted write is ignored.
 */
/*!
 * @name Constants and macros for entire MCM_PCT register
 */
/*@{*/
#define MCM_RD_PCT(base)         (MCM_PCT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MCM_PCT bitfields
 */

/*!
 * @name Register MCM_PCT, field PLREV[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the MCM_PCT_PLREV field. */
#define MCM_RD_PCT_PLREV(base) ((MCM_PCT_REG(base) & MCM_PCT_PLREV_MASK) >> MCM_PCT_PLREV_SHIFT)
#define MCM_BRD_PCT_PLREV(base) (MCM_RD_PCT_PLREV(base))
/*@}*/

/*!
 * @name Register MCM_PCT, field PCT[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the MCM_PCT_PCT field. */
#define MCM_RD_PCT_PCT(base) ((MCM_PCT_REG(base) & MCM_PCT_PCT_MASK) >> MCM_PCT_PCT_SHIFT)
#define MCM_BRD_PCT_PCT(base) (MCM_RD_PCT_PCT(base))
/*@}*/

/*******************************************************************************
 * MCM_CR - Control Register
 ******************************************************************************/

/*!
 * @brief MCM_CR - Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * CR defines the arbitration and protection schemes for the two system RAM
 * arrays.
 */
/*!
 * @name Constants and macros for entire MCM_CR register
 */
/*@{*/
#define MCM_RD_CR(base)          (MCM_CR_REG(base))
#define MCM_WR_CR(base, value)   (MCM_CR_REG(base) = (value))
#define MCM_RMW_CR(base, mask, value) (MCM_WR_CR(base, (MCM_RD_CR(base) & ~(mask)) | (value)))
#define MCM_SET_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) |  (value)))
#define MCM_CLR_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) & ~(value)))
#define MCM_TOG_CR(base, value)  (MCM_WR_CR(base, MCM_RD_CR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_CR bitfields
 */

/*!
 * @name Register MCM_CR, field AHBSPRI[27] (RW)
 *
 * Setting the ARM AHBSCR (Cortex-M7 AHBS Prioritization Control Register)
 * bits[1:0] to x3 enables AHBSPRI to control AHBS priority boost modes. Once the ARM
 * AHBSCR[1:0] has been written to x3, AHBSPRI controls the AHBS Interface
 * priority.
 *
 * Values:
 * - 0b0 - SW accesses take priority over AHBS accesses
 * - 0b1 - AHBS accesses take priority over SW accesses
 */
/*@{*/
/*! @brief Read current value of the MCM_CR_AHBSPRI field. */
#define MCM_RD_CR_AHBSPRI(base) ((MCM_CR_REG(base) & MCM_CR_AHBSPRI_MASK) >> MCM_CR_AHBSPRI_SHIFT)
#define MCM_BRD_CR_AHBSPRI(base) (MCM_RD_CR_AHBSPRI(base))

/*! @brief Set the AHBSPRI field to a new value. */
#define MCM_WR_CR_AHBSPRI(base, value) (MCM_RMW_CR(base, MCM_CR_AHBSPRI_MASK, MCM_CR_AHBSPRI(value)))
#define MCM_BWR_CR_AHBSPRI(base, value) (MCM_WR_CR_AHBSPRI(base, value))
/*@}*/

/*******************************************************************************
 * MCM_ISCR - Interrupt Status and Control Register
 ******************************************************************************/

/*!
 * @brief MCM_ISCR - Interrupt Status and Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The MCM_ISCR register defines the configuration and reports status for a
 * number of core-related interrupt exception conditions. The MCM_ISCR register
 * includes the enable and status bits associated with the core's floating-point
 * exceptions. The individual event indicators are first qualified with their
 * exception enables and then logically summed to form an interrupt request sent to the
 * core's NVIC.Bits 15-8 are read-only indicator flags based on the processor's
 * FPSCR register. Attempted writes to these bits are ignored. Once set, the flags
 * remain asserted until software clears the corresponding FPSCR bit. The
 * MCM_ISCR register also includes the enable and status bits associated with a
 * Cortex-M7 AHBS (slave interface) write fault.
 */
/*!
 * @name Constants and macros for entire MCM_ISCR register
 */
/*@{*/
#define MCM_RD_ISCR(base)        (MCM_ISCR_REG(base))
#define MCM_WR_ISCR(base, value) (MCM_ISCR_REG(base) = (value))
#define MCM_RMW_ISCR(base, mask, value) (MCM_WR_ISCR(base, (MCM_RD_ISCR(base) & ~(mask)) | (value)))
#define MCM_SET_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) |  (value)))
#define MCM_CLR_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) & ~(value)))
#define MCM_TOG_ISCR(base, value) (MCM_WR_ISCR(base, MCM_RD_ISCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_ISCR bitfields
 */

/*!
 * @name Register MCM_ISCR, field WABORTS[5] (W1C)
 *
 * WABORTS is an imprecise write fault from the TCM backdoor (AHBS, that is, AHB
 * Slave Interface). Writing 1 to clear this field also clears
 * ISCR[WABORTS_OVERRUN]. If ISCR[WABORTS_EN] is set to 1, a WABORTS occurrence will generate an
 * MCM interrupt. For more information, see ISCR[WABORTS_EN] and
 * ISCR[WABORTS_OVERRUN].
 *
 * Values:
 * - 0b0 - A WABORTS assertion has not occurred.
 * - 0b1 - A WABORTS assertion has occurred.
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_WABORTS field. */
#define MCM_RD_ISCR_WABORTS(base) ((MCM_ISCR_REG(base) & MCM_ISCR_WABORTS_MASK) >> MCM_ISCR_WABORTS_SHIFT)
#define MCM_BRD_ISCR_WABORTS(base) (MCM_RD_ISCR_WABORTS(base))

/*! @brief Set the WABORTS field to a new value. */
#define MCM_WR_ISCR_WABORTS(base, value) (MCM_RMW_ISCR(base, MCM_ISCR_WABORTS_MASK, MCM_ISCR_WABORTS(value)))
#define MCM_BWR_ISCR_WABORTS(base, value) (MCM_WR_ISCR_WABORTS(base, value))
/*@}*/

/*!
 * @name Register MCM_ISCR, field WABORTS_OVERRUN[6] (RO)
 *
 * WABORTS is an imprecise write fault from the TCM backdoor (AHBS, that is, AHB
 * Slave Interface). The assertion of this field means that more than one
 * WABORTS assertion has occurred. Writing 1 to ISCR[WABORTS] also clears this field.
 * For more information, see ISCR[WABORTS_EN] and ISCR[WABORTS].
 *
 * Values:
 * - 0b0 - One or less than one WABORTS assertion has occurred.
 * - 0b1 - More than 1 WABORTS assertion has occurred before clearing
 *     ISCR[WABORTS].
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_WABORTS_OVERRUN field. */
#define MCM_RD_ISCR_WABORTS_OVERRUN(base) ((MCM_ISCR_REG(base) & MCM_ISCR_WABORTS_OVERRUN_MASK) >> MCM_ISCR_WABORTS_OVERRUN_SHIFT)
#define MCM_BRD_ISCR_WABORTS_OVERRUN(base) (MCM_RD_ISCR_WABORTS_OVERRUN(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIOC[8] (RO)
 *
 * Values:
 * - 0b0 - Not flagged
 * - 0b1 - Flagged
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIOC field. */
#define MCM_RD_ISCR_FIOC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIOC_MASK) >> MCM_ISCR_FIOC_SHIFT)
#define MCM_BRD_ISCR_FIOC(base) (MCM_RD_ISCR_FIOC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FDZC[9] (RO)
 *
 * Values:
 * - 0b0 - Not flagged
 * - 0b1 - Flagged
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FDZC field. */
#define MCM_RD_ISCR_FDZC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FDZC_MASK) >> MCM_ISCR_FDZC_SHIFT)
#define MCM_BRD_ISCR_FDZC(base) (MCM_RD_ISCR_FDZC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FOFC[10] (RO)
 *
 * Values:
 * - 0b0 - Not flagged
 * - 0b1 - Flagged
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FOFC field. */
#define MCM_RD_ISCR_FOFC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FOFC_MASK) >> MCM_ISCR_FOFC_SHIFT)
#define MCM_BRD_ISCR_FOFC(base) (MCM_RD_ISCR_FOFC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FUFC[11] (RO)
 *
 * Values:
 * - 0b0 - Not flagged
 * - 0b1 - Flagged
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FUFC field. */
#define MCM_RD_ISCR_FUFC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FUFC_MASK) >> MCM_ISCR_FUFC_SHIFT)
#define MCM_BRD_ISCR_FUFC(base) (MCM_RD_ISCR_FUFC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIXC[12] (RO)
 *
 * Values:
 * - 0b0 - Not flagged
 * - 0b1 - Flagged
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIXC field. */
#define MCM_RD_ISCR_FIXC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIXC_MASK) >> MCM_ISCR_FIXC_SHIFT)
#define MCM_BRD_ISCR_FIXC(base) (MCM_RD_ISCR_FIXC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field FIDC[15] (RO)
 *
 * Values:
 * - 0b0 - Not flagged
 * - 0b1 - Flagged
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_FIDC field. */
#define MCM_RD_ISCR_FIDC(base) ((MCM_ISCR_REG(base) & MCM_ISCR_FIDC_MASK) >> MCM_ISCR_FIDC_SHIFT)
#define MCM_BRD_ISCR_FIDC(base) (MCM_RD_ISCR_FIDC(base))
/*@}*/

/*!
 * @name Register MCM_ISCR, field WABORTS_EN[21] (RW)
 *
 * WABORTS is an imprecise write fault from the TCM backdoor (AHBS, that is, AHB
 * Slave Interface). This field enables an interrupt on a WABORTS occurrence.
 * For more information, see ISCR[WABORTS] and ISCR[WABORTS_OVERRUN].
 *
 * Values:
 * - 0b0 - Interrupt is not enabled
 * - 0b1 - Interrupt is enabled
 */
/*@{*/
/*! @brief Read current value of the MCM_ISCR_WABORTS_EN field. */
#define MCM_RD_ISCR_WABORTS_EN(base) ((MCM_ISCR_REG(base) & MCM_ISCR_WABORTS_EN_MASK) >> MCM_ISCR_WABORTS_EN_SHIFT)
#define MCM_BRD_ISCR_WABORTS_EN(base) (MCM_RD_ISCR_WABORTS_EN(base))

