pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * MCM_LMEM - Local Memory General Descriptor Register
 ******************************************************************************/

/*!
 * @brief MCM_LMEM - Local Memory General Descriptor Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire MCM_LMEM register
 */
/*@{*/
#define MCM_RD_LMEM(base, index) (MCM_LMEM_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MCM_LMEM bitfields
 */

/*!
 * @name Register MCM_LMEM, field LMEM_Type[15:13] (RO)
 *
 * Defines the type of local memory
 *
 * Values:
 * - 0b000 - ITCM (Instruction Tightly Coupled Memory)
 * - 0b001 - DTCM (Data Tightly Coupled Memory)
 * - 0b010 - Instruction Cache
 * - 0b011 - Data Cache
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Type field. */
#define MCM_RD_LMEM_LMEM_Type(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Type_MASK) >> MCM_LMEM_LMEM_Type_SHIFT)
#define MCM_BRD_LMEM_LMEM_Type(base, index) (MCM_RD_LMEM_LMEM_Type(base, index))
/*@}*/

/*!
 * @name Register MCM_LMEM, field LMEM_Width[19:17] (RO)
 *
 * Defines the local memory bit width
 *
 * Values:
 * - 0b010 - 32-bits
 * - 0b011 - 64-bits
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Width field. */
#define MCM_RD_LMEM_LMEM_Width(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Width_MASK) >> MCM_LMEM_LMEM_Width_SHIFT)
#define MCM_BRD_LMEM_LMEM_Width(base, index) (MCM_RD_LMEM_LMEM_Width(base, index))
/*@}*/

/*!
 * @name Register MCM_LMEM, field LMEM_Ways[23:20] (RO)
 *
 * Defines the ways of set associative
 *
 * Values:
 * - 0b0000 - Reserved (not applicable)
 * - 0b0010 - 2-way set associative
 * - 0b0100 - 4-way set associative
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Ways field. */
#define MCM_RD_LMEM_LMEM_Ways(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Ways_MASK) >> MCM_LMEM_LMEM_Ways_SHIFT)
#define MCM_BRD_LMEM_LMEM_Ways(base, index) (MCM_RD_LMEM_LMEM_Ways(base, index))
/*@}*/

/*!
 * @name Register MCM_LMEM, field LMEM_Size[27:24] (RO)
 *
 * Defines the local memory size
 *
 * Values:
 * - 0b0100 - 8KB
 * - 0b0101 - 16KB
 * - 0b0111 - 64KB
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Size field. */
#define MCM_RD_LMEM_LMEM_Size(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Size_MASK) >> MCM_LMEM_LMEM_Size_SHIFT)
#define MCM_BRD_LMEM_LMEM_Size(base, index) (MCM_RD_LMEM_LMEM_Size(base, index))
/*@}*/

/*!
 * @name Register MCM_LMEM, field LMEM_Valid[31] (RO)
 *
 * Defines whether the local memory is present
 *
 * Values:
 * - 0b0 - Local memory not present
 * - 0b1 - Local memory present
 */
/*@{*/
/*! @brief Read current value of the MCM_LMEM_LMEM_Valid field. */
#define MCM_RD_LMEM_LMEM_Valid(base, index) ((MCM_LMEM_REG(base, index) & MCM_LMEM_LMEM_Valid_MASK) >> MCM_LMEM_LMEM_Valid_SHIFT)
#define MCM_BRD_LMEM_LMEM_Valid(base, index) (MCM_RD_LMEM_LMEM_Valid(base, index))
/*@}*/

/*
 * MKV58F22 MPU
 *
 * Memory protection unit
 *
 * Registers defined in this header file:
 * - MPU_CESR - Control/Error Status Register
 * - MPU_EAR - Error Address Register, slave port n
 * - MPU_EDR - Error Detail Register, slave port n
 * - MPU_WORD - Region Descriptor n, Word 0
 * - MPU_RGDAAC - Region Descriptor Alternate Access Control n
 */

#define MPU_INSTANCE_COUNT (1U) /*!< Number of instances of the MPU module. */
#define MPU_IDX (0U) /*!< Instance number for MPU. */

/*******************************************************************************
 * MPU_CESR - Control/Error Status Register
 ******************************************************************************/

/*!
 * @brief MPU_CESR - Control/Error Status Register (RW)
 *
 * Reset value: 0x00815101U
 */
/*!
 * @name Constants and macros for entire MPU_CESR register
 */
/*@{*/
#define MPU_RD_CESR(base)        (MPU_CESR_REG(base))
#define MPU_WR_CESR(base, value) (MPU_CESR_REG(base) = (value))
#define MPU_RMW_CESR(base, mask, value) (MPU_WR_CESR(base, (MPU_RD_CESR(base) & ~(mask)) | (value)))
#define MPU_SET_CESR(base, value) (BME_OR32(&MPU_CESR_REG(base), (uint32_t)(value)))
#define MPU_CLR_CESR(base, value) (BME_AND32(&MPU_CESR_REG(base), (uint32_t)(~(value))))
#define MPU_TOG_CESR(base, value) (BME_XOR32(&MPU_CESR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual MPU_CESR bitfields
 */

/*!
 * @name Register MPU_CESR, field VLD[0] (RW)
 *
 * Global enable/disable for the MPU.
 *
 * Values:
 * - 0b0 - MPU is disabled. All accesses from all bus masters are allowed.
 * - 0b1 - MPU is enabled
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_VLD field. */
#define MPU_RD_CESR_VLD(base) ((MPU_CESR_REG(base) & MPU_CESR_VLD_MASK) >> MPU_CESR_VLD_SHIFT)
#define MPU_BRD_CESR_VLD(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_VLD_SHIFT, MPU_CESR_VLD_WIDTH))

/*! @brief Set the VLD field to a new value. */
#define MPU_WR_CESR_VLD(base, value) (MPU_RMW_CESR(base, (MPU_CESR_VLD_MASK | MPU_CESR_SPERR_MASK), MPU_CESR_VLD(value)))
#define MPU_BWR_CESR_VLD(base, value) (BME_BFI32(&MPU_CESR_REG(base), ((uint32_t)(value) << MPU_CESR_VLD_SHIFT), MPU_CESR_VLD_SHIFT, MPU_CESR_VLD_WIDTH))
/*@}*/

/*!
 * @name Register MPU_CESR, field NRGD[11:8] (RO)
 *
 * Indicates the number of region descriptors implemented in the MPU.
 *
 * Values:
 * - 0b0000 - 8 region descriptors
 * - 0b0001 - 12 region descriptors
 * - 0b0010 - 16 region descriptors
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_NRGD field. */
#define MPU_RD_CESR_NRGD(base) ((MPU_CESR_REG(base) & MPU_CESR_NRGD_MASK) >> MPU_CESR_NRGD_SHIFT)
#define MPU_BRD_CESR_NRGD(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_NRGD_SHIFT, MPU_CESR_NRGD_WIDTH))
/*@}*/

/*!
 * @name Register MPU_CESR, field NSP[15:12] (RO)
 *
 * Specifies the number of slave ports connected to the MPU.
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_NSP field. */
#define MPU_RD_CESR_NSP(base) ((MPU_CESR_REG(base) & MPU_CESR_NSP_MASK) >> MPU_CESR_NSP_SHIFT)
#define MPU_BRD_CESR_NSP(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_NSP_SHIFT, MPU_CESR_NSP_WIDTH))
/*@}*/

/*!
 * @name Register MPU_CESR, field HRL[19:16] (RO)
 *
 * Specifies the MPU's hardware and definition revision level. It can be read by
 * software to determine the functional definition of the module.
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_HRL field. */
#define MPU_RD_CESR_HRL(base) ((MPU_CESR_REG(base) & MPU_CESR_HRL_MASK) >> MPU_CESR_HRL_SHIFT)
#define MPU_BRD_CESR_HRL(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_HRL_SHIFT, MPU_CESR_HRL_WIDTH))
/*@}*/

/*!
 * @name Register MPU_CESR, field SPERR[31:27] (W1C)
 *
 * Indicates a captured error in EARn and EDRn. This bit is set when the
 * hardware detects an error and records the faulting address and attributes. It is
 * cleared by writing one to it. If another error is captured at the exact same cycle
 * as the write, the flag remains set. A find-first-one instruction or
 * equivalent can detect the presence of a captured error. The following shows the
 * correspondence between the bit number and slave port number: Bit 31 corresponds to
 * slave port 0. Bit 30 corresponds to slave port 1. Bit 29 corresponds to slave
 * port 2. Bit 28 corresponds to slave port 3. Bit 27 corresponds to slave port 4.
 *
 * Values:
 * - 0b00000 - No error has occurred for slave port n.
 * - 0b00001 - An error has occurred for slave port n.
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_SPERR field. */
#define MPU_RD_CESR_SPERR(base) ((MPU_CESR_REG(base) & MPU_CESR_SPERR_MASK) >> MPU_CESR_SPERR_SHIFT)
#define MPU_BRD_CESR_SPERR(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_SPERR_SHIFT, MPU_CESR_SPERR_WIDTH))

/*! @brief Set the SPERR field to a new value. */
#define MPU_WR_CESR_SPERR(base, value) (MPU_RMW_CESR(base, MPU_CESR_SPERR_MASK, MPU_CESR_SPERR(value)))
#define MPU_BWR_CESR_SPERR(base, value) (BME_BFI32(&MPU_CESR_REG(base), ((uint32_t)(value) << MPU_CESR_SPERR_SHIFT), MPU_CESR_SPERR_SHIFT, MPU_CESR_SPERR_WIDTH))
/*@}*/

