pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual MPU_WORD bitfields
 */

/*!
 * @name Register MPU_WORD, field VLD[0] (RW)
 *
 * Signals the region descriptor is valid. Any write to RGDn_WORD0-2 clears this
 * bit.
 *
 * Values:
 * - 0b0 - Region descriptor is invalid
 * - 0b1 - Region descriptor is valid
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_VLD field. */
#define MPU_RD_WORD_VLD(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_VLD_MASK) >> MPU_WORD_VLD_SHIFT)
#define MPU_BRD_WORD_VLD(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_VLD_SHIFT, MPU_WORD_VLD_WIDTH))

/*! @brief Set the VLD field to a new value. */
#define MPU_WR_WORD_VLD(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_VLD_MASK, MPU_WORD_VLD(value)))
#define MPU_BWR_WORD_VLD(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_VLD_SHIFT), MPU_WORD_VLD_SHIFT, MPU_WORD_VLD_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M0UM[2:0] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M0UM field. */
#define MPU_RD_WORD_M0UM(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M0UM_MASK) >> MPU_WORD_M0UM_SHIFT)
#define MPU_BRD_WORD_M0UM(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M0UM_SHIFT, MPU_WORD_M0UM_WIDTH))

/*! @brief Set the M0UM field to a new value. */
#define MPU_WR_WORD_M0UM(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M0UM_MASK, MPU_WORD_M0UM(value)))
#define MPU_BWR_WORD_M0UM(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M0UM_SHIFT), MPU_WORD_M0UM_SHIFT, MPU_WORD_M0UM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M0SM[4:3] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M0SM field. */
#define MPU_RD_WORD_M0SM(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M0SM_MASK) >> MPU_WORD_M0SM_SHIFT)
#define MPU_BRD_WORD_M0SM(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M0SM_SHIFT, MPU_WORD_M0SM_WIDTH))

/*! @brief Set the M0SM field to a new value. */
#define MPU_WR_WORD_M0SM(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M0SM_MASK, MPU_WORD_M0SM(value)))
#define MPU_BWR_WORD_M0SM(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M0SM_SHIFT), MPU_WORD_M0SM_SHIFT, MPU_WORD_M0SM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M0PE[5] (RW)
 *
 * See M0PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M0PE field. */
#define MPU_RD_WORD_M0PE(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M0PE_MASK) >> MPU_WORD_M0PE_SHIFT)
#define MPU_BRD_WORD_M0PE(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M0PE_SHIFT, MPU_WORD_M0PE_WIDTH))

/*! @brief Set the M0PE field to a new value. */
#define MPU_WR_WORD_M0PE(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M0PE_MASK, MPU_WORD_M0PE(value)))
#define MPU_BWR_WORD_M0PE(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M0PE_SHIFT), MPU_WORD_M0PE_SHIFT, MPU_WORD_M0PE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field ENDADDR[31:5] (RW)
 *
 * Defines the most significant bits of the 31-modulo-32 byte end address of the
 * memory region. The MPU does not verify that ENDADDR >= SRTADDR.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_ENDADDR field. */
#define MPU_RD_WORD_ENDADDR(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_ENDADDR_MASK) >> MPU_WORD_ENDADDR_SHIFT)
#define MPU_BRD_WORD_ENDADDR(base, index, index2) (MPU_RD_WORD_ENDADDR(base, index, index2))

/*! @brief Set the ENDADDR field to a new value. */
#define MPU_WR_WORD_ENDADDR(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_ENDADDR_MASK, MPU_WORD_ENDADDR(value)))
#define MPU_BWR_WORD_ENDADDR(base, index, index2, value) (MPU_WR_WORD_ENDADDR(base, index, index2, value))
/*@}*/

/*!
 * @name Register MPU_WORD, field SRTADDR[31:5] (RW)
 *
 * Defines the most significant bits of the 0-modulo-32 byte start address of
 * the memory region.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_SRTADDR field. */
#define MPU_RD_WORD_SRTADDR(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_SRTADDR_MASK) >> MPU_WORD_SRTADDR_SHIFT)
#define MPU_BRD_WORD_SRTADDR(base, index, index2) (MPU_RD_WORD_SRTADDR(base, index, index2))

/*! @brief Set the SRTADDR field to a new value. */
#define MPU_WR_WORD_SRTADDR(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_SRTADDR_MASK, MPU_WORD_SRTADDR(value)))
#define MPU_BWR_WORD_SRTADDR(base, index, index2, value) (MPU_WR_WORD_SRTADDR(base, index, index2, value))
/*@}*/

/*!
 * @name Register MPU_WORD, field M1UM[8:6] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M1UM field. */
#define MPU_RD_WORD_M1UM(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M1UM_MASK) >> MPU_WORD_M1UM_SHIFT)
#define MPU_BRD_WORD_M1UM(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M1UM_SHIFT, MPU_WORD_M1UM_WIDTH))

/*! @brief Set the M1UM field to a new value. */
#define MPU_WR_WORD_M1UM(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M1UM_MASK, MPU_WORD_M1UM(value)))
#define MPU_BWR_WORD_M1UM(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M1UM_SHIFT), MPU_WORD_M1UM_SHIFT, MPU_WORD_M1UM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M1SM[10:9] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M1SM field. */
#define MPU_RD_WORD_M1SM(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M1SM_MASK) >> MPU_WORD_M1SM_SHIFT)
#define MPU_BRD_WORD_M1SM(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M1SM_SHIFT, MPU_WORD_M1SM_WIDTH))

/*! @brief Set the M1SM field to a new value. */
#define MPU_WR_WORD_M1SM(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M1SM_MASK, MPU_WORD_M1SM(value)))
#define MPU_BWR_WORD_M1SM(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M1SM_SHIFT), MPU_WORD_M1SM_SHIFT, MPU_WORD_M1SM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M1PE[11] (RW)
 *
 * See M3PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M1PE field. */
#define MPU_RD_WORD_M1PE(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M1PE_MASK) >> MPU_WORD_M1PE_SHIFT)
#define MPU_BRD_WORD_M1PE(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M1PE_SHIFT, MPU_WORD_M1PE_WIDTH))

/*! @brief Set the M1PE field to a new value. */
#define MPU_WR_WORD_M1PE(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M1PE_MASK, MPU_WORD_M1PE(value)))
#define MPU_BWR_WORD_M1PE(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M1PE_SHIFT), MPU_WORD_M1PE_SHIFT, MPU_WORD_M1PE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M2UM[14:12] (RW)
 *
 * See M3UM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M2UM field. */
#define MPU_RD_WORD_M2UM(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M2UM_MASK) >> MPU_WORD_M2UM_SHIFT)
#define MPU_BRD_WORD_M2UM(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M2UM_SHIFT, MPU_WORD_M2UM_WIDTH))

/*! @brief Set the M2UM field to a new value. */
#define MPU_WR_WORD_M2UM(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M2UM_MASK, MPU_WORD_M2UM(value)))
#define MPU_BWR_WORD_M2UM(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M2UM_SHIFT), MPU_WORD_M2UM_SHIFT, MPU_WORD_M2UM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M2SM[16:15] (RW)
 *
 * See M3SM description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M2SM field. */
#define MPU_RD_WORD_M2SM(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M2SM_MASK) >> MPU_WORD_M2SM_SHIFT)
#define MPU_BRD_WORD_M2SM(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M2SM_SHIFT, MPU_WORD_M2SM_WIDTH))

/*! @brief Set the M2SM field to a new value. */
#define MPU_WR_WORD_M2SM(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M2SM_MASK, MPU_WORD_M2SM(value)))
#define MPU_BWR_WORD_M2SM(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M2SM_SHIFT), MPU_WORD_M2SM_SHIFT, MPU_WORD_M2SM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field PIDMASK[23:16] (RW)
 *
 * Provides a masking capability so that multiple process identifiers can be
 * included as part of the region hit determination. If a bit in PIDMASK is set,
 * then the corresponding PID bit is ignored in the comparison. This field and PID
 * are included in the region hit determination if RGDn_WORD2[MxPE] is set. For
 * more information on the handling of the PID and PIDMASK, see "Access Evaluation
 * - Hit Determination."
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_PIDMASK field. */
#define MPU_RD_WORD_PIDMASK(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_PIDMASK_MASK) >> MPU_WORD_PIDMASK_SHIFT)
#define MPU_BRD_WORD_PIDMASK(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_PIDMASK_SHIFT, MPU_WORD_PIDMASK_WIDTH))

/*! @brief Set the PIDMASK field to a new value. */
#define MPU_WR_WORD_PIDMASK(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_PIDMASK_MASK, MPU_WORD_PIDMASK(value)))
#define MPU_BWR_WORD_PIDMASK(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_PIDMASK_SHIFT), MPU_WORD_PIDMASK_SHIFT, MPU_WORD_PIDMASK_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M2PE[17] (RW)
 *
 * See M3PE description.
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M2PE field. */
#define MPU_RD_WORD_M2PE(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M2PE_MASK) >> MPU_WORD_M2PE_SHIFT)
#define MPU_BRD_WORD_M2PE(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M2PE_SHIFT, MPU_WORD_M2PE_WIDTH))

/*! @brief Set the M2PE field to a new value. */
#define MPU_WR_WORD_M2PE(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M2PE_MASK, MPU_WORD_M2PE(value)))
#define MPU_BWR_WORD_M2PE(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M2PE_SHIFT), MPU_WORD_M2PE_SHIFT, MPU_WORD_M2PE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M3UM[20:18] (RW)
 *
 * Defines the access controls for bus master 3 in User mode. M3UM consists of
 * three independent bits, enabling read (r), write (w), and execute (x)
 * permissions.
 *
 * Values:
 * - 0b000 - An attempted access of that mode may be terminated with an access
 *     error (if not allowed by another descriptor) and the access not performed.
 * - 0b001 - Allows the given access type to occur
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M3UM field. */
#define MPU_RD_WORD_M3UM(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M3UM_MASK) >> MPU_WORD_M3UM_SHIFT)
#define MPU_BRD_WORD_M3UM(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M3UM_SHIFT, MPU_WORD_M3UM_WIDTH))

/*! @brief Set the M3UM field to a new value. */
#define MPU_WR_WORD_M3UM(base, index, index2, value) (MPU_RMW_WORD(base, index, index2, MPU_WORD_M3UM_MASK, MPU_WORD_M3UM(value)))
#define MPU_BWR_WORD_M3UM(base, index, index2, value) (BME_BFI32(&MPU_WORD_REG(base, index, index2), ((uint32_t)(value) << MPU_WORD_M3UM_SHIFT), MPU_WORD_M3UM_SHIFT, MPU_WORD_M3UM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_WORD, field M3SM[22:21] (RW)
 *
 * Defines the access controls for bus master 3 in Supervisor mode.
 *
 * Values:
 * - 0b00 - r/w/x; read, write and execute allowed
 * - 0b01 - r/x; read and execute allowed, but no write
 * - 0b10 - r/w; read and write allowed, but no execute
 * - 0b11 - Same as User mode defined in M3UM
 */
/*@{*/
/*! @brief Read current value of the MPU_WORD_M3SM field. */
#define MPU_RD_WORD_M3SM(base, index, index2) ((MPU_WORD_REG(base, index, index2) & MPU_WORD_M3SM_MASK) >> MPU_WORD_M3SM_SHIFT)
#define MPU_BRD_WORD_M3SM(base, index, index2) (BME_UBFX32(&MPU_WORD_REG(base, index, index2), MPU_WORD_M3SM_SHIFT, MPU_WORD_M3SM_WIDTH))

