pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the M6RE field to a new value. */
#define MPU_WR_RGDAAC_M6RE(base, index, value) (MPU_RMW_RGDAAC(base, index, MPU_RGDAAC_M6RE_MASK, MPU_RGDAAC_M6RE(value)))
#define MPU_BWR_RGDAAC_M6RE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M6RE_SHIFT), MPU_RGDAAC_M6RE_SHIFT, MPU_RGDAAC_M6RE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M7WE[30] (RW)
 *
 * Values:
 * - 0b0 - Bus master 7 writes terminate with an access error and the write is
 *     not performed
 * - 0b1 - Bus master 7 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M7WE field. */
#define MPU_RD_RGDAAC_M7WE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M7WE_MASK) >> MPU_RGDAAC_M7WE_SHIFT)
#define MPU_BRD_RGDAAC_M7WE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M7WE_SHIFT, MPU_RGDAAC_M7WE_WIDTH))

/*! @brief Set the M7WE field to a new value. */
#define MPU_WR_RGDAAC_M7WE(base, index, value) (MPU_RMW_RGDAAC(base, index, MPU_RGDAAC_M7WE_MASK, MPU_RGDAAC_M7WE(value)))
#define MPU_BWR_RGDAAC_M7WE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M7WE_SHIFT), MPU_RGDAAC_M7WE_SHIFT, MPU_RGDAAC_M7WE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M7RE[31] (RW)
 *
 * Values:
 * - 0b0 - Bus master 7 reads terminate with an access error and the read is not
 *     performed
 * - 0b1 - Bus master 7 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M7RE field. */
#define MPU_RD_RGDAAC_M7RE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M7RE_MASK) >> MPU_RGDAAC_M7RE_SHIFT)
#define MPU_BRD_RGDAAC_M7RE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M7RE_SHIFT, MPU_RGDAAC_M7RE_WIDTH))

/*! @brief Set the M7RE field to a new value. */
#define MPU_WR_RGDAAC_M7RE(base, index, value) (MPU_RMW_RGDAAC(base, index, MPU_RGDAAC_M7RE_MASK, MPU_RGDAAC_M7RE(value)))
#define MPU_BWR_RGDAAC_M7RE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M7RE_SHIFT), MPU_RGDAAC_M7RE_SHIFT, MPU_RGDAAC_M7RE_WIDTH))
/*@}*/

/*
 * MKV58F22 MSCM
 *
 * MSCM
 *
 * Registers defined in this header file:
 * - MSCM_CPxTYPE - Processor X Type Register
 * - MSCM_CPxNUM - Processor X Number Register
 * - MSCM_CPxMASTER - Processor X Master Register
 * - MSCM_CPxCOUNT - Processor X Count Register
 * - MSCM_CPxCFG - Processor X Configuration Register
 * - MSCM_CP0TYPE - Processor 0 Type Register
 * - MSCM_CP0NUM - Processor 0 Number Register
 * - MSCM_CP0MASTER - Processor 0 Master Register
 * - MSCM_CP0COUNT - Processor 0 Count Register
 * - MSCM_CP0CFG - Processor 0 Configuration Register
 * - MSCM_CP1TYPE - Processor 1 Type Register
 * - MSCM_CP1NUM - Processor 1 Number Register
 * - MSCM_CP1MASTER - Processor 1 Master Register
 * - MSCM_CP1COUNT - Processor 1 Count Register
 * - MSCM_CP1CFG - Processor 1 Configuration Register
 * - MSCM_OCMDR - On-Chip Memory Descriptor Register
 */

#define MSCM_INSTANCE_COUNT (1U) /*!< Number of instances of the MSCM module. */
#define MSCM_IDX (0U) /*!< Instance number for MSCM. */

/*******************************************************************************
 * MSCM_CPxTYPE - Processor X Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxTYPE - Processor X Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32 bit response includes 3 ASCII characters
 * defining the CPU type along with a byte defining the logical revision number. The
 * logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxTYPE register
 */
/*@{*/
#define MSCM_RD_CPxTYPE(base)    (MSCM_CPxTYPE_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxTYPE bitfields
 */

/*!
 * @name Register MSCM_CPxTYPE, field RYPZ[7:0] (RO)
 *
 * This read-only field defines the processor revision for CPx: 0x00 corresponds
 * to the r0p0 core release. 0x01 corresponds to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxTYPE_RYPZ field. */
#define MSCM_RD_CPxTYPE_RYPZ(base) ((MSCM_CPxTYPE_REG(base) & MSCM_CPxTYPE_RYPZ_MASK) >> MSCM_CPxTYPE_RYPZ_SHIFT)
#define MSCM_BRD_CPxTYPE_RYPZ(base) (BME_UBFX32(&MSCM_CPxTYPE_REG(base), MSCM_CPxTYPE_RYPZ_SHIFT, MSCM_CPxTYPE_RYPZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CPxTYPE, field PERSONALITY[31:8] (RO)
 *
 * This read-only field defines the processor personality for CPx if CPx =
 * Cortex-M7, then PERSONALITY = 0x43_4D_37 ("CM7").
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxTYPE_PERSONALITY field. */
#define MSCM_RD_CPxTYPE_PERSONALITY(base) ((MSCM_CPxTYPE_REG(base) & MSCM_CPxTYPE_PERSONALITY_MASK) >> MSCM_CPxTYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_CPxTYPE_PERSONALITY(base) (MSCM_RD_CPxTYPE_PERSONALITY(base))
/*@}*/

/*******************************************************************************
 * MSCM_CPxNUM - Processor X Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxNUM - Processor X Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. In single processor configurations,
 * the logical processor number is always zero; in dual core configurations, the
 * boot (or primary) core is assigned number 0 while the secondary core is defined
 * as number 1.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxNUM register
 */
/*@{*/
#define MSCM_RD_CPxNUM(base)     (MSCM_CPxNUM_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxNUM bitfields
 */

/*!
 * @name Register MSCM_CPxNUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If single
 * core configuration, then CPN = 0 If dual core configuration and boot (primary)
 * core, then CPN = 0 For secondary core, CPN = 1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxNUM_CPN field. */
#define MSCM_RD_CPxNUM_CPN(base) ((MSCM_CPxNUM_REG(base) & MSCM_CPxNUM_CPN_MASK) >> MSCM_CPxNUM_CPN_SHIFT)
#define MSCM_BRD_CPxNUM_CPN(base) (BME_UBFX32(&MSCM_CPxNUM_REG(base), MSCM_CPxNUM_CPN_SHIFT, MSCM_CPxNUM_CPN_WIDTH))
/*@}*/

