pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * MSCM_CPxMASTER - Processor X Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxMASTER - Processor X Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the physical bus
 * master number the core making the access. The 32 bit response defines the
 * physical master number for processor x. A privileged read from the CM7 returns the
 * appropriate processor information. Reads from any other bus master return all
 * zeroes. Attempted user mode or write accesses are terminated with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxMASTER register
 */
/*@{*/
#define MSCM_RD_CPxMASTER(base)  (MSCM_CPxMASTER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxMASTER bitfields
 */

/*!
 * @name Register MSCM_CPxMASTER, field PPN[5:0] (RO)
 *
 * This read-only field defines the physical port number for CPUx. For CPU0, PPN
 * = 0x00 For CPU1, PPN = 0x24
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxMASTER_PPN field. */
#define MSCM_RD_CPxMASTER_PPN(base) ((MSCM_CPxMASTER_REG(base) & MSCM_CPxMASTER_PPN_MASK) >> MSCM_CPxMASTER_PPN_SHIFT)
#define MSCM_BRD_CPxMASTER_PPN(base) (BME_UBFX32(&MSCM_CPxMASTER_REG(base), MSCM_CPxMASTER_PPN_SHIFT, MSCM_CPxMASTER_PPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CPxCOUNT - Processor X Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxCOUNT - Processor X Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_CPxCOUNT register
 */
/*@{*/
#define MSCM_RD_CPxCOUNT(base)   (MSCM_CPxCOUNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxCOUNT bitfields
 */

/*!
 * @name Register MSCM_CPxCOUNT, field PCNT[1:0] (RO)
 *
 * This read-only field defines the processor count for the chip configuration:
 * If single core configuration, then PCNT = 00 If dual core configuration, then
 * PCNT = 01
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCOUNT_PCNT field. */
#define MSCM_RD_CPxCOUNT_PCNT(base) ((MSCM_CPxCOUNT_REG(base) & MSCM_CPxCOUNT_PCNT_MASK) >> MSCM_CPxCOUNT_PCNT_SHIFT)
#define MSCM_BRD_CPxCOUNT_PCNT(base) (BME_UBFX32(&MSCM_CPxCOUNT_REG(base), MSCM_CPxCOUNT_PCNT_SHIFT, MSCM_CPxCOUNT_PCNT_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CPxCFG - Processor X Configuration Register
 ******************************************************************************/

/*!
 * @brief MSCM_CPxCFG - Processor X Configuration Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides information on the Level 1 caches (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CPxCFG register
 */
/*@{*/
#define MSCM_RD_CPxCFG(base, index) (MSCM_CPxCFG_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_CPxCFG bitfields
 */

/*!
 * @name Register MSCM_CPxCFG, field DCWY[7:0] (RO)
 *
 * This read-only field provides the number of cache ways for the Data Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_DCWY field. */
#define MSCM_RD_CPxCFG_DCWY(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_DCWY_MASK) >> MSCM_CPxCFG_DCWY_SHIFT)
#define MSCM_BRD_CPxCFG_DCWY(base, index) (BME_UBFX32(&MSCM_CPxCFG_REG(base, index), MSCM_CPxCFG_DCWY_SHIFT, MSCM_CPxCFG_DCWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CPxCFG, field DCSZ[15:8] (RO)
 *
 * This read-only field provides an encoded value of the Data Cache size. The
 * capacity of the memory is expressed as Size [bytes] = 2(9+SZ),where SZ is
 * non-zero; a SZ = 0 indicates the memory is not present. if no Data Cache, then DCSZ
 * = 0x00 if a 4 Kbyte Data Cache, then DCSZ = 0x03 if an 8 Kbyte Data Cache,
 * then DCSZ = 0x04 if a 16 Kbyte Data Cache, then DCSZ = 0x05 if a 32 Kbyte Data
 * Cache, then DCSZ = 0x06 if a 64 Kbyte Data Cache, then DCSZ = 0x07 if a 128
 * Kbyte Data Cache, then DCSZ = 0x08 if a 256 Kbyte Data Cache, then DCSZ = 0x09 if
 * a 512 Kbyte Data Cache, then DCSZ = 0x0A
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_DCSZ field. */
#define MSCM_RD_CPxCFG_DCSZ(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_DCSZ_MASK) >> MSCM_CPxCFG_DCSZ_SHIFT)
#define MSCM_BRD_CPxCFG_DCSZ(base, index) (BME_UBFX32(&MSCM_CPxCFG_REG(base, index), MSCM_CPxCFG_DCSZ_SHIFT, MSCM_CPxCFG_DCSZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CPxCFG, field ICWY[23:16] (RO)
 *
 * This read-only field provides the number of cache ways for the Instruction
 * Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_ICWY field. */
#define MSCM_RD_CPxCFG_ICWY(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_ICWY_MASK) >> MSCM_CPxCFG_ICWY_SHIFT)
#define MSCM_BRD_CPxCFG_ICWY(base, index) (BME_UBFX32(&MSCM_CPxCFG_REG(base, index), MSCM_CPxCFG_ICWY_SHIFT, MSCM_CPxCFG_ICWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CPxCFG, field ICSZ[31:24] (RO)
 *
 * This read-only field provides an encoded value of the Instruction Cache size.
 * The capacity of the memory is expressed as Size [bytes] = 2(9+SZ), where SZ
 * is non-zero; a SZ = 0 indicates the memory is not present. if no Instruction
 * Cache, then ICSZ = 0x00 if a 4 Kbyte Instruction Cache, then ICSZ = 0x03 if an 8
 * Kbyte Instruction Cache, then ICSZ = 0x04 if a 16 Kbyte Instruction Cache,
 * then ICSZ = 0x05 if a 32 Kbyte Instruction Cache, then ICSZ = 0x06 if a 64 Kbyte
 * Instruction Cache, then ICSZ = 0x07 if a 128 Kbyte Instruction Cache, then
 * ICSZ = 0x08 if a 256 Kbyte Instruction Cache, then ICSZ = 0x09 if a 512 Kbyte
 * Instruction Cache, then ICSZ = 0x0A
 */
/*@{*/
/*! @brief Read current value of the MSCM_CPxCFG_ICSZ field. */
#define MSCM_RD_CPxCFG_ICSZ(base, index) ((MSCM_CPxCFG_REG(base, index) & MSCM_CPxCFG_ICSZ_MASK) >> MSCM_CPxCFG_ICSZ_SHIFT)
#define MSCM_BRD_CPxCFG_ICSZ(base, index) (BME_UBFX32(&MSCM_CPxCFG_REG(base, index), MSCM_CPxCFG_ICSZ_SHIFT, MSCM_CPxCFG_ICSZ_WIDTH))
/*@}*/

