pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * MSCM_CP0TYPE - Processor 0 Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0TYPE - Processor 0 Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32 bit response includes 3 ASCII characters
 * defining the CPU type along with a byte defining the logical revision number. The
 * logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0TYPE register
 */
/*@{*/
#define MSCM_RD_CP0TYPE(base)    (MSCM_CP0TYPE_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0TYPE bitfields
 */

/*!
 * @name Register MSCM_CP0TYPE, field RYPZ[7:0] (RO)
 *
 * This read-only field defines the processor revision for CPx: 0x00 corresponds
 * to the r0p0 core release. 0x01 corresponds to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0TYPE_RYPZ field. */
#define MSCM_RD_CP0TYPE_RYPZ(base) ((MSCM_CP0TYPE_REG(base) & MSCM_CP0TYPE_RYPZ_MASK) >> MSCM_CP0TYPE_RYPZ_SHIFT)
#define MSCM_BRD_CP0TYPE_RYPZ(base) (BME_UBFX32(&MSCM_CP0TYPE_REG(base), MSCM_CP0TYPE_RYPZ_SHIFT, MSCM_CP0TYPE_RYPZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP0TYPE, field PERSONALITY[31:8] (RO)
 *
 * This read-only field defines the processor personality for CPx if CPx =
 * Cortex-M7, then PERSONALITY = 0x43_4D_37 ("CM7").
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0TYPE_PERSONALITY field. */
#define MSCM_RD_CP0TYPE_PERSONALITY(base) ((MSCM_CP0TYPE_REG(base) & MSCM_CP0TYPE_PERSONALITY_MASK) >> MSCM_CP0TYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_CP0TYPE_PERSONALITY(base) (MSCM_RD_CP0TYPE_PERSONALITY(base))
/*@}*/

/*******************************************************************************
 * MSCM_CP0NUM - Processor 0 Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0NUM - Processor 0 Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. In single processor configurations,
 * the logical processor number is always zero; in dual core configurations, the
 * boot (or primary) core is assigned number 0 while the secondary core is defined
 * as number 1.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0NUM register
 */
/*@{*/
#define MSCM_RD_CP0NUM(base)     (MSCM_CP0NUM_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0NUM bitfields
 */

/*!
 * @name Register MSCM_CP0NUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If single
 * core configuration, then CPN = 0 If dual core configuration and boot (primary)
 * core, then CPN = 0 For secondary core, CPN = 1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0NUM_CPN field. */
#define MSCM_RD_CP0NUM_CPN(base) ((MSCM_CP0NUM_REG(base) & MSCM_CP0NUM_CPN_MASK) >> MSCM_CP0NUM_CPN_SHIFT)
#define MSCM_BRD_CP0NUM_CPN(base) (BME_UBFX32(&MSCM_CP0NUM_REG(base), MSCM_CP0NUM_CPN_SHIFT, MSCM_CP0NUM_CPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP0MASTER - Processor 0 Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0MASTER - Processor 0 Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the physical bus
 * master number the core making the access. The 32 bit response defines the
 * physical master number for processor x. A privileged read from the CM7 returns the
 * appropriate processor information. Reads from any other bus master return all
 * zeroes. Attempted user mode or write accesses are terminated with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0MASTER register
 */
/*@{*/
#define MSCM_RD_CP0MASTER(base)  (MSCM_CP0MASTER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0MASTER bitfields
 */

/*!
 * @name Register MSCM_CP0MASTER, field PPN[5:0] (RO)
 *
 * This read-only field defines the physical port number for CPUx. For CPU0, PPN
 * = 0x00 For CPU1, PPN = 0x24
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0MASTER_PPN field. */
#define MSCM_RD_CP0MASTER_PPN(base) ((MSCM_CP0MASTER_REG(base) & MSCM_CP0MASTER_PPN_MASK) >> MSCM_CP0MASTER_PPN_SHIFT)
#define MSCM_BRD_CP0MASTER_PPN(base) (BME_UBFX32(&MSCM_CP0MASTER_REG(base), MSCM_CP0MASTER_PPN_SHIFT, MSCM_CP0MASTER_PPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP0COUNT - Processor 0 Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0COUNT - Processor 0 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_CP0COUNT register
 */
/*@{*/
#define MSCM_RD_CP0COUNT(base)   (MSCM_CP0COUNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP0COUNT bitfields
 */

/*!
 * @name Register MSCM_CP0COUNT, field PCNT[1:0] (RO)
 *
 * This read-only field defines the processor count for the chip configuration:
 * If single core configuration, then PCNT = 00 If dual core configuration, then
 * PCNT = 01
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0COUNT_PCNT field. */
#define MSCM_RD_CP0COUNT_PCNT(base) ((MSCM_CP0COUNT_REG(base) & MSCM_CP0COUNT_PCNT_MASK) >> MSCM_CP0COUNT_PCNT_SHIFT)
#define MSCM_BRD_CP0COUNT_PCNT(base) (BME_UBFX32(&MSCM_CP0COUNT_REG(base), MSCM_CP0COUNT_PCNT_SHIFT, MSCM_CP0COUNT_PCNT_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP0CFG - Processor 0 Configuration Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP0CFG - Processor 0 Configuration Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides information on the Level 1 caches (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CP0CFG register
 */
/*@{*/
#define MSCM_RD_CP0CFG(base, index) (MSCM_CP0CFG_REG(base, index))
/*@}*/

