pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual MSCM_CP0CFG bitfields
 */

/*!
 * @name Register MSCM_CP0CFG, field DCWY[7:0] (RO)
 *
 * This read-only field provides the number of cache ways for the Data Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_DCWY field. */
#define MSCM_RD_CP0CFG_DCWY(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_DCWY_MASK) >> MSCM_CP0CFG_DCWY_SHIFT)
#define MSCM_BRD_CP0CFG_DCWY(base, index) (BME_UBFX32(&MSCM_CP0CFG_REG(base, index), MSCM_CP0CFG_DCWY_SHIFT, MSCM_CP0CFG_DCWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP0CFG, field DCSZ[15:8] (RO)
 *
 * This read-only field provides an encoded value of the Data Cache size. The
 * capacity of the memory is expressed as Size [bytes] = 2(9+SZ),where SZ is
 * non-zero; a SZ = 0 indicates the memory is not present. if no Data Cache, then DCSZ
 * = 0x00 if a 4 Kbyte Data Cache, then DCSZ = 0x03 if an 8 Kbyte Data Cache,
 * then DCSZ = 0x04 if a 16 Kbyte Data Cache, then DCSZ = 0x05 if a 32 Kbyte Data
 * Cache, then DCSZ = 0x06 if a 64 Kbyte Data Cache, then DCSZ = 0x07 if a 128
 * Kbyte Data Cache, then DCSZ = 0x08 if a 256 Kbyte Data Cache, then DCSZ = 0x09 if
 * a 512 Kbyte Data Cache, then DCSZ = 0x0A
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_DCSZ field. */
#define MSCM_RD_CP0CFG_DCSZ(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_DCSZ_MASK) >> MSCM_CP0CFG_DCSZ_SHIFT)
#define MSCM_BRD_CP0CFG_DCSZ(base, index) (BME_UBFX32(&MSCM_CP0CFG_REG(base, index), MSCM_CP0CFG_DCSZ_SHIFT, MSCM_CP0CFG_DCSZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP0CFG, field ICWY[23:16] (RO)
 *
 * This read-only field provides the number of cache ways for the Instruction
 * Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_ICWY field. */
#define MSCM_RD_CP0CFG_ICWY(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_ICWY_MASK) >> MSCM_CP0CFG_ICWY_SHIFT)
#define MSCM_BRD_CP0CFG_ICWY(base, index) (BME_UBFX32(&MSCM_CP0CFG_REG(base, index), MSCM_CP0CFG_ICWY_SHIFT, MSCM_CP0CFG_ICWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP0CFG, field ICSZ[31:24] (RO)
 *
 * This read-only field provides an encoded value of the Instruction Cache size.
 * The capacity of the memory is expressed as Size [bytes] = 2(9+SZ), where SZ
 * is non-zero; a SZ = 0 indicates the memory is not present. if no Instruction
 * Cache, then ICSZ = 0x00 if a 4 Kbyte Instruction Cache, then ICSZ = 0x03 if an 8
 * Kbyte Instruction Cache, then ICSZ = 0x04 if a 16 Kbyte Instruction Cache,
 * then ICSZ = 0x05 if a 32 Kbyte Instruction Cache, then ICSZ = 0x06 if a 64 Kbyte
 * Instruction Cache, then ICSZ = 0x07 if a 128 Kbyte Instruction Cache, then
 * ICSZ = 0x08 if a 256 Kbyte Instruction Cache, then ICSZ = 0x09 if a 512 Kbyte
 * Instruction Cache, then ICSZ = 0x0A
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP0CFG_ICSZ field. */
#define MSCM_RD_CP0CFG_ICSZ(base, index) ((MSCM_CP0CFG_REG(base, index) & MSCM_CP0CFG_ICSZ_MASK) >> MSCM_CP0CFG_ICSZ_SHIFT)
#define MSCM_BRD_CP0CFG_ICSZ(base, index) (BME_UBFX32(&MSCM_CP0CFG_REG(base, index), MSCM_CP0CFG_ICSZ_SHIFT, MSCM_CP0CFG_ICSZ_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP1TYPE - Processor 1 Type Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1TYPE - Processor 1 Type Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the personality of
 * the core making the access. The 32 bit response includes 3 ASCII characters
 * defining the CPU type along with a byte defining the logical revision number. The
 * logical revision number follows ARM's rYpZ nomenclature.
 */
/*!
 * @name Constants and macros for entire MSCM_CP1TYPE register
 */
/*@{*/
#define MSCM_RD_CP1TYPE(base)    (MSCM_CP1TYPE_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1TYPE bitfields
 */

/*!
 * @name Register MSCM_CP1TYPE, field RYPZ[7:0] (RO)
 *
 * This read-only field defines the processor revision for CPx: 0x00 corresponds
 * to the r0p0 core release. 0x01 corresponds to the r0p1 core release. ...
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1TYPE_RYPZ field. */
#define MSCM_RD_CP1TYPE_RYPZ(base) ((MSCM_CP1TYPE_REG(base) & MSCM_CP1TYPE_RYPZ_MASK) >> MSCM_CP1TYPE_RYPZ_SHIFT)
#define MSCM_BRD_CP1TYPE_RYPZ(base) (BME_UBFX32(&MSCM_CP1TYPE_REG(base), MSCM_CP1TYPE_RYPZ_SHIFT, MSCM_CP1TYPE_RYPZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP1TYPE, field PERSONALITY[31:8] (RO)
 *
 * This read-only field defines the processor personality for CPx
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1TYPE_PERSONALITY field. */
#define MSCM_RD_CP1TYPE_PERSONALITY(base) ((MSCM_CP1TYPE_REG(base) & MSCM_CP1TYPE_PERSONALITY_MASK) >> MSCM_CP1TYPE_PERSONALITY_SHIFT)
#define MSCM_BRD_CP1TYPE_PERSONALITY(base) (MSCM_RD_CP1TYPE_PERSONALITY(base))
/*@}*/

/*******************************************************************************
 * MSCM_CP1NUM - Processor 1 Number Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1NUM - Processor 1 Number Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the logical
 * processor number of the core making the access. In single processor configurations,
 * the logical processor number is always zero; in dual core configurations, the
 * boot (or primary) core is assigned number 0 while the secondary core is defined
 * as number 1.
 */
/*!
 * @name Constants and macros for entire MSCM_CP1NUM register
 */
/*@{*/
#define MSCM_RD_CP1NUM(base)     (MSCM_CP1NUM_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1NUM bitfields
 */

/*!
 * @name Register MSCM_CP1NUM, field CPN[0] (RO)
 *
 * This zero-filled word defines the logical processor number for CPx If single
 * core configuration, then CPN = 0 If dual core configuration and boot (primary)
 * core, then CPN = 0 For secondary core, CPN = 1
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1NUM_CPN field. */
#define MSCM_RD_CP1NUM_CPN(base) ((MSCM_CP1NUM_REG(base) & MSCM_CP1NUM_CPN_MASK) >> MSCM_CP1NUM_CPN_SHIFT)
#define MSCM_BRD_CP1NUM_CPN(base) (BME_UBFX32(&MSCM_CP1NUM_REG(base), MSCM_CP1NUM_CPN_SHIFT, MSCM_CP1NUM_CPN_WIDTH))
/*@}*/

