pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * MSCM_CP1MASTER - Processor 1 Master Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1MASTER - Processor 1 Master Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the physical bus
 * master number the core making the access. The 32 bit response defines the
 * physical master number for processor x. A privileged read from the CM7 returns the
 * appropriate processor information. Reads from any other bus master return all
 * zeroes. Attempted user mode or write accesses are terminated with an error.
 */
/*!
 * @name Constants and macros for entire MSCM_CP1MASTER register
 */
/*@{*/
#define MSCM_RD_CP1MASTER(base)  (MSCM_CP1MASTER_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1MASTER bitfields
 */

/*!
 * @name Register MSCM_CP1MASTER, field PPN[5:0] (RO)
 *
 * This read-only field defines the physical port number for CPUx. For CPU0, PPN
 * = 0x00 For CPU1, PPN = 0x24
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1MASTER_PPN field. */
#define MSCM_RD_CP1MASTER_PPN(base) ((MSCM_CP1MASTER_REG(base) & MSCM_CP1MASTER_PPN_MASK) >> MSCM_CP1MASTER_PPN_SHIFT)
#define MSCM_BRD_CP1MASTER_PPN(base) (BME_UBFX32(&MSCM_CP1MASTER_REG(base), MSCM_CP1MASTER_PPN_SHIFT, MSCM_CP1MASTER_PPN_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP1COUNT - Processor 1 Count Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1COUNT - Processor 1 Count Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides a CPU-specific response indicating the total number of
 * processor cores in the chip configuration.
 */
/*!
 * @name Constants and macros for entire MSCM_CP1COUNT register
 */
/*@{*/
#define MSCM_RD_CP1COUNT(base)   (MSCM_CP1COUNT_REG(base))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1COUNT bitfields
 */

/*!
 * @name Register MSCM_CP1COUNT, field PCNT[1:0] (RO)
 *
 * This read-only field defines the processor count for the chip configuration:
 * If single core configuration, then PCNT = 00 If dual core configuration, then
 * PCNT = 01
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1COUNT_PCNT field. */
#define MSCM_RD_CP1COUNT_PCNT(base) ((MSCM_CP1COUNT_REG(base) & MSCM_CP1COUNT_PCNT_MASK) >> MSCM_CP1COUNT_PCNT_SHIFT)
#define MSCM_BRD_CP1COUNT_PCNT(base) (BME_UBFX32(&MSCM_CP1COUNT_REG(base), MSCM_CP1COUNT_PCNT_SHIFT, MSCM_CP1COUNT_PCNT_WIDTH))
/*@}*/

/*******************************************************************************
 * MSCM_CP1CFG - Processor 1 Configuration Register
 ******************************************************************************/

/*!
 * @brief MSCM_CP1CFG - Processor 1 Configuration Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register provides information on the Level 1 caches (if present).
 */
/*!
 * @name Constants and macros for entire MSCM_CP1CFG register
 */
/*@{*/
#define MSCM_RD_CP1CFG(base, index) (MSCM_CP1CFG_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual MSCM_CP1CFG bitfields
 */

/*!
 * @name Register MSCM_CP1CFG, field DCWY[7:0] (RO)
 *
 * This read-only field provides the number of cache ways for the Data Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1CFG_DCWY field. */
#define MSCM_RD_CP1CFG_DCWY(base, index) ((MSCM_CP1CFG_REG(base, index) & MSCM_CP1CFG_DCWY_MASK) >> MSCM_CP1CFG_DCWY_SHIFT)
#define MSCM_BRD_CP1CFG_DCWY(base, index) (BME_UBFX32(&MSCM_CP1CFG_REG(base, index), MSCM_CP1CFG_DCWY_SHIFT, MSCM_CP1CFG_DCWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP1CFG, field DCSZ[15:8] (RO)
 *
 * This read-only field provides an encoded value of the Data Cache size. The
 * capacity of the memory is expressed as Size [bytes] = 2(9+SZ),where SZ is
 * non-zero; a SZ = 0 indicates the memory is not present. if no Data Cache, then DCSZ
 * = 0x00 if a 4 Kbyte Data Cache, then DCSZ = 0x03 if an 8 Kbyte Data Cache,
 * then DCSZ = 0x04 if a 16 Kbyte Data Cache, then DCSZ = 0x05 if a 32 Kbyte Data
 * Cache, then DCSZ = 0x06 if a 64 Kbyte Data Cache, then DCSZ = 0x07 if a 128
 * Kbyte Data Cache, then DCSZ = 0x08 if a 256 Kbyte Data Cache, then DCSZ = 0x09 if
 * a 512 Kbyte Data Cache, then DCSZ = 0x0A
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1CFG_DCSZ field. */
#define MSCM_RD_CP1CFG_DCSZ(base, index) ((MSCM_CP1CFG_REG(base, index) & MSCM_CP1CFG_DCSZ_MASK) >> MSCM_CP1CFG_DCSZ_SHIFT)
#define MSCM_BRD_CP1CFG_DCSZ(base, index) (BME_UBFX32(&MSCM_CP1CFG_REG(base, index), MSCM_CP1CFG_DCSZ_SHIFT, MSCM_CP1CFG_DCSZ_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP1CFG, field ICWY[23:16] (RO)
 *
 * This read-only field provides the number of cache ways for the Instruction
 * Cache.
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1CFG_ICWY field. */
#define MSCM_RD_CP1CFG_ICWY(base, index) ((MSCM_CP1CFG_REG(base, index) & MSCM_CP1CFG_ICWY_MASK) >> MSCM_CP1CFG_ICWY_SHIFT)
#define MSCM_BRD_CP1CFG_ICWY(base, index) (BME_UBFX32(&MSCM_CP1CFG_REG(base, index), MSCM_CP1CFG_ICWY_SHIFT, MSCM_CP1CFG_ICWY_WIDTH))
/*@}*/

/*!
 * @name Register MSCM_CP1CFG, field ICSZ[31:24] (RO)
 *
 * This read-only field provides an encoded value of the Instruction Cache size.
 * The capacity of the memory is expressed as Size [bytes] = 2(9+SZ), where SZ
 * is non-zero; a SZ = 0 indicates the memory is not present. if no Instruction
 * Cache, then ICSZ = 0x00 if a 4 Kbyte Data Cache, then ICSZ = 0x03 if an 8 Kbyte
 * Data Cache, then ICSZ = 0x04 if a 16 Kbyte Data Cache, then ICSZ = 0x05 if a
 * 32 Kbyte Data Cache, then ICSZ = 0x06 if a 64 Kbyte Data Cache, then ICSZ =
 * 0x07 if a 128 Kbyte Data Cache, then ICSZ = 0x08 if a 256 Kbyte Data Cache, then
 * ICSZ = 0x09 if a 512 Kbyte Data Cache, then ICSZ = 0x0A
 */
/*@{*/
/*! @brief Read current value of the MSCM_CP1CFG_ICSZ field. */
#define MSCM_RD_CP1CFG_ICSZ(base, index) ((MSCM_CP1CFG_REG(base, index) & MSCM_CP1CFG_ICSZ_MASK) >> MSCM_CP1CFG_ICSZ_SHIFT)
#define MSCM_BRD_CP1CFG_ICSZ(base, index) (BME_UBFX32(&MSCM_CP1CFG_REG(base, index), MSCM_CP1CFG_ICSZ_SHIFT, MSCM_CP1CFG_ICSZ_WIDTH))
/*@}*/

