pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual PORT_GPCHR bitfields
 */

/*!
 * @name Register PORT_GPCHR, field GPWD[15:0] (WORZ)
 *
 * Write value that is written to all Pin Control Registers bits [15:0] that are
 * selected by GPWE.
 */
/*@{*/
/*! @brief Set the GPWD field to a new value. */
#define PORT_WR_GPCHR_GPWD(base, value) (PORT_RMW_GPCHR(base, PORT_GPCHR_GPWD_MASK, PORT_GPCHR_GPWD(value)))
#define PORT_BWR_GPCHR_GPWD(base, value) (PORT_WR_GPCHR_GPWD(base, value))
/*@}*/

/*!
 * @name Register PORT_GPCHR, field GPWE[31:16] (WORZ)
 *
 * Selects which Pin Control Registers (31 through 16) bits [15:0] update with
 * the value in GPWD. If a selected Pin Control Register is locked then the write
 * to that register is ignored.
 *
 * Values:
 * - 0b0000000000000000 - Corresponding Pin Control Register is not updated with
 *     the value in GPWD.
 * - 0b0000000000000001 - Corresponding Pin Control Register is updated with the
 *     value in GPWD.
 */
/*@{*/
/*! @brief Set the GPWE field to a new value. */
#define PORT_WR_GPCHR_GPWE(base, value) (PORT_RMW_GPCHR(base, PORT_GPCHR_GPWE_MASK, PORT_GPCHR_GPWE(value)))
#define PORT_BWR_GPCHR_GPWE(base, value) (PORT_WR_GPCHR_GPWE(base, value))
/*@}*/

/*******************************************************************************
 * PORT_GICLR - Global Interrupt Control Low Register
 ******************************************************************************/

/*!
 * @brief PORT_GICLR - Global Interrupt Control Low Register (WORZ)
 *
 * Reset value: 0x00000000U
 *
 * Only 32-bit writes are supported to this register.
 */
/*!
 * @name Constants and macros for entire PORT_GICLR register
 */
/*@{*/
#define PORT_RD_GICLR(base)      (PORT_GICLR_REG(base))
#define PORT_WR_GICLR(base, value) (PORT_GICLR_REG(base) = (value))
#define PORT_RMW_GICLR(base, mask, value) (PORT_WR_GICLR(base, (PORT_RD_GICLR(base) & ~(mask)) | (value)))
/*@}*/

/*
 * Constants & macros for individual PORT_GICLR bitfields
 */

/*!
 * @name Register PORT_GICLR, field GIWE[15:0] (WORZ)
 *
 * Selects which Pin Control Registers (15 through 0) bits [31:16] update with
 * the value in GIWD.
 *
 * Values:
 * - 0b0000000000000000 - Corresponding Pin Control Register is not updated with
 *     the value in GPWD.
 * - 0b0000000000000001 - Corresponding Pin Control Register is updated with the
 *     value in GPWD.
 */
/*@{*/
/*! @brief Set the GIWE field to a new value. */
#define PORT_WR_GICLR_GIWE(base, value) (PORT_RMW_GICLR(base, PORT_GICLR_GIWE_MASK, PORT_GICLR_GIWE(value)))
#define PORT_BWR_GICLR_GIWE(base, value) (PORT_WR_GICLR_GIWE(base, value))
/*@}*/

/*!
 * @name Register PORT_GICLR, field GIWD[31:16] (WORZ)
 *
 * Write value that is written to all Pin Control Registers bits [31:16] that
 * are selected by GIWE.
 */
/*@{*/
/*! @brief Set the GIWD field to a new value. */
#define PORT_WR_GICLR_GIWD(base, value) (PORT_RMW_GICLR(base, PORT_GICLR_GIWD_MASK, PORT_GICLR_GIWD(value)))
#define PORT_BWR_GICLR_GIWD(base, value) (PORT_WR_GICLR_GIWD(base, value))
/*@}*/

/*******************************************************************************
 * PORT_GICHR - Global Interrupt Control High Register
 ******************************************************************************/

/*!
 * @brief PORT_GICHR - Global Interrupt Control High Register (WORZ)
 *
 * Reset value: 0x00000000U
 *
 * Only 32-bit writes are supported to this register.
 */
/*!
 * @name Constants and macros for entire PORT_GICHR register
 */
/*@{*/
#define PORT_RD_GICHR(base)      (PORT_GICHR_REG(base))
#define PORT_WR_GICHR(base, value) (PORT_GICHR_REG(base) = (value))
#define PORT_RMW_GICHR(base, mask, value) (PORT_WR_GICHR(base, (PORT_RD_GICHR(base) & ~(mask)) | (value)))
/*@}*/

/*
 * Constants & macros for individual PORT_GICHR bitfields
 */

/*!
 * @name Register PORT_GICHR, field GIWE[15:0] (WORZ)
 *
 * Selects which Pin Control Registers (31 through 16) bits [31:16] update with
 * the value in GIWD.
 *
 * Values:
 * - 0b0000000000000000 - Corresponding Pin Control Register is not updated with
 *     the value in GPWD.
 * - 0b0000000000000001 - Corresponding Pin Control Register is updated with the
 *     value in GPWD.
 */
/*@{*/
/*! @brief Set the GIWE field to a new value. */
#define PORT_WR_GICHR_GIWE(base, value) (PORT_RMW_GICHR(base, PORT_GICHR_GIWE_MASK, PORT_GICHR_GIWE(value)))
#define PORT_BWR_GICHR_GIWE(base, value) (PORT_WR_GICHR_GIWE(base, value))
/*@}*/

/*!
 * @name Register PORT_GICHR, field GIWD[31:16] (WORZ)
 *
 * Write value that is written to all Pin Control Registers bits [31:16] that
 * are selected by GIWE.
 */
/*@{*/
/*! @brief Set the GIWD field to a new value. */
#define PORT_WR_GICHR_GIWD(base, value) (PORT_RMW_GICHR(base, PORT_GICHR_GIWD_MASK, PORT_GICHR_GIWD(value)))
#define PORT_BWR_GICHR_GIWD(base, value) (PORT_WR_GICHR_GIWD(base, value))
/*@}*/

/*******************************************************************************
 * PORT_ISFR - Interrupt Status Flag Register
 ******************************************************************************/

/*!
 * @brief PORT_ISFR - Interrupt Status Flag Register (W1C)
 *
 * Reset value: 0x00000000U
 *
 * The pin interrupt configuration is valid in all digital pin muxing modes. The
 * Interrupt Status Flag for each pin is also visible in the corresponding Pin
 * Control Register, and each flag can be cleared in either location.
 */
/*!
 * @name Constants and macros for entire PORT_ISFR register
 */
/*@{*/
#define PORT_RD_ISFR(base)       (PORT_ISFR_REG(base))
#define PORT_WR_ISFR(base, value) (PORT_ISFR_REG(base) = (value))
#define PORT_RMW_ISFR(base, mask, value) (PORT_WR_ISFR(base, (PORT_RD_ISFR(base) & ~(mask)) | (value)))
#define PORT_SET_ISFR(base, value) (BME_OR32(&PORT_ISFR_REG(base), (uint32_t)(value)))
#define PORT_CLR_ISFR(base, value) (BME_AND32(&PORT_ISFR_REG(base), (uint32_t)(~(value))))
#define PORT_TOG_ISFR(base, value) (BME_XOR32(&PORT_ISFR_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * PORT_DFER - Digital Filter Enable Register
 ******************************************************************************/

/*!
 * @brief PORT_DFER - Digital Filter Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The corresponding bit is read only for pins that do not support a digital
 * filter. Refer to the Chapter of Signal Multiplexing and Signal Descriptions for
 * the pins that support digital filter. The digital filter configuration is valid
 * in all digital pin muxing modes.
 */
/*!
 * @name Constants and macros for entire PORT_DFER register
 */
/*@{*/
#define PORT_RD_DFER(base)       (PORT_DFER_REG(base))
#define PORT_WR_DFER(base, value) (PORT_DFER_REG(base) = (value))
#define PORT_RMW_DFER(base, mask, value) (PORT_WR_DFER(base, (PORT_RD_DFER(base) & ~(mask)) | (value)))
#define PORT_SET_DFER(base, value) (BME_OR32(&PORT_DFER_REG(base), (uint32_t)(value)))
#define PORT_CLR_DFER(base, value) (BME_AND32(&PORT_DFER_REG(base), (uint32_t)(~(value))))
#define PORT_TOG_DFER(base, value) (BME_XOR32(&PORT_DFER_REG(base), (uint32_t)(value)))
/*@}*/

