pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the FORCE_SEL field to a new value. */
#define PWM_WR_CTRL2_FORCE_SEL(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_FORCE_SEL_MASK, PWM_CTRL2_FORCE_SEL(value)))
#define PWM_BWR_CTRL2_FORCE_SEL(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_FORCE_SEL_SHIFT), PWM_CTRL2_FORCE_SEL_SHIFT, PWM_CTRL2_FORCE_SEL_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field FORCE[6] (WORZ)
 *
 * If CTRL2[FORCE_SEL] is set to 000, writing a 1 to this bit results in a
 * FORCE_OUT event. This causes the following actions to be taken: The PWM_A and PWM_B
 * output pins will assume values based on DTSRCSEL[SMxSEL23] and
 * DTSRCSEL[SMxSEL45]. If CTRL2[FRCEN] is set, the counter value will be initialized with the
 * INIT register value.
 */
/*@{*/
/*! @brief Set the FORCE field to a new value. */
#define PWM_WR_CTRL2_FORCE(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_FORCE_MASK, PWM_CTRL2_FORCE(value)))
#define PWM_BWR_CTRL2_FORCE(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_FORCE_SHIFT), PWM_CTRL2_FORCE_SHIFT, PWM_CTRL2_FORCE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field FRCEN[7] (RW)
 *
 * This bit allows the CTRL2[FORCE] signal to initialize the counter without
 * regard to the signal selected by CTRL2[INIT_SEL]. This is a software controlled
 * initialization.
 *
 * Values:
 * - 0b0 - Initialization from a FORCE_OUT event is disabled.
 * - 0b1 - Initialization from a FORCE_OUT event is enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_FRCEN field. */
#define PWM_RD_CTRL2_FRCEN(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_FRCEN_MASK) >> PWM_CTRL2_FRCEN_SHIFT)
#define PWM_BRD_CTRL2_FRCEN(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_FRCEN_SHIFT, PWM_CTRL2_FRCEN_WIDTH))

/*! @brief Set the FRCEN field to a new value. */
#define PWM_WR_CTRL2_FRCEN(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_FRCEN_MASK, PWM_CTRL2_FRCEN(value)))
#define PWM_BWR_CTRL2_FRCEN(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_FRCEN_SHIFT), PWM_CTRL2_FRCEN_SHIFT, PWM_CTRL2_FRCEN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field INIT_SEL[9:8] (RW)
 *
 * These read/write bits control the source of the INIT signal which goes to the
 * counter.
 *
 * Values:
 * - 0b00 - Local sync (PWM_X) causes initialization.
 * - 0b01 - Master reload from submodule 0 causes initialization. This setting
 *     should not be used in submodule 0 as it will force the INIT signal to logic
 *     0. The submodule counter will only reinitialize when a master reload
 *     occurs.
 * - 0b10 - Master sync from submodule 0 causes initialization. This setting
 *     should not be used in submodule 0 as it will force the INIT signal to logic 0.
 * - 0b11 - EXT_SYNC causes initialization.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_INIT_SEL field. */
#define PWM_RD_CTRL2_INIT_SEL(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_INIT_SEL_MASK) >> PWM_CTRL2_INIT_SEL_SHIFT)
#define PWM_BRD_CTRL2_INIT_SEL(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_INIT_SEL_SHIFT, PWM_CTRL2_INIT_SEL_WIDTH))

/*! @brief Set the INIT_SEL field to a new value. */
#define PWM_WR_CTRL2_INIT_SEL(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_INIT_SEL_MASK, PWM_CTRL2_INIT_SEL(value)))
#define PWM_BWR_CTRL2_INIT_SEL(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_INIT_SEL_SHIFT), PWM_CTRL2_INIT_SEL_SHIFT, PWM_CTRL2_INIT_SEL_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field PWMX_INIT[10] (RW)
 *
 * This read/write bit determines the initial value for PWM_X and the value to
 * which it is forced when FORCE_INIT is asserted.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_PWMX_INIT field. */
#define PWM_RD_CTRL2_PWMX_INIT(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_PWMX_INIT_MASK) >> PWM_CTRL2_PWMX_INIT_SHIFT)
#define PWM_BRD_CTRL2_PWMX_INIT(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_PWMX_INIT_SHIFT, PWM_CTRL2_PWMX_INIT_WIDTH))

/*! @brief Set the PWMX_INIT field to a new value. */
#define PWM_WR_CTRL2_PWMX_INIT(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_PWMX_INIT_MASK, PWM_CTRL2_PWMX_INIT(value)))
#define PWM_BWR_CTRL2_PWMX_INIT(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_PWMX_INIT_SHIFT), PWM_CTRL2_PWMX_INIT_SHIFT, PWM_CTRL2_PWMX_INIT_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field PWM45_INIT[11] (RW)
 *
 * This read/write bit determines the initial value for PWM45 and the value to
 * which it is forced when FORCE_INIT is asserted.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_PWM45_INIT field. */
#define PWM_RD_CTRL2_PWM45_INIT(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_PWM45_INIT_MASK) >> PWM_CTRL2_PWM45_INIT_SHIFT)
#define PWM_BRD_CTRL2_PWM45_INIT(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_PWM45_INIT_SHIFT, PWM_CTRL2_PWM45_INIT_WIDTH))

/*! @brief Set the PWM45_INIT field to a new value. */
#define PWM_WR_CTRL2_PWM45_INIT(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_PWM45_INIT_MASK, PWM_CTRL2_PWM45_INIT(value)))
#define PWM_BWR_CTRL2_PWM45_INIT(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_PWM45_INIT_SHIFT), PWM_CTRL2_PWM45_INIT_SHIFT, PWM_CTRL2_PWM45_INIT_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field PWM23_INIT[12] (RW)
 *
 * This read/write bit determines the initial value for PWM23 and the value to
 * which it is forced when FORCE_INIT is asserted.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_PWM23_INIT field. */
#define PWM_RD_CTRL2_PWM23_INIT(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_PWM23_INIT_MASK) >> PWM_CTRL2_PWM23_INIT_SHIFT)
#define PWM_BRD_CTRL2_PWM23_INIT(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_PWM23_INIT_SHIFT, PWM_CTRL2_PWM23_INIT_WIDTH))

/*! @brief Set the PWM23_INIT field to a new value. */
#define PWM_WR_CTRL2_PWM23_INIT(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_PWM23_INIT_MASK, PWM_CTRL2_PWM23_INIT(value)))
#define PWM_BWR_CTRL2_PWM23_INIT(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_PWM23_INIT_SHIFT), PWM_CTRL2_PWM23_INIT_SHIFT, PWM_CTRL2_PWM23_INIT_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field INDEP[13] (RW)
 *
 * This bit determines if the PWM_A and PWM_B channels will be independent PWMs
 * or a complementary PWM pair.
 *
 * Values:
 * - 0b0 - PWM_A and PWM_B form a complementary PWM pair.
 * - 0b1 - PWM_A and PWM_B outputs are independent PWMs.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_INDEP field. */
#define PWM_RD_CTRL2_INDEP(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_INDEP_MASK) >> PWM_CTRL2_INDEP_SHIFT)
#define PWM_BRD_CTRL2_INDEP(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_INDEP_SHIFT, PWM_CTRL2_INDEP_WIDTH))

/*! @brief Set the INDEP field to a new value. */
#define PWM_WR_CTRL2_INDEP(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_INDEP_MASK, PWM_CTRL2_INDEP(value)))
#define PWM_BWR_CTRL2_INDEP(base, index, value) (BME_BFI16(&PWM_CTRL2_REG(base, index), ((uint16_t)(value) << PWM_CTRL2_INDEP_SHIFT), PWM_CTRL2_INDEP_SHIFT, PWM_CTRL2_INDEP_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field WAITEN[14] (RW)
 *
 * When set to one, the PWM will continue to run while the chip is in WAIT mode.
 * In this mode, the peripheral clock continues to run but the CPU clock does
 * not. If the device enters WAIT mode and this bit is zero, then the PWM outputs
 * will be disabled until WAIT mode is exited. At that point the PWM pins will
 * resume operation as programmed in the PWM registers. For certain types of motors
 * (such as 3-phase AC), it is imperative that this bit be left in its default
 * state (in which the PWM is disabled in WAIT mode). Failure to do so could result
 * in damage to the motor or inverter. For other types of motors (example: DC
 * motors), this bit might safely be set to one, enabling the PWM in WAIT mode. The
 * key point is PWM parameter updates will not occur in this mode. Any motors
 * requiring such updates should be disabled during WAIT mode. If in doubt, leave
 * this bit set to zero.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_WAITEN field. */
#define PWM_RD_CTRL2_WAITEN(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_WAITEN_MASK) >> PWM_CTRL2_WAITEN_SHIFT)
#define PWM_BRD_CTRL2_WAITEN(base, index) (BME_UBFX16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_WAITEN_SHIFT, PWM_CTRL2_WAITEN_WIDTH))

