pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the FRACVAL4 field to a new value. */
#define PWM_WR_FRACVAL4_FRACVAL4(base, index, value) (PWM_RMW_FRACVAL4(base, index, PWM_FRACVAL4_FRACVAL4_MASK, PWM_FRACVAL4_FRACVAL4(value)))
#define PWM_BWR_FRACVAL4_FRACVAL4(base, index, value) (BME_BFI16(&PWM_FRACVAL4_REG(base, index), ((uint16_t)(value) << PWM_FRACVAL4_FRACVAL4_SHIFT), PWM_FRACVAL4_FRACVAL4_SHIFT, PWM_FRACVAL4_FRACVAL4_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_VAL4 - Value Register 4
 ******************************************************************************/

/*!
 * @brief PWM_VAL4 - Value Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL4 register
 */
/*@{*/
#define PWM_RD_VAL4(base, index) (PWM_VAL4_REG(base, index))
#define PWM_WR_VAL4(base, index, value) (PWM_VAL4_REG(base, index) = (value))
#define PWM_RMW_VAL4(base, index, mask, value) (PWM_WR_VAL4(base, index, (PWM_RD_VAL4(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL4(base, index, value) (BME_OR16(&PWM_VAL4_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_VAL4(base, index, value) (BME_AND16(&PWM_VAL4_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_VAL4(base, index, value) (BME_XOR16(&PWM_VAL4_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL5 - Fractional Value Register 5
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL5 - Fractional Value Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL5 register
 */
/*@{*/
#define PWM_RD_FRACVAL5(base, index) (PWM_FRACVAL5_REG(base, index))
#define PWM_WR_FRACVAL5(base, index, value) (PWM_FRACVAL5_REG(base, index) = (value))
#define PWM_RMW_FRACVAL5(base, index, mask, value) (PWM_WR_FRACVAL5(base, index, (PWM_RD_FRACVAL5(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL5(base, index, value) (BME_OR16(&PWM_FRACVAL5_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_FRACVAL5(base, index, value) (BME_AND16(&PWM_FRACVAL5_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_FRACVAL5(base, index, value) (BME_XOR16(&PWM_FRACVAL5_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL5 bitfields
 */

/*!
 * @name Register PWM_FRACVAL5, field FRACVAL5[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL5 register
 * which controls the PWM_B turn off timing. It is also used to control the
 * fractional addition to the turn on delay of PWM_A when MCTRL[IPOLx]=1 in complementary
 * mode, CTRL2[INDEP]=0. The FRACVAL5 register is buffered. The value written
 * does not take effect until MCTRL[LDOK] is set and the next PWM load cycle begins
 * or CTRL[LDMOD] is set. FRACVAL5 cannot be written when MCTRL[LDOK] is set.
 * Reading FRACVAL5 reads the value in a buffer and not necessarily the value the
 * PWM generator is currently using. FRCTRL[FRAC45_EN] should be set to 0 when the
 * values of VAL4 and VAL5 cause the high or low time of the PWM output to be 3
 * cycles or less.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL5_FRACVAL5 field. */
#define PWM_RD_FRACVAL5_FRACVAL5(base, index) ((PWM_FRACVAL5_REG(base, index) & PWM_FRACVAL5_FRACVAL5_MASK) >> PWM_FRACVAL5_FRACVAL5_SHIFT)
#define PWM_BRD_FRACVAL5_FRACVAL5(base, index) (BME_UBFX16(&PWM_FRACVAL5_REG(base, index), PWM_FRACVAL5_FRACVAL5_SHIFT, PWM_FRACVAL5_FRACVAL5_WIDTH))

/*! @brief Set the FRACVAL5 field to a new value. */
#define PWM_WR_FRACVAL5_FRACVAL5(base, index, value) (PWM_RMW_FRACVAL5(base, index, PWM_FRACVAL5_FRACVAL5_MASK, PWM_FRACVAL5_FRACVAL5(value)))
#define PWM_BWR_FRACVAL5_FRACVAL5(base, index, value) (BME_BFI16(&PWM_FRACVAL5_REG(base, index), ((uint16_t)(value) << PWM_FRACVAL5_FRACVAL5_SHIFT), PWM_FRACVAL5_FRACVAL5_SHIFT, PWM_FRACVAL5_FRACVAL5_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_VAL5 - Value Register 5
 ******************************************************************************/

/*!
 * @brief PWM_VAL5 - Value Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL5 register
 */
/*@{*/
#define PWM_RD_VAL5(base, index) (PWM_VAL5_REG(base, index))
#define PWM_WR_VAL5(base, index, value) (PWM_VAL5_REG(base, index) = (value))
#define PWM_RMW_VAL5(base, index, mask, value) (PWM_WR_VAL5(base, index, (PWM_RD_VAL5(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL5(base, index, value) (BME_OR16(&PWM_VAL5_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_VAL5(base, index, value) (BME_AND16(&PWM_VAL5_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_VAL5(base, index, value) (BME_XOR16(&PWM_VAL5_REG(base, index), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * PWM_FRCTRL - Fractional Control Register
 ******************************************************************************/

/*!
 * @brief PWM_FRCTRL - Fractional Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRCTRL register
 */
/*@{*/
#define PWM_RD_FRCTRL(base, index) (PWM_FRCTRL_REG(base, index))
#define PWM_WR_FRCTRL(base, index, value) (PWM_FRCTRL_REG(base, index) = (value))
#define PWM_RMW_FRCTRL(base, index, mask, value) (PWM_WR_FRCTRL(base, index, (PWM_RD_FRCTRL(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRCTRL(base, index, value) (BME_OR16(&PWM_FRCTRL_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_FRCTRL(base, index, value) (BME_AND16(&PWM_FRCTRL_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_FRCTRL(base, index, value) (BME_XOR16(&PWM_FRCTRL_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRCTRL bitfields
 */

/*!
 * @name Register PWM_FRCTRL, field FRAC1_EN[1] (RW)
 *
 * This bit is used to enable the fractional cycle length of the PWM period
 * using the FRACVAL1 register. When disabled, the fractional cycle length of the PWM
 * period is bypassed. The FRAC1_EN bit is buffered. The value written does not
 * take effect until MCTRL[LDOK] is set and the next PWM load cycle begins or
 * CTRL[LDMOD] is set. FRAC1_EN cannot be written when MCTRL[LDOK] is set. Reading
 * FRAC1_EN reads the value in a buffer and not necessarily the value the PWM
 * generator is currently using.
 *
 * Values:
 * - 0b0 - Disable fractional cycle length for the PWM period.
 * - 0b1 - Enable fractional cycle length for the PWM period.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_FRAC1_EN field. */
#define PWM_RD_FRCTRL_FRAC1_EN(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_FRAC1_EN_MASK) >> PWM_FRCTRL_FRAC1_EN_SHIFT)
#define PWM_BRD_FRCTRL_FRAC1_EN(base, index) (BME_UBFX16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC1_EN_SHIFT, PWM_FRCTRL_FRAC1_EN_WIDTH))

/*! @brief Set the FRAC1_EN field to a new value. */
#define PWM_WR_FRCTRL_FRAC1_EN(base, index, value) (PWM_RMW_FRCTRL(base, index, PWM_FRCTRL_FRAC1_EN_MASK, PWM_FRCTRL_FRAC1_EN(value)))
#define PWM_BWR_FRCTRL_FRAC1_EN(base, index, value) (BME_BFI16(&PWM_FRCTRL_REG(base, index), ((uint16_t)(value) << PWM_FRCTRL_FRAC1_EN_SHIFT), PWM_FRCTRL_FRAC1_EN_SHIFT, PWM_FRCTRL_FRAC1_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FRCTRL, field FRAC23_EN[2] (RW)
 *
 * This bit is used to enable the fractional cycle edge placement of PWM_A using
 * the FRACVAL2 and FRACVAL3 registers. When disabled, the fractional cycle edge
 * placement of PWM_A is bypassed. The FRAC23_EN bit is buffered. The value
 * written does not take effect until MCTRL[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. FRAC23_EN cannot be written when MCTRL[LDOK] is
 * set. Reading FRAC23_EN reads the value in a buffer and not necessarily the
 * value the PWM generator is currently using.
 *
 * Values:
 * - 0b0 - Disable fractional cycle placement for PWM_A.
 * - 0b1 - Enable fractional cycle placement for PWM_A.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_FRAC23_EN field. */
#define PWM_RD_FRCTRL_FRAC23_EN(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_FRAC23_EN_MASK) >> PWM_FRCTRL_FRAC23_EN_SHIFT)
#define PWM_BRD_FRCTRL_FRAC23_EN(base, index) (BME_UBFX16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC23_EN_SHIFT, PWM_FRCTRL_FRAC23_EN_WIDTH))

/*! @brief Set the FRAC23_EN field to a new value. */
#define PWM_WR_FRCTRL_FRAC23_EN(base, index, value) (PWM_RMW_FRCTRL(base, index, PWM_FRCTRL_FRAC23_EN_MASK, PWM_FRCTRL_FRAC23_EN(value)))
#define PWM_BWR_FRCTRL_FRAC23_EN(base, index, value) (BME_BFI16(&PWM_FRCTRL_REG(base, index), ((uint16_t)(value) << PWM_FRCTRL_FRAC23_EN_SHIFT), PWM_FRCTRL_FRAC23_EN_SHIFT, PWM_FRCTRL_FRAC23_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FRCTRL, field FRAC45_EN[4] (RW)
 *
 * This bit is used to enable the fractional cycle edge placement of PWM_B using
 * the FRACVAL4 and FRACVAL5 registers. When disabled, the fractional cycle edge
 * placement of PWM_B is bypassed. The FRAC45_EN bit is buffered. The value
 * written does not take effect until MCTRL[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. FRAC45_EN cannot be written when MCTRL[LDOK] is
 * set. Reading FRAC45_EN reads the value in a buffer and not necessarily the
 * value the PWM generator is currently using.
 *
 * Values:
 * - 0b0 - Disable fractional cycle placement for PWM_B.
 * - 0b1 - Enable fractional cycle placement for PWM_B.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_FRAC45_EN field. */
#define PWM_RD_FRCTRL_FRAC45_EN(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_FRAC45_EN_MASK) >> PWM_FRCTRL_FRAC45_EN_SHIFT)
#define PWM_BRD_FRCTRL_FRAC45_EN(base, index) (BME_UBFX16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC45_EN_SHIFT, PWM_FRCTRL_FRAC45_EN_WIDTH))

