pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the CA1IE field to a new value. */
#define PWM_WR_INTEN_CA1IE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_CA1IE_MASK, PWM_INTEN_CA1IE(value)))
#define PWM_BWR_INTEN_CA1IE(base, index, value) (BME_BFI16(&PWM_INTEN_REG(base, index), ((uint16_t)(value) << PWM_INTEN_CA1IE_SHIFT), PWM_INTEN_CA1IE_SHIFT, PWM_INTEN_CA1IE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_INTEN, field RIE[12] (RW)
 *
 * This read/write bit enables the reload flag, STS[RF], to generate CPU
 * interrupt requests. Reset clears this bit.
 *
 * Values:
 * - 0b0 - STS[RF] CPU interrupt requests disabled
 * - 0b1 - STS[RF] CPU interrupt requests enabled
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_RIE field. */
#define PWM_RD_INTEN_RIE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_RIE_MASK) >> PWM_INTEN_RIE_SHIFT)
#define PWM_BRD_INTEN_RIE(base, index) (BME_UBFX16(&PWM_INTEN_REG(base, index), PWM_INTEN_RIE_SHIFT, PWM_INTEN_RIE_WIDTH))

/*! @brief Set the RIE field to a new value. */
#define PWM_WR_INTEN_RIE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_RIE_MASK, PWM_INTEN_RIE(value)))
#define PWM_BWR_INTEN_RIE(base, index, value) (BME_BFI16(&PWM_INTEN_REG(base, index), ((uint16_t)(value) << PWM_INTEN_RIE_SHIFT), PWM_INTEN_RIE_SHIFT, PWM_INTEN_RIE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_INTEN, field REIE[13] (RW)
 *
 * This read/write bit enables the reload error flag, STS[REF], to generate CPU
 * interrupt requests. Reset clears this bit.
 *
 * Values:
 * - 0b0 - STS[REF] CPU interrupt requests disabled
 * - 0b1 - STS[REF] CPU interrupt requests enabled
 */
/*@{*/
/*! @brief Read current value of the PWM_INTEN_REIE field. */
#define PWM_RD_INTEN_REIE(base, index) ((PWM_INTEN_REG(base, index) & PWM_INTEN_REIE_MASK) >> PWM_INTEN_REIE_SHIFT)
#define PWM_BRD_INTEN_REIE(base, index) (BME_UBFX16(&PWM_INTEN_REG(base, index), PWM_INTEN_REIE_SHIFT, PWM_INTEN_REIE_WIDTH))

/*! @brief Set the REIE field to a new value. */
#define PWM_WR_INTEN_REIE(base, index, value) (PWM_RMW_INTEN(base, index, PWM_INTEN_REIE_MASK, PWM_INTEN_REIE(value)))
#define PWM_BWR_INTEN_REIE(base, index, value) (BME_BFI16(&PWM_INTEN_REG(base, index), ((uint16_t)(value) << PWM_INTEN_REIE_SHIFT), PWM_INTEN_REIE_SHIFT, PWM_INTEN_REIE_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_DMAEN - DMA Enable Register
 ******************************************************************************/

/*!
 * @brief PWM_DMAEN - DMA Enable Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_DMAEN register
 */
/*@{*/
#define PWM_RD_DMAEN(base, index) (PWM_DMAEN_REG(base, index))
#define PWM_WR_DMAEN(base, index, value) (PWM_DMAEN_REG(base, index) = (value))
#define PWM_RMW_DMAEN(base, index, mask, value) (PWM_WR_DMAEN(base, index, (PWM_RD_DMAEN(base, index) & ~(mask)) | (value)))
#define PWM_SET_DMAEN(base, index, value) (BME_OR16(&PWM_DMAEN_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_DMAEN(base, index, value) (BME_AND16(&PWM_DMAEN_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_DMAEN(base, index, value) (BME_XOR16(&PWM_DMAEN_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_DMAEN bitfields
 */

/*!
 * @name Register PWM_DMAEN, field CX0DE[0] (RW)
 *
 * This read/write bit enables DMA read requests for the Capture X0 FIFO data
 * when STS[CFX0] is set. Reset clears this bit. Do not set both this bit and
 * INTEN[CX0IE].
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_CX0DE field. */
#define PWM_RD_DMAEN_CX0DE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_CX0DE_MASK) >> PWM_DMAEN_CX0DE_SHIFT)
#define PWM_BRD_DMAEN_CX0DE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_CX0DE_SHIFT, PWM_DMAEN_CX0DE_WIDTH))

/*! @brief Set the CX0DE field to a new value. */
#define PWM_WR_DMAEN_CX0DE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_CX0DE_MASK, PWM_DMAEN_CX0DE(value)))
#define PWM_BWR_DMAEN_CX0DE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_CX0DE_SHIFT), PWM_DMAEN_CX0DE_SHIFT, PWM_DMAEN_CX0DE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field CX1DE[1] (RW)
 *
 * This read/write bit enables DMA read requests for the Capture X1 FIFO data
 * when STS[CFX1] is set. Reset clears this bit. Do not set both this bit and
 * INTEN[CX1IE].
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_CX1DE field. */
#define PWM_RD_DMAEN_CX1DE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_CX1DE_MASK) >> PWM_DMAEN_CX1DE_SHIFT)
#define PWM_BRD_DMAEN_CX1DE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_CX1DE_SHIFT, PWM_DMAEN_CX1DE_WIDTH))

/*! @brief Set the CX1DE field to a new value. */
#define PWM_WR_DMAEN_CX1DE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_CX1DE_MASK, PWM_DMAEN_CX1DE(value)))
#define PWM_BWR_DMAEN_CX1DE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_CX1DE_SHIFT), PWM_DMAEN_CX1DE_SHIFT, PWM_DMAEN_CX1DE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field CB0DE[2] (RW)
 *
 * This read/write bit enables DMA read requests for the Capture B0 FIFO data
 * when STS[CFB0] is set. Reset clears this bit. Do not set both this bit and
 * INTEN[CB0IE].
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_CB0DE field. */
#define PWM_RD_DMAEN_CB0DE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_CB0DE_MASK) >> PWM_DMAEN_CB0DE_SHIFT)
#define PWM_BRD_DMAEN_CB0DE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_CB0DE_SHIFT, PWM_DMAEN_CB0DE_WIDTH))

/*! @brief Set the CB0DE field to a new value. */
#define PWM_WR_DMAEN_CB0DE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_CB0DE_MASK, PWM_DMAEN_CB0DE(value)))
#define PWM_BWR_DMAEN_CB0DE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_CB0DE_SHIFT), PWM_DMAEN_CB0DE_SHIFT, PWM_DMAEN_CB0DE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field CB1DE[3] (RW)
 *
 * This read/write bit enables DMA read requests for the Capture B1 FIFO data
 * when STS[CFB1] is set. Reset clears this bit. Do not set both this bit and
 * INTEN[CB1IE].
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_CB1DE field. */
#define PWM_RD_DMAEN_CB1DE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_CB1DE_MASK) >> PWM_DMAEN_CB1DE_SHIFT)
#define PWM_BRD_DMAEN_CB1DE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_CB1DE_SHIFT, PWM_DMAEN_CB1DE_WIDTH))

/*! @brief Set the CB1DE field to a new value. */
#define PWM_WR_DMAEN_CB1DE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_CB1DE_MASK, PWM_DMAEN_CB1DE(value)))
#define PWM_BWR_DMAEN_CB1DE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_CB1DE_SHIFT), PWM_DMAEN_CB1DE_SHIFT, PWM_DMAEN_CB1DE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field CA0DE[4] (RW)
 *
 * This read/write bit enables DMA read requests for the Capture A0 FIFO data
 * when STS[CFA0] is set. Reset clears this bit. Do not set both this bit and
 * INTEN[CA0IE].
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_CA0DE field. */
#define PWM_RD_DMAEN_CA0DE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_CA0DE_MASK) >> PWM_DMAEN_CA0DE_SHIFT)
#define PWM_BRD_DMAEN_CA0DE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_CA0DE_SHIFT, PWM_DMAEN_CA0DE_WIDTH))

/*! @brief Set the CA0DE field to a new value. */
#define PWM_WR_DMAEN_CA0DE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_CA0DE_MASK, PWM_DMAEN_CA0DE(value)))
#define PWM_BWR_DMAEN_CA0DE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_CA0DE_SHIFT), PWM_DMAEN_CA0DE_SHIFT, PWM_DMAEN_CA0DE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field CA1DE[5] (RW)
 *
 * This read/write bit enables DMA read requests for the Capture A1 FIFO data
 * when STS[CFA1] is set. Reset clears this bit. Do not set both this bit and
 * INTEN[CA1IE].
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_CA1DE field. */
#define PWM_RD_DMAEN_CA1DE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_CA1DE_MASK) >> PWM_DMAEN_CA1DE_SHIFT)
#define PWM_BRD_DMAEN_CA1DE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_CA1DE_SHIFT, PWM_DMAEN_CA1DE_WIDTH))

/*! @brief Set the CA1DE field to a new value. */
#define PWM_WR_DMAEN_CA1DE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_CA1DE_MASK, PWM_DMAEN_CA1DE(value)))
#define PWM_BWR_DMAEN_CA1DE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_CA1DE_SHIFT), PWM_DMAEN_CA1DE_SHIFT, PWM_DMAEN_CA1DE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field CAPTDE[7:6] (RW)
 *
 * These read/write bits select the source of enabling the DMA read requests for
 * the capture FIFOs. Reset clears these bits.
 *
 * Values:
 * - 0b00 - Read DMA requests disabled.
 * - 0b01 - Exceeding a FIFO watermark sets the DMA read request. This requires
 *     at least one of DMAEN[CA1DE], DMAEN[CA0DE], DMAEN[CB1DE], DMAEN[CB0DE],
 *     DMAEN[CX1DE], or DMAEN[CX0DE] to also be set in order to determine to which
 *     watermark(s) the DMA request is sensitive.
 * - 0b10 - A local sync (VAL1 matches counter) sets the read DMA request.
 * - 0b11 - A local reload (STS[RF] being set) sets the read DMA request.
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_CAPTDE field. */
#define PWM_RD_DMAEN_CAPTDE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_CAPTDE_MASK) >> PWM_DMAEN_CAPTDE_SHIFT)
#define PWM_BRD_DMAEN_CAPTDE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_CAPTDE_SHIFT, PWM_DMAEN_CAPTDE_WIDTH))

/*! @brief Set the CAPTDE field to a new value. */
#define PWM_WR_DMAEN_CAPTDE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_CAPTDE_MASK, PWM_DMAEN_CAPTDE(value)))
#define PWM_BWR_DMAEN_CAPTDE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_CAPTDE_SHIFT), PWM_DMAEN_CAPTDE_SHIFT, PWM_DMAEN_CAPTDE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field FAND[8] (RW)
 *
 * This read/write bit works in conjunction with the DMAEN[CAPTDE] field when it
 * is set to watermark mode (DMAEN[CAPTDE] = 01). While DMAEN[CAxDE],
 * DMAEN[CBxDE], and DMAEN[CXxDE] determine which FIFO watermarks the DMA read request is
 * sensitive to, this bit determines if the selected watermarks are AND'ed
 * together or OR'ed together in order to create the request.
 *
 * Values:
 * - 0b0 - Selected FIFO watermarks are OR'ed together.
 * - 0b1 - Selected FIFO watermarks are AND'ed together.
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_FAND field. */
#define PWM_RD_DMAEN_FAND(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_FAND_MASK) >> PWM_DMAEN_FAND_SHIFT)
#define PWM_BRD_DMAEN_FAND(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_FAND_SHIFT, PWM_DMAEN_FAND_WIDTH))

