pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the FAND field to a new value. */
#define PWM_WR_DMAEN_FAND(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_FAND_MASK, PWM_DMAEN_FAND(value)))
#define PWM_BWR_DMAEN_FAND(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_FAND_SHIFT), PWM_DMAEN_FAND_SHIFT, PWM_DMAEN_FAND_WIDTH))
/*@}*/

/*!
 * @name Register PWM_DMAEN, field VALDE[9] (RW)
 *
 * This read/write bit enables DMA write requests for the VALx and FRACVALx
 * registers when STS[RF] is set. Reset clears this bit.
 *
 * Values:
 * - 0b0 - DMA write requests disabled
 * - 0b1 - DMA write requests for the VALx and FRACVALx registers enabled
 */
/*@{*/
/*! @brief Read current value of the PWM_DMAEN_VALDE field. */
#define PWM_RD_DMAEN_VALDE(base, index) ((PWM_DMAEN_REG(base, index) & PWM_DMAEN_VALDE_MASK) >> PWM_DMAEN_VALDE_SHIFT)
#define PWM_BRD_DMAEN_VALDE(base, index) (BME_UBFX16(&PWM_DMAEN_REG(base, index), PWM_DMAEN_VALDE_SHIFT, PWM_DMAEN_VALDE_WIDTH))

/*! @brief Set the VALDE field to a new value. */
#define PWM_WR_DMAEN_VALDE(base, index, value) (PWM_RMW_DMAEN(base, index, PWM_DMAEN_VALDE_MASK, PWM_DMAEN_VALDE(value)))
#define PWM_BWR_DMAEN_VALDE(base, index, value) (BME_BFI16(&PWM_DMAEN_REG(base, index), ((uint16_t)(value) << PWM_DMAEN_VALDE_SHIFT), PWM_DMAEN_VALDE_SHIFT, PWM_DMAEN_VALDE_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_TCTRL - Output Trigger Control Register
 ******************************************************************************/

/*!
 * @brief PWM_TCTRL - Output Trigger Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_TCTRL register
 */
/*@{*/
#define PWM_RD_TCTRL(base, index) (PWM_TCTRL_REG(base, index))
#define PWM_WR_TCTRL(base, index, value) (PWM_TCTRL_REG(base, index) = (value))
#define PWM_RMW_TCTRL(base, index, mask, value) (PWM_WR_TCTRL(base, index, (PWM_RD_TCTRL(base, index) & ~(mask)) | (value)))
#define PWM_SET_TCTRL(base, index, value) (BME_OR16(&PWM_TCTRL_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_TCTRL(base, index, value) (BME_AND16(&PWM_TCTRL_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_TCTRL(base, index, value) (BME_XOR16(&PWM_TCTRL_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_TCTRL bitfields
 */

/*!
 * @name Register PWM_TCTRL, field OUT_TRIG_EN[5:0] (RW)
 *
 * These bits enable the generation of PWM_OUT_TRIG0 and PWM_OUT_TRIG1 outputs
 * based on the counter value matching the value in one or more of the VAL0-5
 * registers. VAL0, VAL2, and VAL4 are used to generate PWM_OUT_TRIG0, and VAL1,
 * VAL3, and VAL5 are used to generate PWM_OUT_TRIG1. The PWM_OUT_TRIGx signals are
 * only asserted as long as the counter value matches the VALx value; therefore,
 * up to six triggers can be generated (three each on PWM_OUT_TRIG0 and
 * PWM_OUT_TRIG1) per PWM cycle per submodule. Due to delays in creating the PWM outputs,
 * the output trigger signals will lead the PWM output edges by 2-3 clock cycles
 * depending on the fractional cycle value being used.
 *
 * Values:
 * - 0b000000 - PWM_OUT_TRIGx will not set when the counter value matches the
 *     VALx value.
 * - 0b000001 - PWM_OUT_TRIGx will set when the counter value matches the VALx
 *     value.
 */
/*@{*/
/*! @brief Read current value of the PWM_TCTRL_OUT_TRIG_EN field. */
#define PWM_RD_TCTRL_OUT_TRIG_EN(base, index) ((PWM_TCTRL_REG(base, index) & PWM_TCTRL_OUT_TRIG_EN_MASK) >> PWM_TCTRL_OUT_TRIG_EN_SHIFT)
#define PWM_BRD_TCTRL_OUT_TRIG_EN(base, index) (BME_UBFX16(&PWM_TCTRL_REG(base, index), PWM_TCTRL_OUT_TRIG_EN_SHIFT, PWM_TCTRL_OUT_TRIG_EN_WIDTH))

/*! @brief Set the OUT_TRIG_EN field to a new value. */
#define PWM_WR_TCTRL_OUT_TRIG_EN(base, index, value) (PWM_RMW_TCTRL(base, index, PWM_TCTRL_OUT_TRIG_EN_MASK, PWM_TCTRL_OUT_TRIG_EN(value)))
#define PWM_BWR_TCTRL_OUT_TRIG_EN(base, index, value) (BME_BFI16(&PWM_TCTRL_REG(base, index), ((uint16_t)(value) << PWM_TCTRL_OUT_TRIG_EN_SHIFT), PWM_TCTRL_OUT_TRIG_EN_SHIFT, PWM_TCTRL_OUT_TRIG_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_TCTRL, field PWBOT1[14] (WORZ)
 *
 * This bit selects which signal to bring out on the PWM's PWM_OUT_TRIG1 port.
 * The output trigger port is often connected to routing logic on the chip. This
 * control bit allows the PWMB output signal to be driven onto the output trigger
 * port so it can be sent to the chip routing logic.
 *
 * Values:
 * - 0b0 - Route the PWM_OUT_TRIG1 signal to PWM_OUT_TRIG1 port.
 * - 0b1 - Route the PWMB output to the PWM_OUT_TRIG1 port.
 */
/*@{*/
/*! @brief Set the PWBOT1 field to a new value. */
#define PWM_WR_TCTRL_PWBOT1(base, index, value) (PWM_RMW_TCTRL(base, index, PWM_TCTRL_PWBOT1_MASK, PWM_TCTRL_PWBOT1(value)))
#define PWM_BWR_TCTRL_PWBOT1(base, index, value) (BME_BFI16(&PWM_TCTRL_REG(base, index), ((uint16_t)(value) << PWM_TCTRL_PWBOT1_SHIFT), PWM_TCTRL_PWBOT1_SHIFT, PWM_TCTRL_PWBOT1_WIDTH))
/*@}*/

/*!
 * @name Register PWM_TCTRL, field PWAOT0[15] (WORZ)
 *
 * This bit selects which signal to bring out on the PWM's PWM_OUT_TRIG0 port.
 * The output trigger port is often connected to routing logic on the chip. This
 * control bit allows the PWMA output signal to be driven onto the output trigger
 * port so it can be sent to the chip routing logic.
 *
 * Values:
 * - 0b0 - Route the PWM_OUT_TRIG0 signal to PWM_OUT_TRIG0 port.
 * - 0b1 - Route the PWMA output to the PWM_OUT_TRIG0 port.
 */
/*@{*/
/*! @brief Set the PWAOT0 field to a new value. */
#define PWM_WR_TCTRL_PWAOT0(base, index, value) (PWM_RMW_TCTRL(base, index, PWM_TCTRL_PWAOT0_MASK, PWM_TCTRL_PWAOT0(value)))
#define PWM_BWR_TCTRL_PWAOT0(base, index, value) (BME_BFI16(&PWM_TCTRL_REG(base, index), ((uint16_t)(value) << PWM_TCTRL_PWAOT0_SHIFT), PWM_TCTRL_PWAOT0_SHIFT, PWM_TCTRL_PWAOT0_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_DISMAP - Fault Disable Mapping Register 0
 ******************************************************************************/

/*!
 * @brief PWM_DISMAP - Fault Disable Mapping Register 0 (RW)
 *
 * Reset value: 0xFFFFU
 *
 * This register determines which PWM pins are disabled by the fault protection
 * inputs. Reset sets all of the bits in the fault disable mapping register.
 */
/*!
 * @name Constants and macros for entire PWM_DISMAP register
 */
/*@{*/
#define PWM_RD_DISMAP(base, index, index2) (PWM_DISMAP_REG(base, index, index2))
#define PWM_WR_DISMAP(base, index, index2, value) (PWM_DISMAP_REG(base, index, index2) = (value))
#define PWM_RMW_DISMAP(base, index, index2, mask, value) (PWM_WR_DISMAP(base, index, index2, (PWM_RD_DISMAP(base, index, index2) & ~(mask)) | (value)))
#define PWM_SET_DISMAP(base, index, index2, value) (BME_OR16(&PWM_DISMAP_REG(base, index, index2), (uint16_t)(value)))
#define PWM_CLR_DISMAP(base, index, index2, value) (BME_AND16(&PWM_DISMAP_REG(base, index, index2), (uint16_t)(~(value))))
#define PWM_TOG_DISMAP(base, index, index2, value) (BME_XOR16(&PWM_DISMAP_REG(base, index, index2), (uint16_t)(value)))
/*@}*/

