pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the EDGCNTB_EN field to a new value. */
#define PWM_WR_CAPTCTRLB_EDGCNTB_EN(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_EDGCNTB_EN_MASK, PWM_CAPTCTRLB_EDGCNTB_EN(value)))
#define PWM_BWR_CAPTCTRLB_EDGCNTB_EN(base, index, value) (BME_BFI16(&PWM_CAPTCTRLB_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLB_EDGCNTB_EN_SHIFT), PWM_CAPTCTRLB_EDGCNTB_EN_SHIFT, PWM_CAPTCTRLB_EDGCNTB_EN_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field CFBWM[9:8] (RW)
 *
 * This field represents the water mark level for capture B FIFOs. The capture
 * flags, STS[CFB1] and STS[CFB0], won't be set until the word count of the
 * corresponding FIFO is greater than this water mark level. (FIFO depth is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_CFBWM field. */
#define PWM_RD_CAPTCTRLB_CFBWM(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_CFBWM_MASK) >> PWM_CAPTCTRLB_CFBWM_SHIFT)
#define PWM_BRD_CAPTCTRLB_CFBWM(base, index) (BME_UBFX16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_CFBWM_SHIFT, PWM_CAPTCTRLB_CFBWM_WIDTH))

/*! @brief Set the CFBWM field to a new value. */
#define PWM_WR_CAPTCTRLB_CFBWM(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_CFBWM_MASK, PWM_CAPTCTRLB_CFBWM(value)))
#define PWM_BWR_CAPTCTRLB_CFBWM(base, index, value) (BME_BFI16(&PWM_CAPTCTRLB_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLB_CFBWM_SHIFT), PWM_CAPTCTRLB_CFBWM_SHIFT, PWM_CAPTCTRLB_CFBWM_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field CB0CNT[12:10] (RO)
 *
 * This field reflects the number of words in the Capture B0 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_CB0CNT field. */
#define PWM_RD_CAPTCTRLB_CB0CNT(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_CB0CNT_MASK) >> PWM_CAPTCTRLB_CB0CNT_SHIFT)
#define PWM_BRD_CAPTCTRLB_CB0CNT(base, index) (BME_UBFX16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_CB0CNT_SHIFT, PWM_CAPTCTRLB_CB0CNT_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field CB1CNT[15:13] (RO)
 *
 * This field reflects the number of words in the Capture B1 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_CB1CNT field. */
#define PWM_RD_CAPTCTRLB_CB1CNT(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_CB1CNT_MASK) >> PWM_CAPTCTRLB_CB1CNT_SHIFT)
#define PWM_BRD_CAPTCTRLB_CB1CNT(base, index) (BME_UBFX16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_CB1CNT_SHIFT, PWM_CAPTCTRLB_CB1CNT_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_CAPTCOMPB - Capture Compare B Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCOMPB - Capture Compare B Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCOMPB register
 */
/*@{*/
#define PWM_RD_CAPTCOMPB(base, index) (PWM_CAPTCOMPB_REG(base, index))
#define PWM_WR_CAPTCOMPB(base, index, value) (PWM_CAPTCOMPB_REG(base, index) = (value))
#define PWM_RMW_CAPTCOMPB(base, index, mask, value) (PWM_WR_CAPTCOMPB(base, index, (PWM_RD_CAPTCOMPB(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCOMPB(base, index, value) (BME_OR16(&PWM_CAPTCOMPB_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_CAPTCOMPB(base, index, value) (BME_AND16(&PWM_CAPTCOMPB_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_CAPTCOMPB(base, index, value) (BME_XOR16(&PWM_CAPTCOMPB_REG(base, index), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CAPTCOMPB bitfields
 */

/*!
 * @name Register PWM_CAPTCOMPB, field EDGCMPB[7:0] (RW)
 *
 * This read/write field is the compare value associated with the edge counter
 * for the PWM_B input capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPB_EDGCMPB field. */
#define PWM_RD_CAPTCOMPB_EDGCMPB(base, index) ((PWM_CAPTCOMPB_REG(base, index) & PWM_CAPTCOMPB_EDGCMPB_MASK) >> PWM_CAPTCOMPB_EDGCMPB_SHIFT)
#define PWM_BRD_CAPTCOMPB_EDGCMPB(base, index) (BME_UBFX16(&PWM_CAPTCOMPB_REG(base, index), PWM_CAPTCOMPB_EDGCMPB_SHIFT, PWM_CAPTCOMPB_EDGCMPB_WIDTH))

/*! @brief Set the EDGCMPB field to a new value. */
#define PWM_WR_CAPTCOMPB_EDGCMPB(base, index, value) (PWM_RMW_CAPTCOMPB(base, index, PWM_CAPTCOMPB_EDGCMPB_MASK, PWM_CAPTCOMPB_EDGCMPB(value)))
#define PWM_BWR_CAPTCOMPB_EDGCMPB(base, index, value) (BME_BFI16(&PWM_CAPTCOMPB_REG(base, index), ((uint16_t)(value) << PWM_CAPTCOMPB_EDGCMPB_SHIFT), PWM_CAPTCOMPB_EDGCMPB_SHIFT, PWM_CAPTCOMPB_EDGCMPB_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCOMPB, field EDGCNTB[15:8] (RO)
 *
 * This read-only field contains the edge counter value for the PWM_B input
 * capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPB_EDGCNTB field. */
#define PWM_RD_CAPTCOMPB_EDGCNTB(base, index) ((PWM_CAPTCOMPB_REG(base, index) & PWM_CAPTCOMPB_EDGCNTB_MASK) >> PWM_CAPTCOMPB_EDGCNTB_SHIFT)
#define PWM_BRD_CAPTCOMPB_EDGCNTB(base, index) (BME_UBFX16(&PWM_CAPTCOMPB_REG(base, index), PWM_CAPTCOMPB_EDGCNTB_SHIFT, PWM_CAPTCOMPB_EDGCNTB_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_CAPTCTRLX - Capture Control X Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCTRLX - Capture Control X Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCTRLX register
 */
/*@{*/
#define PWM_RD_CAPTCTRLX(base, index) (PWM_CAPTCTRLX_REG(base, index))
#define PWM_WR_CAPTCTRLX(base, index, value) (PWM_CAPTCTRLX_REG(base, index) = (value))
#define PWM_RMW_CAPTCTRLX(base, index, mask, value) (PWM_WR_CAPTCTRLX(base, index, (PWM_RD_CAPTCTRLX(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCTRLX(base, index, value) (BME_OR16(&PWM_CAPTCTRLX_REG(base, index), (uint16_t)(value)))
#define PWM_CLR_CAPTCTRLX(base, index, value) (BME_AND16(&PWM_CAPTCTRLX_REG(base, index), (uint16_t)(~(value))))
#define PWM_TOG_CAPTCTRLX(base, index, value) (BME_XOR16(&PWM_CAPTCTRLX_REG(base, index), (uint16_t)(value)))
/*@}*/

