pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual PWM_CAPTCTRLX bitfields
 */

/*!
 * @name Register PWM_CAPTCTRLX, field ARMX[0] (RW)
 *
 * Setting this bit high starts the input capture process. This bit can be
 * cleared at any time to disable input capture operation. This bit is self-cleared
 * when in one shot mode and one or more of the enabled capture circuits has had a
 * capture event.
 *
 * Values:
 * - 0b0 - Input capture operation is disabled.
 * - 0b1 - Input capture operation as specified by CAPTCTRLX[EDGXx] is enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_ARMX field. */
#define PWM_RD_CAPTCTRLX_ARMX(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_ARMX_MASK) >> PWM_CAPTCTRLX_ARMX_SHIFT)
#define PWM_BRD_CAPTCTRLX_ARMX(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_ARMX_SHIFT, PWM_CAPTCTRLX_ARMX_WIDTH))

/*! @brief Set the ARMX field to a new value. */
#define PWM_WR_CAPTCTRLX_ARMX(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_ARMX_MASK, PWM_CAPTCTRLX_ARMX(value)))
#define PWM_BWR_CAPTCTRLX_ARMX(base, index, value) (BME_BFI16(&PWM_CAPTCTRLX_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLX_ARMX_SHIFT), PWM_CAPTCTRLX_ARMX_SHIFT, PWM_CAPTCTRLX_ARMX_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field ONESHOTX[1] (RW)
 *
 * This bit selects between free running and one shot mode for the input capture
 * circuitry.
 *
 * Values:
 * - 0b0 - Free running mode is selected. If both capture circuits are enabled,
 *     then capture circuit 0 is armed first after the ARMX bit is set. Once a
 *     capture occurs, capture circuit 0 is disarmed and capture circuit 1 is
 *     armed. After capture circuit 1 performs a capture, it is disarmed and capture
 *     circuit 0 is re-armed. The process continues indefinitely. If only one of
 *     the capture circuits is enabled, then captures continue indefinitely on the
 *     enabled capture circuit.
 * - 0b1 - One shot mode is selected. If both capture circuits are enabled, then
 *     capture circuit 0 is armed first after the ARMX bit is set. Once a
 *     capture occurs, capture circuit 0 is disarmed and capture circuit 1 is armed.
 *     After capture circuit 1 performs a capture, it is disarmed and the ARMX bit
 *     is cleared. No further captures will be performed until the ARMX bit is
 *     set again. If only one of the capture circuits is enabled, then a single
 *     capture will occur on the enabled capture circuit and the ARMX bit is then
 *     cleared.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_ONESHOTX field. */
#define PWM_RD_CAPTCTRLX_ONESHOTX(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_ONESHOTX_MASK) >> PWM_CAPTCTRLX_ONESHOTX_SHIFT)
#define PWM_BRD_CAPTCTRLX_ONESHOTX(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_ONESHOTX_SHIFT, PWM_CAPTCTRLX_ONESHOTX_WIDTH))

/*! @brief Set the ONESHOTX field to a new value. */
#define PWM_WR_CAPTCTRLX_ONESHOTX(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_ONESHOTX_MASK, PWM_CAPTCTRLX_ONESHOTX(value)))
#define PWM_BWR_CAPTCTRLX_ONESHOTX(base, index, value) (BME_BFI16(&PWM_CAPTCTRLX_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLX_ONESHOTX_SHIFT), PWM_CAPTCTRLX_ONESHOTX_SHIFT, PWM_CAPTCTRLX_ONESHOTX_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field EDGX0[3:2] (RW)
 *
 * These bits control the input capture 0 circuitry by determining which input
 * edges cause a capture event.
 *
 * Values:
 * - 0b00 - Disabled
 * - 0b01 - Capture falling edges
 * - 0b10 - Capture rising edges
 * - 0b11 - Capture any edge
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_EDGX0 field. */
#define PWM_RD_CAPTCTRLX_EDGX0(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_EDGX0_MASK) >> PWM_CAPTCTRLX_EDGX0_SHIFT)
#define PWM_BRD_CAPTCTRLX_EDGX0(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_EDGX0_SHIFT, PWM_CAPTCTRLX_EDGX0_WIDTH))

/*! @brief Set the EDGX0 field to a new value. */
#define PWM_WR_CAPTCTRLX_EDGX0(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_EDGX0_MASK, PWM_CAPTCTRLX_EDGX0(value)))
#define PWM_BWR_CAPTCTRLX_EDGX0(base, index, value) (BME_BFI16(&PWM_CAPTCTRLX_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLX_EDGX0_SHIFT), PWM_CAPTCTRLX_EDGX0_SHIFT, PWM_CAPTCTRLX_EDGX0_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field EDGX1[5:4] (RW)
 *
 * These bits control the input capture 1 circuitry by determining which input
 * edges cause a capture event.
 *
 * Values:
 * - 0b00 - Disabled
 * - 0b01 - Capture falling edges
 * - 0b10 - Capture rising edges
 * - 0b11 - Capture any edge
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_EDGX1 field. */
#define PWM_RD_CAPTCTRLX_EDGX1(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_EDGX1_MASK) >> PWM_CAPTCTRLX_EDGX1_SHIFT)
#define PWM_BRD_CAPTCTRLX_EDGX1(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_EDGX1_SHIFT, PWM_CAPTCTRLX_EDGX1_WIDTH))

/*! @brief Set the EDGX1 field to a new value. */
#define PWM_WR_CAPTCTRLX_EDGX1(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_EDGX1_MASK, PWM_CAPTCTRLX_EDGX1(value)))
#define PWM_BWR_CAPTCTRLX_EDGX1(base, index, value) (BME_BFI16(&PWM_CAPTCTRLX_REG(base, index), ((uint16_t)(value) << PWM_CAPTCTRLX_EDGX1_SHIFT), PWM_CAPTCTRLX_EDGX1_SHIFT, PWM_CAPTCTRLX_EDGX1_WIDTH))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field INP_SELX[6] (RW)
 *
 * This bit selects between the raw PWM_X input signal and the output of the
 * edge counter/compare circuitry as the source for the input capture circuit.
 *
 * Values:
 * - 0b0 - Raw PWM_X input signal selected as source.
 * - 0b1 - Output of edge counter/compare selected as source. When this bitfield
 *     is set to 1, the internal edge counter is enabled and the rising and/or
 *     falling edges specified by the CAPTCTRLX[EDGX0] and CAPTCTRLX[EDGX1] fields
 *     are ignored. The software must still place a value other than 00 in
 *     either or both of the CAPTCTLRX[EDGX0] and/or CAPTCTRLX[EDGX1] fields in order
 *     to enable one or both of the capture registers.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_INP_SELX field. */
#define PWM_RD_CAPTCTRLX_INP_SELX(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_INP_SELX_MASK) >> PWM_CAPTCTRLX_INP_SELX_SHIFT)
#define PWM_BRD_CAPTCTRLX_INP_SELX(base, index) (BME_UBFX16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_INP_SELX_SHIFT, PWM_CAPTCTRLX_INP_SELX_WIDTH))

