pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * PWM_CVAL0 - Capture Value 0 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL0 - Capture Value 0 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL0 register
 */
/*@{*/
#define PWM_RD_CVAL0(base, index) (PWM_CVAL0_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL0CYC - Capture Value 0 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL0CYC - Capture Value 0 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL0CYC register
 */
/*@{*/
#define PWM_RD_CVAL0CYC(base, index) (PWM_CVAL0CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL0CYC bitfields
 */

/*!
 * @name Register PWM_CVAL0CYC, field CVAL0CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL0. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL0CYC_CVAL0CYC field. */
#define PWM_RD_CVAL0CYC_CVAL0CYC(base, index) ((PWM_CVAL0CYC_REG(base, index) & PWM_CVAL0CYC_CVAL0CYC_MASK) >> PWM_CVAL0CYC_CVAL0CYC_SHIFT)
#define PWM_BRD_CVAL0CYC_CVAL0CYC(base, index) (BME_UBFX16(&PWM_CVAL0CYC_REG(base, index), PWM_CVAL0CYC_CVAL0CYC_SHIFT, PWM_CVAL0CYC_CVAL0CYC_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_CVAL1 - Capture Value 1 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL1 - Capture Value 1 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL1 register
 */
/*@{*/
#define PWM_RD_CVAL1(base, index) (PWM_CVAL1_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL1CYC - Capture Value 1 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL1CYC - Capture Value 1 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL1CYC register
 */
/*@{*/
#define PWM_RD_CVAL1CYC(base, index) (PWM_CVAL1CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL1CYC bitfields
 */

/*!
 * @name Register PWM_CVAL1CYC, field CVAL1CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL1. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL1CYC_CVAL1CYC field. */
#define PWM_RD_CVAL1CYC_CVAL1CYC(base, index) ((PWM_CVAL1CYC_REG(base, index) & PWM_CVAL1CYC_CVAL1CYC_MASK) >> PWM_CVAL1CYC_CVAL1CYC_SHIFT)
#define PWM_BRD_CVAL1CYC_CVAL1CYC(base, index) (BME_UBFX16(&PWM_CVAL1CYC_REG(base, index), PWM_CVAL1CYC_CVAL1CYC_SHIFT, PWM_CVAL1CYC_CVAL1CYC_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_CVAL2 - Capture Value 2 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL2 - Capture Value 2 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL2 register
 */
/*@{*/
#define PWM_RD_CVAL2(base, index) (PWM_CVAL2_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL2CYC - Capture Value 2 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL2CYC - Capture Value 2 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL2CYC register
 */
/*@{*/
#define PWM_RD_CVAL2CYC(base, index) (PWM_CVAL2CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL2CYC bitfields
 */

/*!
 * @name Register PWM_CVAL2CYC, field CVAL2CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL2. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL2CYC_CVAL2CYC field. */
#define PWM_RD_CVAL2CYC_CVAL2CYC(base, index) ((PWM_CVAL2CYC_REG(base, index) & PWM_CVAL2CYC_CVAL2CYC_MASK) >> PWM_CVAL2CYC_CVAL2CYC_SHIFT)
#define PWM_BRD_CVAL2CYC_CVAL2CYC(base, index) (BME_UBFX16(&PWM_CVAL2CYC_REG(base, index), PWM_CVAL2CYC_CVAL2CYC_SHIFT, PWM_CVAL2CYC_CVAL2CYC_WIDTH))
/*@}*/

/*******************************************************************************
 * PWM_CVAL3 - Capture Value 3 Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL3 - Capture Value 3 Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL3 register
 */
/*@{*/
#define PWM_RD_CVAL3(base, index) (PWM_CVAL3_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CVAL3CYC - Capture Value 3 Cycle Register
 ******************************************************************************/

/*!
 * @brief PWM_CVAL3CYC - Capture Value 3 Cycle Register (RO)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CVAL3CYC register
 */
/*@{*/
#define PWM_RD_CVAL3CYC(base, index) (PWM_CVAL3CYC_REG(base, index))
/*@}*/

/*
 * Constants & macros for individual PWM_CVAL3CYC bitfields
 */

/*!
 * @name Register PWM_CVAL3CYC, field CVAL3CYC[3:0] (RO)
 *
 * This read-only register stores the cycle number corresponding to the value
 * captured in CVAL3. This register is incremented each time the counter is loaded
 * with the INIT value at the end of a PWM modulo cycle.
 */
/*@{*/
/*! @brief Read current value of the PWM_CVAL3CYC_CVAL3CYC field. */
#define PWM_RD_CVAL3CYC_CVAL3CYC(base, index) ((PWM_CVAL3CYC_REG(base, index) & PWM_CVAL3CYC_CVAL3CYC_MASK) >> PWM_CVAL3CYC_CVAL3CYC_SHIFT)
#define PWM_BRD_CVAL3CYC_CVAL3CYC(base, index) (BME_UBFX16(&PWM_CVAL3CYC_REG(base, index), PWM_CVAL3CYC_CVAL3CYC_SHIFT, PWM_CVAL3CYC_CVAL3CYC_WIDTH))
/*@}*/

