pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * PWM_MASK - Mask Register
 ******************************************************************************/

/*!
 * @brief PWM_MASK - Mask Register (RW)
 *
 * Reset value: 0x0000U
 *
 * MASK is double buffered and does not take effect until a FORCE_OUT event
 * occurs within the appropriate submodule. Reading MASK reads the buffered values
 * and not necessarily the values currently in effect. This double buffering can be
 * overridden by setting the UPDATE_MASK bits.
 */
/*!
 * @name Constants and macros for entire PWM_MASK register
 */
/*@{*/
#define PWM_RD_MASK(base)        (PWM_MASK_REG(base))
#define PWM_WR_MASK(base, value) (PWM_MASK_REG(base) = (value))
#define PWM_RMW_MASK(base, mask, value) (PWM_WR_MASK(base, (PWM_RD_MASK(base) & ~(mask)) | (value)))
#define PWM_SET_MASK(base, value) (BME_OR16(&PWM_MASK_REG(base), (uint16_t)(value)))
#define PWM_CLR_MASK(base, value) (BME_AND16(&PWM_MASK_REG(base), (uint16_t)(~(value))))
#define PWM_TOG_MASK(base, value) (BME_XOR16(&PWM_MASK_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_MASK bitfields
 */

/*!
 * @name Register PWM_MASK, field MASKX[3:0] (RW)
 *
 * The four bits of this field mask the PWM_X outputs of submodules 3-0,
 * respectively, forcing the output to logic 0 prior to consideration of the output
 * polarity.
 *
 * Values:
 * - 0b0000 - PWM_X output normal.
 * - 0b0001 - PWM_X output masked.
 */
/*@{*/
/*! @brief Read current value of the PWM_MASK_MASKX field. */
#define PWM_RD_MASK_MASKX(base) ((PWM_MASK_REG(base) & PWM_MASK_MASKX_MASK) >> PWM_MASK_MASKX_SHIFT)
#define PWM_BRD_MASK_MASKX(base) (BME_UBFX16(&PWM_MASK_REG(base), PWM_MASK_MASKX_SHIFT, PWM_MASK_MASKX_WIDTH))

/*! @brief Set the MASKX field to a new value. */
#define PWM_WR_MASK_MASKX(base, value) (PWM_RMW_MASK(base, PWM_MASK_MASKX_MASK, PWM_MASK_MASKX(value)))
#define PWM_BWR_MASK_MASKX(base, value) (BME_BFI16(&PWM_MASK_REG(base), ((uint16_t)(value) << PWM_MASK_MASKX_SHIFT), PWM_MASK_MASKX_SHIFT, PWM_MASK_MASKX_WIDTH))
/*@}*/

/*!
 * @name Register PWM_MASK, field MASKB[7:4] (RW)
 *
 * The four bits of this field mask the PWM_B outputs of submodules 3-0,
 * respectively, forcing the output to logic 0 prior to consideration of the output
 * polarity.
 *
 * Values:
 * - 0b0000 - PWM_B output normal.
 * - 0b0001 - PWM_B output masked.
 */
/*@{*/
/*! @brief Read current value of the PWM_MASK_MASKB field. */
#define PWM_RD_MASK_MASKB(base) ((PWM_MASK_REG(base) & PWM_MASK_MASKB_MASK) >> PWM_MASK_MASKB_SHIFT)
#define PWM_BRD_MASK_MASKB(base) (BME_UBFX16(&PWM_MASK_REG(base), PWM_MASK_MASKB_SHIFT, PWM_MASK_MASKB_WIDTH))

/*! @brief Set the MASKB field to a new value. */
#define PWM_WR_MASK_MASKB(base, value) (PWM_RMW_MASK(base, PWM_MASK_MASKB_MASK, PWM_MASK_MASKB(value)))
#define PWM_BWR_MASK_MASKB(base, value) (BME_BFI16(&PWM_MASK_REG(base), ((uint16_t)(value) << PWM_MASK_MASKB_SHIFT), PWM_MASK_MASKB_SHIFT, PWM_MASK_MASKB_WIDTH))
/*@}*/

/*!
 * @name Register PWM_MASK, field MASKA[11:8] (RW)
 *
 * The four bits of this field mask the PWM_A outputs of submodules 3-0,
 * respectively, forcing the output to logic 0 prior to consideration of the output
 * polarity.
 *
 * Values:
 * - 0b0000 - PWM_A output normal.
 * - 0b0001 - PWM_A output masked.
 */
/*@{*/
/*! @brief Read current value of the PWM_MASK_MASKA field. */
#define PWM_RD_MASK_MASKA(base) ((PWM_MASK_REG(base) & PWM_MASK_MASKA_MASK) >> PWM_MASK_MASKA_SHIFT)
#define PWM_BRD_MASK_MASKA(base) (BME_UBFX16(&PWM_MASK_REG(base), PWM_MASK_MASKA_SHIFT, PWM_MASK_MASKA_WIDTH))

/*! @brief Set the MASKA field to a new value. */
#define PWM_WR_MASK_MASKA(base, value) (PWM_RMW_MASK(base, PWM_MASK_MASKA_MASK, PWM_MASK_MASKA(value)))
#define PWM_BWR_MASK_MASKA(base, value) (BME_BFI16(&PWM_MASK_REG(base), ((uint16_t)(value) << PWM_MASK_MASKA_SHIFT), PWM_MASK_MASKA_SHIFT, PWM_MASK_MASKA_WIDTH))
/*@}*/

/*!
 * @name Register PWM_MASK, field UPDATE_MASK[15:12] (WO)
 *
 * The four bits mask the PWM_X outputs of submodules 3-0, respectively, The
 * four bits of this field force the MASK* bits to be immediately updated within
 * submodules 3-0, respectively, without waiting for a FORCE_OUT event. These
 * self-clearing bits always read as zero. Software may write to any or all of these
 * bits and may set these bits in the same write operation that updates the MASKA,
 * MASKB, and MASKX fields of this register.
 *
 * Values:
 * - 0b0000 - Normal operation. MASK* bits within the corresponding submodule
 *     are not updated until a FORCE_OUT event occurs within the submodule.
 * - 0b0001 - Immediate operation. MASK* bits within the corresponding submodule
 *     are updated on the following clock edge after setting this bit.
 */
/*@{*/
/*! @brief Set the UPDATE_MASK field to a new value. */
#define PWM_WR_MASK_UPDATE_MASK(base, value) (PWM_RMW_MASK(base, PWM_MASK_UPDATE_MASK_MASK, PWM_MASK_UPDATE_MASK(value)))
#define PWM_BWR_MASK_UPDATE_MASK(base, value) (PWM_WR_MASK_UPDATE_MASK(base, value))
/*@}*/

/*******************************************************************************
 * PWM_SWCOUT - Software Controlled Output Register
 ******************************************************************************/

/*!
 * @brief PWM_SWCOUT - Software Controlled Output Register (RW)
 *
 * Reset value: 0x0000U
 *
 * These bits are double buffered and do not take effect until a FORCE_OUT event
 * occurs within the appropriate submodule. Reading these bits reads the
 * buffered value and not necessarily the value currently in effect.
 */
/*!
 * @name Constants and macros for entire PWM_SWCOUT register
 */
/*@{*/
#define PWM_RD_SWCOUT(base)      (PWM_SWCOUT_REG(base))
#define PWM_WR_SWCOUT(base, value) (PWM_SWCOUT_REG(base) = (value))
#define PWM_RMW_SWCOUT(base, mask, value) (PWM_WR_SWCOUT(base, (PWM_RD_SWCOUT(base) & ~(mask)) | (value)))
#define PWM_SET_SWCOUT(base, value) (BME_OR16(&PWM_SWCOUT_REG(base), (uint16_t)(value)))
#define PWM_CLR_SWCOUT(base, value) (BME_AND16(&PWM_SWCOUT_REG(base), (uint16_t)(~(value))))
#define PWM_TOG_SWCOUT(base, value) (BME_XOR16(&PWM_SWCOUT_REG(base), (uint16_t)(value)))
/*@}*/

