pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual PWM_SWCOUT bitfields
 */

/*!
 * @name Register PWM_SWCOUT, field SM0OUT45[0] (RW)
 *
 * This bit is only used when DTSRCSEL[SM0SEL45] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0b0 - A logic 0 is supplied to the deadtime generator of submodule 0
 *     instead of PWM45.
 * - 0b1 - A logic 1 is supplied to the deadtime generator of submodule 0
 *     instead of PWM45.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM0OUT45 field. */
#define PWM_RD_SWCOUT_SM0OUT45(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM0OUT45_MASK) >> PWM_SWCOUT_SM0OUT45_SHIFT)
#define PWM_BRD_SWCOUT_SM0OUT45(base) (BME_UBFX16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM0OUT45_SHIFT, PWM_SWCOUT_SM0OUT45_WIDTH))

/*! @brief Set the SM0OUT45 field to a new value. */
#define PWM_WR_SWCOUT_SM0OUT45(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM0OUT45_MASK, PWM_SWCOUT_SM0OUT45(value)))
#define PWM_BWR_SWCOUT_SM0OUT45(base, value) (BME_BFI16(&PWM_SWCOUT_REG(base), ((uint16_t)(value) << PWM_SWCOUT_SM0OUT45_SHIFT), PWM_SWCOUT_SM0OUT45_SHIFT, PWM_SWCOUT_SM0OUT45_WIDTH))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM0OUT23[1] (RW)
 *
 * This bit is only used when DTSRCSEL[SM0SEL23] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0b0 - A logic 0 is supplied to the deadtime generator of submodule 0
 *     instead of PWM23.
 * - 0b1 - A logic 1 is supplied to the deadtime generator of submodule 0
 *     instead of PWM23.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM0OUT23 field. */
#define PWM_RD_SWCOUT_SM0OUT23(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM0OUT23_MASK) >> PWM_SWCOUT_SM0OUT23_SHIFT)
#define PWM_BRD_SWCOUT_SM0OUT23(base) (BME_UBFX16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM0OUT23_SHIFT, PWM_SWCOUT_SM0OUT23_WIDTH))

/*! @brief Set the SM0OUT23 field to a new value. */
#define PWM_WR_SWCOUT_SM0OUT23(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM0OUT23_MASK, PWM_SWCOUT_SM0OUT23(value)))
#define PWM_BWR_SWCOUT_SM0OUT23(base, value) (BME_BFI16(&PWM_SWCOUT_REG(base), ((uint16_t)(value) << PWM_SWCOUT_SM0OUT23_SHIFT), PWM_SWCOUT_SM0OUT23_SHIFT, PWM_SWCOUT_SM0OUT23_WIDTH))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM1OUT45[2] (RW)
 *
 * This bit is only used when DTSRCSEL[SM1SEL45] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0b0 - A logic 0 is supplied to the deadtime generator of submodule 1
 *     instead of PWM45.
 * - 0b1 - A logic 1 is supplied to the deadtime generator of submodule 1
 *     instead of PWM45.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM1OUT45 field. */
#define PWM_RD_SWCOUT_SM1OUT45(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM1OUT45_MASK) >> PWM_SWCOUT_SM1OUT45_SHIFT)
#define PWM_BRD_SWCOUT_SM1OUT45(base) (BME_UBFX16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM1OUT45_SHIFT, PWM_SWCOUT_SM1OUT45_WIDTH))

/*! @brief Set the SM1OUT45 field to a new value. */
#define PWM_WR_SWCOUT_SM1OUT45(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM1OUT45_MASK, PWM_SWCOUT_SM1OUT45(value)))
#define PWM_BWR_SWCOUT_SM1OUT45(base, value) (BME_BFI16(&PWM_SWCOUT_REG(base), ((uint16_t)(value) << PWM_SWCOUT_SM1OUT45_SHIFT), PWM_SWCOUT_SM1OUT45_SHIFT, PWM_SWCOUT_SM1OUT45_WIDTH))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM1OUT23[3] (RW)
 *
 * This bit is only used when DTSRCSEL[SM1SEL23] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0b0 - A logic 0 is supplied to the deadtime generator of submodule 1
 *     instead of PWM23.
 * - 0b1 - A logic 1 is supplied to the deadtime generator of submodule 1
 *     instead of PWM23.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM1OUT23 field. */
#define PWM_RD_SWCOUT_SM1OUT23(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM1OUT23_MASK) >> PWM_SWCOUT_SM1OUT23_SHIFT)
#define PWM_BRD_SWCOUT_SM1OUT23(base) (BME_UBFX16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM1OUT23_SHIFT, PWM_SWCOUT_SM1OUT23_WIDTH))

/*! @brief Set the SM1OUT23 field to a new value. */
#define PWM_WR_SWCOUT_SM1OUT23(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM1OUT23_MASK, PWM_SWCOUT_SM1OUT23(value)))
#define PWM_BWR_SWCOUT_SM1OUT23(base, value) (BME_BFI16(&PWM_SWCOUT_REG(base), ((uint16_t)(value) << PWM_SWCOUT_SM1OUT23_SHIFT), PWM_SWCOUT_SM1OUT23_SHIFT, PWM_SWCOUT_SM1OUT23_WIDTH))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM2OUT45[4] (RW)
 *
 * This bit is only used when DTSRCSEL[SM2SEL45] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0b0 - A logic 0 is supplied to the deadtime generator of submodule 2
 *     instead of PWM45.
 * - 0b1 - A logic 1 is supplied to the deadtime generator of submodule 2
 *     instead of PWM45.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM2OUT45 field. */
#define PWM_RD_SWCOUT_SM2OUT45(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM2OUT45_MASK) >> PWM_SWCOUT_SM2OUT45_SHIFT)
#define PWM_BRD_SWCOUT_SM2OUT45(base) (BME_UBFX16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM2OUT45_SHIFT, PWM_SWCOUT_SM2OUT45_WIDTH))

/*! @brief Set the SM2OUT45 field to a new value. */
#define PWM_WR_SWCOUT_SM2OUT45(base, value) (PWM_RMW_SWCOUT(base, PWM_SWCOUT_SM2OUT45_MASK, PWM_SWCOUT_SM2OUT45(value)))
#define PWM_BWR_SWCOUT_SM2OUT45(base, value) (BME_BFI16(&PWM_SWCOUT_REG(base), ((uint16_t)(value) << PWM_SWCOUT_SM2OUT45_SHIFT), PWM_SWCOUT_SM2OUT45_SHIFT, PWM_SWCOUT_SM2OUT45_WIDTH))
/*@}*/

/*!
 * @name Register PWM_SWCOUT, field SM2OUT23[5] (RW)
 *
 * This bit is only used when DTSRCSEL[SM2SEL23] is set to b10. It allows
 * software control of which signal is supplied to the deadtime generator of that
 * submodule.
 *
 * Values:
 * - 0b0 - A logic 0 is supplied to the deadtime generator of submodule 2
 *     instead of PWM23.
 * - 0b1 - A logic 1 is supplied to the deadtime generator of submodule 2
 *     instead of PWM23.
 */
/*@{*/
/*! @brief Read current value of the PWM_SWCOUT_SM2OUT23 field. */
#define PWM_RD_SWCOUT_SM2OUT23(base) ((PWM_SWCOUT_REG(base) & PWM_SWCOUT_SM2OUT23_MASK) >> PWM_SWCOUT_SM2OUT23_SHIFT)
#define PWM_BRD_SWCOUT_SM2OUT23(base) (BME_UBFX16(&PWM_SWCOUT_REG(base), PWM_SWCOUT_SM2OUT23_SHIFT, PWM_SWCOUT_SM2OUT23_WIDTH))

