pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * PWM_FCTRL - Fault Control Register
 ******************************************************************************/

/*!
 * @brief PWM_FCTRL - Fault Control Register (RW)
 *
 * Reset value: 0x0000U
 *
 * For every 4-bit field in this register, the bits act on the fault inputs in
 * order. For example, FLVL bits 15-12 act on faults 3-0, respectively.
 */
/*!
 * @name Constants and macros for entire PWM_FCTRL register
 */
/*@{*/
#define PWM_RD_FCTRL(base)       (PWM_FCTRL_REG(base))
#define PWM_WR_FCTRL(base, value) (PWM_FCTRL_REG(base) = (value))
#define PWM_RMW_FCTRL(base, mask, value) (PWM_WR_FCTRL(base, (PWM_RD_FCTRL(base) & ~(mask)) | (value)))
#define PWM_SET_FCTRL(base, value) (BME_OR16(&PWM_FCTRL_REG(base), (uint16_t)(value)))
#define PWM_CLR_FCTRL(base, value) (BME_AND16(&PWM_FCTRL_REG(base), (uint16_t)(~(value))))
#define PWM_TOG_FCTRL(base, value) (BME_XOR16(&PWM_FCTRL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FCTRL bitfields
 */

/*!
 * @name Register PWM_FCTRL, field FIE[3:0] (RW)
 *
 * This read/write field enables CPU interrupt requests generated by the FAULTx
 * pins. A reset clears this field. The fault protection circuit is independent
 * of the FIEx bit and is always active. If a fault is detected, the PWM outputs
 * are disabled according to the disable mapping register.
 *
 * Values:
 * - 0b0000 - FAULTx CPU interrupt requests disabled.
 * - 0b0001 - FAULTx CPU interrupt requests enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_FCTRL_FIE field. */
#define PWM_RD_FCTRL_FIE(base) ((PWM_FCTRL_REG(base) & PWM_FCTRL_FIE_MASK) >> PWM_FCTRL_FIE_SHIFT)
#define PWM_BRD_FCTRL_FIE(base) (BME_UBFX16(&PWM_FCTRL_REG(base), PWM_FCTRL_FIE_SHIFT, PWM_FCTRL_FIE_WIDTH))

/*! @brief Set the FIE field to a new value. */
#define PWM_WR_FCTRL_FIE(base, value) (PWM_RMW_FCTRL(base, PWM_FCTRL_FIE_MASK, PWM_FCTRL_FIE(value)))
#define PWM_BWR_FCTRL_FIE(base, value) (BME_BFI16(&PWM_FCTRL_REG(base), ((uint16_t)(value) << PWM_FCTRL_FIE_SHIFT), PWM_FCTRL_FIE_SHIFT, PWM_FCTRL_FIE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FCTRL, field FSAFE[7:4] (RW)
 *
 * These read/write bits select the safety mode during manual fault clearing. A
 * reset clears this field. FSTS[FFPINx] may indicate a fault condition still
 * exists even though the actual fault signal at the FAULTx pin is clear due to the
 * fault filter latency.
 *
 * Values:
 * - 0b0000 - Normal mode. PWM outputs disabled by this fault are not enabled
 *     until FSTS[FFLAGx] is clear at the start of a half cycle or full cycle
 *     depending on the state of FSTS[FFULL] without regard to the state of
 *     FSTS[FFPINx]. The PWM outputs disabled by this fault input will not be re-enabled
 *     until the actual FAULTx input signal de-asserts since the fault input will
 *     combinationally disable the PWM outputs (as programmed in DISMAPn).
 * - 0b0001 - Safe mode. PWM outputs disabled by this fault are not enabled
 *     until FSTS[FFLAGx] is clear and FSTS[FFPINx] is clear at the start of a half
 *     cycle or full cycle depending on the state of FSTS[FFULL].
 */
/*@{*/
/*! @brief Read current value of the PWM_FCTRL_FSAFE field. */
#define PWM_RD_FCTRL_FSAFE(base) ((PWM_FCTRL_REG(base) & PWM_FCTRL_FSAFE_MASK) >> PWM_FCTRL_FSAFE_SHIFT)
#define PWM_BRD_FCTRL_FSAFE(base) (BME_UBFX16(&PWM_FCTRL_REG(base), PWM_FCTRL_FSAFE_SHIFT, PWM_FCTRL_FSAFE_WIDTH))

/*! @brief Set the FSAFE field to a new value. */
#define PWM_WR_FCTRL_FSAFE(base, value) (PWM_RMW_FCTRL(base, PWM_FCTRL_FSAFE_MASK, PWM_FCTRL_FSAFE(value)))
#define PWM_BWR_FCTRL_FSAFE(base, value) (BME_BFI16(&PWM_FCTRL_REG(base), ((uint16_t)(value) << PWM_FCTRL_FSAFE_SHIFT), PWM_FCTRL_FSAFE_SHIFT, PWM_FCTRL_FSAFE_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FCTRL, field FAUTO[11:8] (RW)
 *
 * The four read/write bits of this field select automatic or manual clearing of
 * faults 3-0, respectively. A reset clears this field.
 *
 * Values:
 * - 0b0000 - Manual fault clearing. PWM outputs disabled by this fault are not
 *     enabled until FSTS[FFLAGx] is clear at the start of a half cycle or full
 *     cycle depending the state of FSTS[FFULL]. This is further controlled by
 *     FCTRL[FSAFE].
 * - 0b0001 - Automatic fault clearing. PWM outputs disabled by this fault are
 *     enabled when FSTS[FFPINx] is clear at the start of a half cycle or full
 *     cycle depending on the state of FSTS[FFULL] without regard to the state of
 *     FSTS[FFLAGx].
 */
/*@{*/
/*! @brief Read current value of the PWM_FCTRL_FAUTO field. */
#define PWM_RD_FCTRL_FAUTO(base) ((PWM_FCTRL_REG(base) & PWM_FCTRL_FAUTO_MASK) >> PWM_FCTRL_FAUTO_SHIFT)
#define PWM_BRD_FCTRL_FAUTO(base) (BME_UBFX16(&PWM_FCTRL_REG(base), PWM_FCTRL_FAUTO_SHIFT, PWM_FCTRL_FAUTO_WIDTH))

/*! @brief Set the FAUTO field to a new value. */
#define PWM_WR_FCTRL_FAUTO(base, value) (PWM_RMW_FCTRL(base, PWM_FCTRL_FAUTO_MASK, PWM_FCTRL_FAUTO(value)))
#define PWM_BWR_FCTRL_FAUTO(base, value) (BME_BFI16(&PWM_FCTRL_REG(base), ((uint16_t)(value) << PWM_FCTRL_FAUTO_SHIFT), PWM_FCTRL_FAUTO_SHIFT, PWM_FCTRL_FAUTO_WIDTH))
/*@}*/

/*!
 * @name Register PWM_FCTRL, field FLVL[15:12] (RW)
 *
 * The four read/write bits of this field select the active logic level of the
 * individual fault inputs 3-0, respectively. A reset clears this field.
 *
 * Values:
 * - 0b0000 - A logic 0 on the fault input indicates a fault condition.
 * - 0b0001 - A logic 1 on the fault input indicates a fault condition.
 */
/*@{*/
/*! @brief Read current value of the PWM_FCTRL_FLVL field. */
#define PWM_RD_FCTRL_FLVL(base) ((PWM_FCTRL_REG(base) & PWM_FCTRL_FLVL_MASK) >> PWM_FCTRL_FLVL_SHIFT)
#define PWM_BRD_FCTRL_FLVL(base) (BME_UBFX16(&PWM_FCTRL_REG(base), PWM_FCTRL_FLVL_SHIFT, PWM_FCTRL_FLVL_WIDTH))

/*! @brief Set the FLVL field to a new value. */
#define PWM_WR_FCTRL_FLVL(base, value) (PWM_RMW_FCTRL(base, PWM_FCTRL_FLVL_MASK, PWM_FCTRL_FLVL(value)))
#define PWM_BWR_FCTRL_FLVL(base, value) (BME_BFI16(&PWM_FCTRL_REG(base), ((uint16_t)(value) << PWM_FCTRL_FLVL_SHIFT), PWM_FCTRL_FLVL_SHIFT, PWM_FCTRL_FLVL_WIDTH))
/*@}*/

