pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the ADCBTRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADCBTRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADCBTRGSEL_MASK, SIM_SOPT7_ADCBTRGSEL(value)))
#define SIM_BWR_SOPT7_ADCBTRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADCBTRGSEL_SHIFT), SIM_SOPT7_ADCBTRGSEL_SHIFT, SIM_SOPT7_ADCBTRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADCBALTTRGEN[15:14] (RW)
 *
 * Enable alternative conversion triggers for ADCB.
 *
 * Values:
 * - 0b00 - XBARA output 13.
 * - 0b01 - PDB1 channel0 trigger selected for ADCB
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADCBALTTRGEN field. */
#define SIM_RD_SOPT7_ADCBALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADCBALTTRGEN_MASK) >> SIM_SOPT7_ADCBALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADCBALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADCBALTTRGEN_SHIFT, SIM_SOPT7_ADCBALTTRGEN_WIDTH))

/*! @brief Set the ADCBALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADCBALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADCBALTTRGEN_MASK, SIM_SOPT7_ADCBALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADCBALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADCBALTTRGEN_SHIFT), SIM_SOPT7_ADCBALTTRGEN_SHIFT, SIM_SOPT7_ADCBALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADCCTRGSEL[19:16] (RW)
 *
 * Selects the ADCC trigger source when alternative triggers are functional in
 * stop modes.
 *
 * Values:
 * - 0b0000 - Reserved
 * - 0b0001 - High speed comparator 0 output
 * - 0b0010 - High speed comparator 1 output
 * - 0b0011 - High speed comparator 2 output
 * - 0b0100 - PIT trigger 0
 * - 0b0101 - PIT trigger 1
 * - 0b0110 - PIT trigger 2
 * - 0b0111 - PIT trigger 3
 * - 0b1000 - FTM0 trigger
 * - 0b1001 - FTM1 trigger
 * - 0b1010 - FTM2 trigger
 * - 0b1011 - FTM3 trigger
 * - 0b1100 - XBARA output 41
 * - 0b1101 - Reserved
 * - 0b1110 - Low-power timer trigger
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADCCTRGSEL field. */
#define SIM_RD_SOPT7_ADCCTRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADCCTRGSEL_MASK) >> SIM_SOPT7_ADCCTRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADCCTRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADCCTRGSEL_SHIFT, SIM_SOPT7_ADCCTRGSEL_WIDTH))

/*! @brief Set the ADCCTRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADCCTRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADCCTRGSEL_MASK, SIM_SOPT7_ADCCTRGSEL(value)))
#define SIM_BWR_SOPT7_ADCCTRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADCCTRGSEL_SHIFT), SIM_SOPT7_ADCCTRGSEL_SHIFT, SIM_SOPT7_ADCCTRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADCCALTTRGEN[23:22] (RW)
 *
 * Enable alternative conversion triggers for ADCC.
 *
 * Values:
 * - 0b00 - XBARA output 42.
 * - 0b01 - PDB1 channel 1 trigger selected for ADCC.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADCCALTTRGEN field. */
#define SIM_RD_SOPT7_ADCCALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADCCALTTRGEN_MASK) >> SIM_SOPT7_ADCCALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADCCALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADCCALTTRGEN_SHIFT, SIM_SOPT7_ADCCALTTRGEN_WIDTH))

/*! @brief Set the ADCCALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADCCALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADCCALTTRGEN_MASK, SIM_SOPT7_ADCCALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADCCALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADCCALTTRGEN_SHIFT), SIM_SOPT7_ADCCALTTRGEN_SHIFT, SIM_SOPT7_ADCCALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADCDTRGSEL[27:24] (RW)
 *
 * Selects the ADCD trigger source when alternative triggers are functional in
 * stop modes.
 *
 * Values:
 * - 0b0000 - PDB external trigger pin input (PDB0_EXTRG)
 * - 0b0001 - High speed comparator 0 output
 * - 0b0010 - High speed comparator 1 output
 * - 0b0011 - High speed comparator 2 output
 * - 0b0100 - PIT trigger 0
 * - 0b0101 - PIT trigger 1
 * - 0b0110 - PIT trigger 2
 * - 0b0111 - PIT trigger 3
 * - 0b1000 - FTM0 trigger
 * - 0b1001 - FTM1 trigger
 * - 0b1010 - FTM2 trigger
 * - 0b1011 - FTM3 trigger
 * - 0b1100 - XBARA output 38
 * - 0b1101 - Reserved
 * - 0b1110 - Low-power timer trigger
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADCDTRGSEL field. */
#define SIM_RD_SOPT7_ADCDTRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADCDTRGSEL_MASK) >> SIM_SOPT7_ADCDTRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADCDTRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADCDTRGSEL_SHIFT, SIM_SOPT7_ADCDTRGSEL_WIDTH))

/*! @brief Set the ADCDTRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADCDTRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADCDTRGSEL_MASK, SIM_SOPT7_ADCDTRGSEL(value)))
#define SIM_BWR_SOPT7_ADCDTRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADCDTRGSEL_SHIFT), SIM_SOPT7_ADCDTRGSEL_SHIFT, SIM_SOPT7_ADCDTRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADCDALTTRGEN[31:30] (RW)
 *
 * Enable alternative conversion triggers for ADCD.
 *
 * Values:
 * - 0b00 - XBARA output 43.
 * - 0b01 - PDB0 channel 1 trigger selected for ADCD
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADCDALTTRGEN field. */
#define SIM_RD_SOPT7_ADCDALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADCDALTTRGEN_MASK) >> SIM_SOPT7_ADCDALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADCDALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADCDALTTRGEN_SHIFT, SIM_SOPT7_ADCDALTTRGEN_WIDTH))

/*! @brief Set the ADCDALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADCDALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADCDALTTRGEN_MASK, SIM_SOPT7_ADCDALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADCDALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADCDALTTRGEN_SHIFT), SIM_SOPT7_ADCDALTTRGEN_SHIFT, SIM_SOPT7_ADCDALTTRGEN_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SOPT8 - System Options Register 8
 ******************************************************************************/

/*!
 * @brief SIM_SOPT8 - System Options Register 8 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT8 register
 */
/*@{*/
#define SIM_RD_SOPT8(base)       (SIM_SOPT8_REG(base))
#define SIM_WR_SOPT8(base, value) (SIM_SOPT8_REG(base) = (value))
#define SIM_RMW_SOPT8(base, mask, value) (SIM_WR_SOPT8(base, (SIM_RD_SOPT8(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT8(base, value) (BME_OR32(&SIM_SOPT8_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT8(base, value) (BME_AND32(&SIM_SOPT8_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT8(base, value) (BME_XOR32(&SIM_SOPT8_REG(base), (uint32_t)(value)))
/*@}*/

