pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * SIM_SOPT9 - System Options Register 9
 ******************************************************************************/

/*!
 * @brief SIM_SOPT9 - System Options Register 9 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT9 register
 */
/*@{*/
#define SIM_RD_SOPT9(base)       (SIM_SOPT9_REG(base))
#define SIM_WR_SOPT9(base, value) (SIM_SOPT9_REG(base) = (value))
#define SIM_RMW_SOPT9(base, mask, value) (SIM_WR_SOPT9(base, (SIM_RD_SOPT9(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT9(base, value) (BME_OR32(&SIM_SOPT9_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT9(base, value) (BME_AND32(&SIM_SOPT9_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT9(base, value) (BME_XOR32(&SIM_SOPT9_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT9 bitfields
 */

/*!
 * @name Register SIM_SOPT9, field FTM1ICH0SRC[5:4] (RW)
 *
 * Selects the source for FTM1 channel 0 input capture. When the FTM is not in
 * input capture mode, clear this field.
 *
 * Values:
 * - 0b00 - FTM1_CH0 signal
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM1ICH0SRC field. */
#define SIM_RD_SOPT9_FTM1ICH0SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM1ICH0SRC_MASK) >> SIM_SOPT9_FTM1ICH0SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM1ICH0SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM1ICH0SRC_SHIFT, SIM_SOPT9_FTM1ICH0SRC_WIDTH))

/*! @brief Set the FTM1ICH0SRC field to a new value. */
#define SIM_WR_SOPT9_FTM1ICH0SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM1ICH0SRC_MASK, SIM_SOPT9_FTM1ICH0SRC(value)))
#define SIM_BWR_SOPT9_FTM1ICH0SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM1ICH0SRC_SHIFT), SIM_SOPT9_FTM1ICH0SRC_SHIFT, SIM_SOPT9_FTM1ICH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM1ICH1SRC[6] (RW)
 *
 * Selects the source for FTM1 channel 0 input capture. When the FTM is not in
 * input capture mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM1_CH1 signal
 * - 0b1 - Exclusive OR of FTM1_CH1, FTM1_CH0 and XBARA output 42
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM1ICH1SRC field. */
#define SIM_RD_SOPT9_FTM1ICH1SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM1ICH1SRC_MASK) >> SIM_SOPT9_FTM1ICH1SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM1ICH1SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM1ICH1SRC_SHIFT, SIM_SOPT9_FTM1ICH1SRC_WIDTH))

/*! @brief Set the FTM1ICH1SRC field to a new value. */
#define SIM_WR_SOPT9_FTM1ICH1SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM1ICH1SRC_MASK, SIM_SOPT9_FTM1ICH1SRC(value)))
#define SIM_BWR_SOPT9_FTM1ICH1SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM1ICH1SRC_SHIFT), SIM_SOPT9_FTM1ICH1SRC_SHIFT, SIM_SOPT9_FTM1ICH1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM2ICH0SRC[9:8] (RW)
 *
 * Selects the source for FTM2 channel 0 input capture. When the FTM is not in
 * input capture mode, clear this field.
 *
 * Values:
 * - 0b00 - FTM2_CH0 signal
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM2ICH0SRC field. */
#define SIM_RD_SOPT9_FTM2ICH0SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM2ICH0SRC_MASK) >> SIM_SOPT9_FTM2ICH0SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM2ICH0SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM2ICH0SRC_SHIFT, SIM_SOPT9_FTM2ICH0SRC_WIDTH))

/*! @brief Set the FTM2ICH0SRC field to a new value. */
#define SIM_WR_SOPT9_FTM2ICH0SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM2ICH0SRC_MASK, SIM_SOPT9_FTM2ICH0SRC(value)))
#define SIM_BWR_SOPT9_FTM2ICH0SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM2ICH0SRC_SHIFT), SIM_SOPT9_FTM2ICH0SRC_SHIFT, SIM_SOPT9_FTM2ICH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM2ICH1SRC[10] (RW)
 *
 * Selects the source for FTM2 channel 0 input capture. When the FTM is not in
 * input capture mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM2_CH1 signal
 * - 0b1 - Exclusive OR of FTM2_CH1, FTM2_CH0 and FTM1_CH1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM2ICH1SRC field. */
#define SIM_RD_SOPT9_FTM2ICH1SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM2ICH1SRC_MASK) >> SIM_SOPT9_FTM2ICH1SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM2ICH1SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM2ICH1SRC_SHIFT, SIM_SOPT9_FTM2ICH1SRC_WIDTH))

/*! @brief Set the FTM2ICH1SRC field to a new value. */
#define SIM_WR_SOPT9_FTM2ICH1SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM2ICH1SRC_MASK, SIM_SOPT9_FTM2ICH1SRC(value)))
#define SIM_BWR_SOPT9_FTM2ICH1SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM2ICH1SRC_SHIFT), SIM_SOPT9_FTM2ICH1SRC_SHIFT, SIM_SOPT9_FTM2ICH1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM0CLKSEL[25:24] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM0 module. The
 * selected pin must also be configured for the FTM0 module external clock function
 * through the appropriate pin control register in the port control module.
 *
 * Values:
 * - 0b00 - FTM0 external clock driven by FTM_CLK0 pin
 * - 0b01 - FTM0 external clock driven by FTM_CLK1 pin
 * - 0b10 - FTM0 external clock driven by FTM_CLK2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM0CLKSEL field. */
#define SIM_RD_SOPT9_FTM0CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM0CLKSEL_MASK) >> SIM_SOPT9_FTM0CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_FTM0CLKSEL(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM0CLKSEL_SHIFT, SIM_SOPT9_FTM0CLKSEL_WIDTH))

/*! @brief Set the FTM0CLKSEL field to a new value. */
#define SIM_WR_SOPT9_FTM0CLKSEL(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM0CLKSEL_MASK, SIM_SOPT9_FTM0CLKSEL(value)))
#define SIM_BWR_SOPT9_FTM0CLKSEL(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM0CLKSEL_SHIFT), SIM_SOPT9_FTM0CLKSEL_SHIFT, SIM_SOPT9_FTM0CLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM1CLKSEL[27:26] (RW)
 *
 * Selects the external pin used to drive the clock to the FTM1 module. The
 * selected pin must also be configured for the FTM1 module external clock function
 * through the appropriate pin control register in the port control module.
 *
 * Values:
 * - 0b00 - FTM1 external clock driven by FTM_CLK0 pin
 * - 0b01 - FTM1 external clock driven by FTM_CLK1 pin
 * - 0b10 - FTM1 external clock driven by FTM_CLK2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM1CLKSEL field. */
#define SIM_RD_SOPT9_FTM1CLKSEL(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM1CLKSEL_MASK) >> SIM_SOPT9_FTM1CLKSEL_SHIFT)
#define SIM_BRD_SOPT9_FTM1CLKSEL(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM1CLKSEL_SHIFT, SIM_SOPT9_FTM1CLKSEL_WIDTH))

