pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * SIM_SCGC2 - System Clock Gating Control Register 2
 ******************************************************************************/

/*!
 * @brief SIM_SCGC2 - System Clock Gating Control Register 2 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC2 register
 */
/*@{*/
#define SIM_RD_SCGC2(base)       (SIM_SCGC2_REG(base))
#define SIM_WR_SCGC2(base, value) (SIM_SCGC2_REG(base) = (value))
#define SIM_RMW_SCGC2(base, mask, value) (SIM_WR_SCGC2(base, (SIM_RD_SCGC2(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC2(base, value) (BME_OR32(&SIM_SCGC2_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC2(base, value) (BME_AND32(&SIM_SCGC2_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC2(base, value) (BME_XOR32(&SIM_SCGC2_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC2 bitfields
 */

/*!
 * @name Register SIM_SCGC2, field ENET[0] (RW)
 *
 * This bit controls the clock gate to the ENET module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_ENET field. */
#define SIM_RD_SCGC2_ENET(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_ENET_MASK) >> SIM_SCGC2_ENET_SHIFT)
#define SIM_BRD_SCGC2_ENET(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_ENET_SHIFT, SIM_SCGC2_ENET_WIDTH))

/*! @brief Set the ENET field to a new value. */
#define SIM_WR_SCGC2_ENET(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_ENET_MASK, SIM_SCGC2_ENET(value)))
#define SIM_BWR_SCGC2_ENET(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_ENET_SHIFT), SIM_SCGC2_ENET_SHIFT, SIM_SCGC2_ENET_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC2, field ADCCD[28] (RW)
 *
 * This bit controls the clock gate to the ADCC and ADCD module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC2_ADCCD field. */
#define SIM_RD_SCGC2_ADCCD(base) ((SIM_SCGC2_REG(base) & SIM_SCGC2_ADCCD_MASK) >> SIM_SCGC2_ADCCD_SHIFT)
#define SIM_BRD_SCGC2_ADCCD(base) (BME_UBFX32(&SIM_SCGC2_REG(base), SIM_SCGC2_ADCCD_SHIFT, SIM_SCGC2_ADCCD_WIDTH))

/*! @brief Set the ADCCD field to a new value. */
#define SIM_WR_SCGC2_ADCCD(base, value) (SIM_RMW_SCGC2(base, SIM_SCGC2_ADCCD_MASK, SIM_SCGC2_ADCCD(value)))
#define SIM_BWR_SCGC2_ADCCD(base, value) (BME_BFI32(&SIM_SCGC2_REG(base), ((uint32_t)(value) << SIM_SCGC2_ADCCD_SHIFT), SIM_SCGC2_ADCCD_SHIFT, SIM_SCGC2_ADCCD_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SCGC3 - System Clock Gating Control Register 3
 ******************************************************************************/

/*!
 * @brief SIM_SCGC3 - System Clock Gating Control Register 3 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC3 register
 */
/*@{*/
#define SIM_RD_SCGC3(base)       (SIM_SCGC3_REG(base))
#define SIM_WR_SCGC3(base, value) (SIM_SCGC3_REG(base) = (value))
#define SIM_RMW_SCGC3(base, mask, value) (SIM_WR_SCGC3(base, (SIM_RD_SCGC3(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC3(base, value) (BME_OR32(&SIM_SCGC3_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC3(base, value) (BME_AND32(&SIM_SCGC3_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC3(base, value) (BME_XOR32(&SIM_SCGC3_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SCGC3 bitfields
 */

/*!
 * @name Register SIM_SCGC3, field TRNG[0] (RW)
 *
 * This bit controls the clock gate to the TRNG module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_TRNG field. */
#define SIM_RD_SCGC3_TRNG(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_TRNG_MASK) >> SIM_SCGC3_TRNG_SHIFT)
#define SIM_BRD_SCGC3_TRNG(base) (BME_UBFX32(&SIM_SCGC3_REG(base), SIM_SCGC3_TRNG_SHIFT, SIM_SCGC3_TRNG_WIDTH))

/*! @brief Set the TRNG field to a new value. */
#define SIM_WR_SCGC3_TRNG(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_TRNG_MASK, SIM_SCGC3_TRNG(value)))
#define SIM_BWR_SCGC3_TRNG(base, value) (BME_BFI32(&SIM_SCGC3_REG(base), ((uint32_t)(value) << SIM_SCGC3_TRNG_SHIFT), SIM_SCGC3_TRNG_SHIFT, SIM_SCGC3_TRNG_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field FLEXCAN2[4] (RW)
 *
 * This bit controls the clock gate to the FlexCAN1 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_FLEXCAN2 field. */
#define SIM_RD_SCGC3_FLEXCAN2(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_FLEXCAN2_MASK) >> SIM_SCGC3_FLEXCAN2_SHIFT)
#define SIM_BRD_SCGC3_FLEXCAN2(base) (BME_UBFX32(&SIM_SCGC3_REG(base), SIM_SCGC3_FLEXCAN2_SHIFT, SIM_SCGC3_FLEXCAN2_WIDTH))

/*! @brief Set the FLEXCAN2 field to a new value. */
#define SIM_WR_SCGC3_FLEXCAN2(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_FLEXCAN2_MASK, SIM_SCGC3_FLEXCAN2(value)))
#define SIM_BWR_SCGC3_FLEXCAN2(base, value) (BME_BFI32(&SIM_SCGC3_REG(base), ((uint32_t)(value) << SIM_SCGC3_FLEXCAN2_SHIFT), SIM_SCGC3_FLEXCAN2_SHIFT, SIM_SCGC3_FLEXCAN2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC3, field SPI2[12] (RW)
 *
 * This bit controls the clock gate to the SPI2 module.
 *
 * Values:
 * - 0b0 - Clock disabled
 * - 0b1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC3_SPI2 field. */
#define SIM_RD_SCGC3_SPI2(base) ((SIM_SCGC3_REG(base) & SIM_SCGC3_SPI2_MASK) >> SIM_SCGC3_SPI2_SHIFT)
#define SIM_BRD_SCGC3_SPI2(base) (BME_UBFX32(&SIM_SCGC3_REG(base), SIM_SCGC3_SPI2_SHIFT, SIM_SCGC3_SPI2_WIDTH))

/*! @brief Set the SPI2 field to a new value. */
#define SIM_WR_SCGC3_SPI2(base, value) (SIM_RMW_SCGC3(base, SIM_SCGC3_SPI2_MASK, SIM_SCGC3_SPI2(value)))
#define SIM_BWR_SCGC3_SPI2(base, value) (BME_BFI32(&SIM_SCGC3_REG(base), ((uint32_t)(value) << SIM_SCGC3_SPI2_SHIFT), SIM_SCGC3_SPI2_SHIFT, SIM_SCGC3_SPI2_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SCGC4 - System Clock Gating Control Register 4
 ******************************************************************************/

/*!
 * @brief SIM_SCGC4 - System Clock Gating Control Register 4 (RW)
 *
 * Reset value: 0xF0000030U
 */
/*!
 * @name Constants and macros for entire SIM_SCGC4 register
 */
/*@{*/
#define SIM_RD_SCGC4(base)       (SIM_SCGC4_REG(base))
#define SIM_WR_SCGC4(base, value) (SIM_SCGC4_REG(base) = (value))
#define SIM_RMW_SCGC4(base, mask, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~(mask)) | (value)))
#define SIM_SET_SCGC4(base, value) (BME_OR32(&SIM_SCGC4_REG(base), (uint32_t)(value)))
#define SIM_CLR_SCGC4(base, value) (BME_AND32(&SIM_SCGC4_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SCGC4(base, value) (BME_XOR32(&SIM_SCGC4_REG(base), (uint32_t)(value)))
/*@}*/

