pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the SYNCXBARBPITTRIG1 field to a new value. */
#define SIM_WR_MISCTRL2_SYNCXBARBPITTRIG1(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCXBARBPITTRIG1_MASK, SIM_MISCTRL2_SYNCXBARBPITTRIG1(value)))
#define SIM_BWR_MISCTRL2_SYNCXBARBPITTRIG1(base, value) (BME_BFI32(&SIM_MISCTRL2_REG(base), ((uint32_t)(value) << SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT), SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT, SIM_MISCTRL2_SYNCXBARBPITTRIG1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCDACHWTRIG[16] (RW)
 *
 * This field controls the synchronizer between XBARA's output and DAC hardware
 * trigger. Set this bit if the DAC hardware trigger isn't from flash/slow
 * peripherials through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCDACHWTRIG field. */
#define SIM_RD_MISCTRL2_SYNCDACHWTRIG(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCDACHWTRIG_MASK) >> SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCDACHWTRIG(base) (BME_UBFX32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT, SIM_MISCTRL2_SYNCDACHWTRIG_WIDTH))

/*! @brief Set the SYNCDACHWTRIG field to a new value. */
#define SIM_WR_MISCTRL2_SYNCDACHWTRIG(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCDACHWTRIG_MASK, SIM_MISCTRL2_SYNCDACHWTRIG(value)))
#define SIM_BWR_MISCTRL2_SYNCDACHWTRIG(base, value) (BME_BFI32(&SIM_MISCTRL2_REG(base), ((uint32_t)(value) << SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT), SIM_MISCTRL2_SYNCDACHWTRIG_SHIFT, SIM_MISCTRL2_SYNCDACHWTRIG_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCEWMIN[17] (RW)
 *
 * This field controls the synchronizer between XBARA's output and EWM's ewm_in
 * input. Set this bit if the EWM's ewm_in isn't from flash/slow peripherials
 * through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCEWMIN field. */
#define SIM_RD_MISCTRL2_SYNCEWMIN(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCEWMIN_MASK) >> SIM_MISCTRL2_SYNCEWMIN_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCEWMIN(base) (BME_UBFX32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCEWMIN_SHIFT, SIM_MISCTRL2_SYNCEWMIN_WIDTH))

/*! @brief Set the SYNCEWMIN field to a new value. */
#define SIM_WR_MISCTRL2_SYNCEWMIN(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCEWMIN_MASK, SIM_MISCTRL2_SYNCEWMIN(value)))
#define SIM_BWR_MISCTRL2_SYNCEWMIN(base, value) (BME_BFI32(&SIM_MISCTRL2_REG(base), ((uint32_t)(value) << SIM_MISCTRL2_SYNCEWMIN_SHIFT), SIM_MISCTRL2_SYNCEWMIN_SHIFT, SIM_MISCTRL2_SYNCEWMIN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCCMP0SAMPLEWIN[20] (RW)
 *
 * This field controls the synchronizer between XBARA's output and CMP0's
 * sample/window input. Set this bit if the CMP0's sample/window input isn't from
 * flash/slow peripherials through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCCMP0SAMPLEWIN field. */
#define SIM_RD_MISCTRL2_SYNCCMP0SAMPLEWIN(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_MASK) >> SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCCMP0SAMPLEWIN(base) (BME_UBFX32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT, SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_WIDTH))

/*! @brief Set the SYNCCMP0SAMPLEWIN field to a new value. */
#define SIM_WR_MISCTRL2_SYNCCMP0SAMPLEWIN(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_MASK, SIM_MISCTRL2_SYNCCMP0SAMPLEWIN(value)))
#define SIM_BWR_MISCTRL2_SYNCCMP0SAMPLEWIN(base, value) (BME_BFI32(&SIM_MISCTRL2_REG(base), ((uint32_t)(value) << SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT), SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_SHIFT, SIM_MISCTRL2_SYNCCMP0SAMPLEWIN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCCMP1SAMPLEWIN[21] (RW)
 *
 * This field controls the synchronizer between XBARA's output and CMP1's
 * sample/window input. Set this bit if the CMP1's sample/window input isn't from
 * flash/slow peripherials through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCCMP1SAMPLEWIN field. */
#define SIM_RD_MISCTRL2_SYNCCMP1SAMPLEWIN(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_MASK) >> SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCCMP1SAMPLEWIN(base) (BME_UBFX32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT, SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_WIDTH))

/*! @brief Set the SYNCCMP1SAMPLEWIN field to a new value. */
#define SIM_WR_MISCTRL2_SYNCCMP1SAMPLEWIN(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_MASK, SIM_MISCTRL2_SYNCCMP1SAMPLEWIN(value)))
#define SIM_BWR_MISCTRL2_SYNCCMP1SAMPLEWIN(base, value) (BME_BFI32(&SIM_MISCTRL2_REG(base), ((uint32_t)(value) << SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT), SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_SHIFT, SIM_MISCTRL2_SYNCCMP1SAMPLEWIN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCCMP2SAMPLEWIN[22] (RW)
 *
 * This field controls the synchronizer between XBARA's output and CMP2's
 * sample/window input. Set this bit if the CMP2's sample/window input isn't from
 * flash/slow peripherials through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCCMP2SAMPLEWIN field. */
#define SIM_RD_MISCTRL2_SYNCCMP2SAMPLEWIN(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_MASK) >> SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCCMP2SAMPLEWIN(base) (BME_UBFX32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT, SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_WIDTH))

/*! @brief Set the SYNCCMP2SAMPLEWIN field to a new value. */
#define SIM_WR_MISCTRL2_SYNCCMP2SAMPLEWIN(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_MASK, SIM_MISCTRL2_SYNCCMP2SAMPLEWIN(value)))
#define SIM_BWR_MISCTRL2_SYNCCMP2SAMPLEWIN(base, value) (BME_BFI32(&SIM_MISCTRL2_REG(base), ((uint32_t)(value) << SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT), SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_SHIFT, SIM_MISCTRL2_SYNCCMP2SAMPLEWIN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCCMP3SAMPLEWIN[23] (RW)
 *
 * This field controls the synchronizer between XBARA's output and CMP3's
 * sample/window input. Set this bit if the CMP3's sample/window input isn't from
 * flash/slow peripherials through xbar.
 *
 * Values:
 * - 0b0 - Disable, bypass synchronizer.
 * - 0b1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCCMP3SAMPLEWIN field. */
#define SIM_RD_MISCTRL2_SYNCCMP3SAMPLEWIN(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_MASK) >> SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCCMP3SAMPLEWIN(base) (BME_UBFX32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT, SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_WIDTH))

/*! @brief Set the SYNCCMP3SAMPLEWIN field to a new value. */
#define SIM_WR_MISCTRL2_SYNCCMP3SAMPLEWIN(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_MASK, SIM_MISCTRL2_SYNCCMP3SAMPLEWIN(value)))
#define SIM_BWR_MISCTRL2_SYNCCMP3SAMPLEWIN(base, value) (BME_BFI32(&SIM_MISCTRL2_REG(base), ((uint32_t)(value) << SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT), SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_SHIFT, SIM_MISCTRL2_SYNCCMP3SAMPLEWIN_WIDTH))
/*@}*/

