pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * SIM_ADCOPT - ADC Additional Option Register
 ******************************************************************************/

/*!
 * @brief SIM_ADCOPT - ADC Additional Option Register (RW)
 *
 * Reset value: 0x04000000U
 */
/*!
 * @name Constants and macros for entire SIM_ADCOPT register
 */
/*@{*/
#define SIM_RD_ADCOPT(base)      (SIM_ADCOPT_REG(base))
#define SIM_WR_ADCOPT(base, value) (SIM_ADCOPT_REG(base) = (value))
#define SIM_RMW_ADCOPT(base, mask, value) (SIM_WR_ADCOPT(base, (SIM_RD_ADCOPT(base) & ~(mask)) | (value)))
#define SIM_SET_ADCOPT(base, value) (BME_OR32(&SIM_ADCOPT_REG(base), (uint32_t)(value)))
#define SIM_CLR_ADCOPT(base, value) (BME_AND32(&SIM_ADCOPT_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_ADCOPT(base, value) (BME_XOR32(&SIM_ADCOPT_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_ADCOPT bitfields
 */

/*!
 * @name Register SIM_ADCOPT, field ADC0TRGSEL[19:16] (RW)
 *
 * Selects the ADC0 trigger source when alternative triggers are functional in
 * stop modes.
 *
 * Values:
 * - 0b0000 - PDB0 external trigger pin input (PDB0_EXTRG)
 * - 0b0001 - High speed comparator 0 output
 * - 0b0010 - High speed comparator 1 output
 * - 0b0011 - High speed comparator 2 output
 * - 0b0100 - PIT trigger 0
 * - 0b0101 - PIT trigger 1
 * - 0b0110 - PIT trigger 2
 * - 0b0111 - PIT trigger 3
 * - 0b1000 - FTM0 trigger
 * - 0b1001 - FTM1 trigger
 * - 0b1010 - FTM2 trigger
 * - 0b1011 - FTM3 trigger
 * - 0b1100 - XBARA output 38
 * - 0b1101 - Reserved
 * - 0b1110 - Low-power timer (LPTMR) trigger
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC0TRGSEL field. */
#define SIM_RD_ADCOPT_ADC0TRGSEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC0TRGSEL_MASK) >> SIM_ADCOPT_ADC0TRGSEL_SHIFT)
#define SIM_BRD_ADCOPT_ADC0TRGSEL(base) (BME_UBFX32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC0TRGSEL_SHIFT, SIM_ADCOPT_ADC0TRGSEL_WIDTH))

/*! @brief Set the ADC0TRGSEL field to a new value. */
#define SIM_WR_ADCOPT_ADC0TRGSEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC0TRGSEL_MASK, SIM_ADCOPT_ADC0TRGSEL(value)))
#define SIM_BWR_ADCOPT_ADC0TRGSEL(base, value) (BME_BFI32(&SIM_ADCOPT_REG(base), ((uint32_t)(value) << SIM_ADCOPT_ADC0TRGSEL_SHIFT), SIM_ADCOPT_ADC0TRGSEL_SHIFT, SIM_ADCOPT_ADC0TRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC0PRETRGSEL[20] (RW)
 *
 * Selects the ADC0 pre-trigger source when alternative triggers are enabled
 * through ADC0ALTTRGEN or XBARA output 39 is selected
 *
 * Values:
 * - 0b0 - Pre-trigger A
 * - 0b1 - Pre-trigger B
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC0PRETRGSEL field. */
#define SIM_RD_ADCOPT_ADC0PRETRGSEL(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC0PRETRGSEL_MASK) >> SIM_ADCOPT_ADC0PRETRGSEL_SHIFT)
#define SIM_BRD_ADCOPT_ADC0PRETRGSEL(base) (BME_UBFX32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC0PRETRGSEL_SHIFT, SIM_ADCOPT_ADC0PRETRGSEL_WIDTH))

/*! @brief Set the ADC0PRETRGSEL field to a new value. */
#define SIM_WR_ADCOPT_ADC0PRETRGSEL(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC0PRETRGSEL_MASK, SIM_ADCOPT_ADC0PRETRGSEL(value)))
#define SIM_BWR_ADCOPT_ADC0PRETRGSEL(base, value) (BME_BFI32(&SIM_ADCOPT_REG(base), ((uint32_t)(value) << SIM_ADCOPT_ADC0PRETRGSEL_SHIFT), SIM_ADCOPT_ADC0PRETRGSEL_SHIFT, SIM_ADCOPT_ADC0PRETRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADC0ALTTRGEN[23:22] (RW)
 *
 * Enable alternative conversion triggers for ADC0.
 *
 * Values:
 * - 0b00 - XBARA output 39.
 * - 0b01 - PDB0 channel1 trigger selected for ADC0
 * - 0b10 - PDB1 channel0 trigger selected for ADC0
 * - 0b11 - Alternate trigger selected for ADC0 as defined by ADC0TRGSEL.
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADC0ALTTRGEN field. */
#define SIM_RD_ADCOPT_ADC0ALTTRGEN(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADC0ALTTRGEN_MASK) >> SIM_ADCOPT_ADC0ALTTRGEN_SHIFT)
#define SIM_BRD_ADCOPT_ADC0ALTTRGEN(base) (BME_UBFX32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADC0ALTTRGEN_SHIFT, SIM_ADCOPT_ADC0ALTTRGEN_WIDTH))

/*! @brief Set the ADC0ALTTRGEN field to a new value. */
#define SIM_WR_ADCOPT_ADC0ALTTRGEN(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADC0ALTTRGEN_MASK, SIM_ADCOPT_ADC0ALTTRGEN(value)))
#define SIM_BWR_ADCOPT_ADC0ALTTRGEN(base, value) (BME_BFI32(&SIM_ADCOPT_REG(base), ((uint32_t)(value) << SIM_ADCOPT_ADC0ALTTRGEN_SHIFT), SIM_ADCOPT_ADC0ALTTRGEN_SHIFT, SIM_ADCOPT_ADC0ALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADCIRCLK[25] (RO)
 *
 * Indicates which clock is fed in ADC. Can't access ADC's registers when this
 * bit is "1". This bit is used in STOP/VLPS mode to make sure if the ADC clock is
 * switched to the expected clock.
 *
 * Values:
 * - 0b0 - ADC clock is fast peripherial clock.
 * - 0b1 - ADC clock is MCGIRCLK.
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADCIRCLK field. */
#define SIM_RD_ADCOPT_ADCIRCLK(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADCIRCLK_MASK) >> SIM_ADCOPT_ADCIRCLK_SHIFT)
#define SIM_BRD_ADCOPT_ADCIRCLK(base) (BME_UBFX32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADCIRCLK_SHIFT, SIM_ADCOPT_ADCIRCLK_WIDTH))
/*@}*/

/*!
 * @name Register SIM_ADCOPT, field ADCSTOPEN[26] (RW)
 *
 * This bit controls if ADC can run in STOP mode. If this bit is set ADCA, ADCB,
 * ADCC and ADCD can function in STOP mode or PSTOP mode with MCGIRCLK.
 *
 * Values:
 * - 0b0 - ADC stops in system STOP modes
 * - 0b1 - ADC can be enabled in system STOP modes
 */
/*@{*/
/*! @brief Read current value of the SIM_ADCOPT_ADCSTOPEN field. */
#define SIM_RD_ADCOPT_ADCSTOPEN(base) ((SIM_ADCOPT_REG(base) & SIM_ADCOPT_ADCSTOPEN_MASK) >> SIM_ADCOPT_ADCSTOPEN_SHIFT)
#define SIM_BRD_ADCOPT_ADCSTOPEN(base) (BME_UBFX32(&SIM_ADCOPT_REG(base), SIM_ADCOPT_ADCSTOPEN_SHIFT, SIM_ADCOPT_ADCSTOPEN_WIDTH))

/*! @brief Set the ADCSTOPEN field to a new value. */
#define SIM_WR_ADCOPT_ADCSTOPEN(base, value) (SIM_RMW_ADCOPT(base, SIM_ADCOPT_ADCSTOPEN_MASK, SIM_ADCOPT_ADCSTOPEN(value)))
#define SIM_BWR_ADCOPT_ADCSTOPEN(base, value) (BME_BFI32(&SIM_ADCOPT_REG(base), ((uint32_t)(value) << SIM_ADCOPT_ADCSTOPEN_SHIFT), SIM_ADCOPT_ADCSTOPEN_SHIFT, SIM_ADCOPT_ADCSTOPEN_WIDTH))
/*@}*/

