pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * UART_TL7816 - UART 7816 Transmit Length Register
 ******************************************************************************/

/*!
 * @brief UART_TL7816 - UART 7816 Transmit Length Register (RW)
 *
 * Reset value: 0x00U
 *
 * The TL7816 register is used to indicate the number of characters contained in
 * the block being transmitted. This register is used only when C7816[TTYPE] =
 * 1. This register may be read at anytime. This register must be written only
 * when C2[TE] is not enabled.
 */
/*!
 * @name Constants and macros for entire UART_TL7816 register
 */
/*@{*/
#define UART_RD_TL7816(base)     (UART_TL7816_REG(base))
#define UART_WR_TL7816(base, value) (UART_TL7816_REG(base) = (value))
#define UART_RMW_TL7816(base, mask, value) (UART_WR_TL7816(base, (UART_RD_TL7816(base) & ~(mask)) | (value)))
#define UART_SET_TL7816(base, value) (BME_OR8(&UART_TL7816_REG(base), (uint8_t)(value)))
#define UART_CLR_TL7816(base, value) (BME_AND8(&UART_TL7816_REG(base), (uint8_t)(~(value))))
#define UART_TOG_TL7816(base, value) (BME_XOR8(&UART_TL7816_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_C6 - UART CEA709.1-B Control Register 6
 ******************************************************************************/

/*!
 * @brief UART_C6 - UART CEA709.1-B Control Register 6 (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_C6 register
 */
/*@{*/
#define UART_RD_C6(base)         (UART_C6_REG(base))
#define UART_WR_C6(base, value)  (UART_C6_REG(base) = (value))
#define UART_RMW_C6(base, mask, value) (UART_WR_C6(base, (UART_RD_C6(base) & ~(mask)) | (value)))
#define UART_SET_C6(base, value) (BME_OR8(&UART_C6_REG(base), (uint8_t)(value)))
#define UART_CLR_C6(base, value) (BME_AND8(&UART_C6_REG(base), (uint8_t)(~(value))))
#define UART_TOG_C6(base, value) (BME_XOR8(&UART_C6_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual UART_C6 bitfields
 */

/*!
 * @name Register UART_C6, field CP[4] (RW)
 *
 * Indicates the polarity of the collision signal.
 *
 * Values:
 * - 0b0 - Collision signal is active low.
 * - 0b1 - Collision signal is active high.
 */
/*@{*/
/*! @brief Read current value of the UART_C6_CP field. */
#define UART_RD_C6_CP(base)  ((UART_C6_REG(base) & UART_C6_CP_MASK) >> UART_C6_CP_SHIFT)
#define UART_BRD_C6_CP(base) (BME_UBFX8(&UART_C6_REG(base), UART_C6_CP_SHIFT, UART_C6_CP_WIDTH))

/*! @brief Set the CP field to a new value. */
#define UART_WR_C6_CP(base, value) (UART_RMW_C6(base, UART_C6_CP_MASK, UART_C6_CP(value)))
#define UART_BWR_C6_CP(base, value) (BME_BFI8(&UART_C6_REG(base), ((uint8_t)(value) << UART_C6_CP_SHIFT), UART_C6_CP_SHIFT, UART_C6_CP_WIDTH))
/*@}*/

/*!
 * @name Register UART_C6, field CE[5] (RW)
 *
 * Enables the collision detect functionality.
 *
 * Values:
 * - 0b0 - Collision detect feature is disabled.
 * - 0b1 - Collision detect feature is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_C6_CE field. */
#define UART_RD_C6_CE(base)  ((UART_C6_REG(base) & UART_C6_CE_MASK) >> UART_C6_CE_SHIFT)
#define UART_BRD_C6_CE(base) (BME_UBFX8(&UART_C6_REG(base), UART_C6_CE_SHIFT, UART_C6_CE_WIDTH))

/*! @brief Set the CE field to a new value. */
#define UART_WR_C6_CE(base, value) (UART_RMW_C6(base, UART_C6_CE_MASK, UART_C6_CE(value)))
#define UART_BWR_C6_CE(base, value) (BME_BFI8(&UART_C6_REG(base), ((uint8_t)(value) << UART_C6_CE_SHIFT), UART_C6_CE_SHIFT, UART_C6_CE_WIDTH))
/*@}*/

/*!
 * @name Register UART_C6, field TX709[6] (RW)
 *
 * Starts CEA709.1-B transmission. This bit is automatically cleared after
 * completely transmitting the packet
 *
 * Values:
 * - 0b0 - CEA709.1-B transmitter is disabled.
 * - 0b1 - CEA709.1-B transmitter is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_C6_TX709 field. */
#define UART_RD_C6_TX709(base) ((UART_C6_REG(base) & UART_C6_TX709_MASK) >> UART_C6_TX709_SHIFT)
#define UART_BRD_C6_TX709(base) (BME_UBFX8(&UART_C6_REG(base), UART_C6_TX709_SHIFT, UART_C6_TX709_WIDTH))

/*! @brief Set the TX709 field to a new value. */
#define UART_WR_C6_TX709(base, value) (UART_RMW_C6(base, UART_C6_TX709_MASK, UART_C6_TX709(value)))
#define UART_BWR_C6_TX709(base, value) (BME_BFI8(&UART_C6_REG(base), ((uint8_t)(value) << UART_C6_TX709_SHIFT), UART_C6_TX709_SHIFT, UART_C6_TX709_WIDTH))
/*@}*/

/*!
 * @name Register UART_C6, field EN709[7] (RW)
 *
 * Enables the CEA709.1-B feature.
 *
 * Values:
 * - 0b0 - CEA709.1-B is disabled.
 * - 0b1 - CEA709.1-B is enabled
 */
/*@{*/
/*! @brief Read current value of the UART_C6_EN709 field. */
#define UART_RD_C6_EN709(base) ((UART_C6_REG(base) & UART_C6_EN709_MASK) >> UART_C6_EN709_SHIFT)
#define UART_BRD_C6_EN709(base) (BME_UBFX8(&UART_C6_REG(base), UART_C6_EN709_SHIFT, UART_C6_EN709_WIDTH))

/*! @brief Set the EN709 field to a new value. */
#define UART_WR_C6_EN709(base, value) (UART_RMW_C6(base, UART_C6_EN709_MASK, UART_C6_EN709(value)))
#define UART_BWR_C6_EN709(base, value) (BME_BFI8(&UART_C6_REG(base), ((uint8_t)(value) << UART_C6_EN709_SHIFT), UART_C6_EN709_SHIFT, UART_C6_EN709_WIDTH))
/*@}*/

/*******************************************************************************
 * UART_PCTH - UART CEA709.1-B Packet Cycle Time Counter High
 ******************************************************************************/

/*!
 * @brief UART_PCTH - UART CEA709.1-B Packet Cycle Time Counter High (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_PCTH register
 */
/*@{*/
#define UART_RD_PCTH(base)       (UART_PCTH_REG(base))
#define UART_WR_PCTH(base, value) (UART_PCTH_REG(base) = (value))
#define UART_RMW_PCTH(base, mask, value) (UART_WR_PCTH(base, (UART_RD_PCTH(base) & ~(mask)) | (value)))
#define UART_SET_PCTH(base, value) (BME_OR8(&UART_PCTH_REG(base), (uint8_t)(value)))
#define UART_CLR_PCTH(base, value) (BME_AND8(&UART_PCTH_REG(base), (uint8_t)(~(value))))
#define UART_TOG_PCTH(base, value) (BME_XOR8(&UART_PCTH_REG(base), (uint8_t)(value)))
/*@}*/

