pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * UART_PCTL - UART CEA709.1-B Packet Cycle Time Counter Low
 ******************************************************************************/

/*!
 * @brief UART_PCTL - UART CEA709.1-B Packet Cycle Time Counter Low (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_PCTL register
 */
/*@{*/
#define UART_RD_PCTL(base)       (UART_PCTL_REG(base))
#define UART_WR_PCTL(base, value) (UART_PCTL_REG(base) = (value))
#define UART_RMW_PCTL(base, mask, value) (UART_WR_PCTL(base, (UART_RD_PCTL(base) & ~(mask)) | (value)))
#define UART_SET_PCTL(base, value) (BME_OR8(&UART_PCTL_REG(base), (uint8_t)(value)))
#define UART_CLR_PCTL(base, value) (BME_AND8(&UART_PCTL_REG(base), (uint8_t)(~(value))))
#define UART_TOG_PCTL(base, value) (BME_XOR8(&UART_PCTL_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_IE0 - UART CEA709.1-B Interrupt Enable Register 0
 ******************************************************************************/

/*!
 * @brief UART_IE0 - UART CEA709.1-B Interrupt Enable Register 0 (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_IE0 register
 */
/*@{*/
#define UART_RD_IE0(base)        (UART_IE0_REG(base))
#define UART_WR_IE0(base, value) (UART_IE0_REG(base) = (value))
#define UART_RMW_IE0(base, mask, value) (UART_WR_IE0(base, (UART_RD_IE0(base) & ~(mask)) | (value)))
#define UART_SET_IE0(base, value) (BME_OR8(&UART_IE0_REG(base), (uint8_t)(value)))
#define UART_CLR_IE0(base, value) (BME_AND8(&UART_IE0_REG(base), (uint8_t)(~(value))))
#define UART_TOG_IE0(base, value) (BME_XOR8(&UART_IE0_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual UART_IE0 bitfields
 */

/*!
 * @name Register UART_IE0, field CPTXIE[0] (RW)
 *
 * Interrupt enable for collision during preamble transmission flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE0_CPTXIE field. */
#define UART_RD_IE0_CPTXIE(base) ((UART_IE0_REG(base) & UART_IE0_CPTXIE_MASK) >> UART_IE0_CPTXIE_SHIFT)
#define UART_BRD_IE0_CPTXIE(base) (BME_UBFX8(&UART_IE0_REG(base), UART_IE0_CPTXIE_SHIFT, UART_IE0_CPTXIE_WIDTH))

/*! @brief Set the CPTXIE field to a new value. */
#define UART_WR_IE0_CPTXIE(base, value) (UART_RMW_IE0(base, UART_IE0_CPTXIE_MASK, UART_IE0_CPTXIE(value)))
#define UART_BWR_IE0_CPTXIE(base, value) (BME_BFI8(&UART_IE0_REG(base), ((uint8_t)(value) << UART_IE0_CPTXIE_SHIFT), UART_IE0_CPTXIE_SHIFT, UART_IE0_CPTXIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE0, field CTXDIE[1] (RW)
 *
 * Interrupt enable for collision during transmission of byte sync or later
 * packet flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE0_CTXDIE field. */
#define UART_RD_IE0_CTXDIE(base) ((UART_IE0_REG(base) & UART_IE0_CTXDIE_MASK) >> UART_IE0_CTXDIE_SHIFT)
#define UART_BRD_IE0_CTXDIE(base) (BME_UBFX8(&UART_IE0_REG(base), UART_IE0_CTXDIE_SHIFT, UART_IE0_CTXDIE_WIDTH))

/*! @brief Set the CTXDIE field to a new value. */
#define UART_WR_IE0_CTXDIE(base, value) (UART_RMW_IE0(base, UART_IE0_CTXDIE_MASK, UART_IE0_CTXDIE(value)))
#define UART_BWR_IE0_CTXDIE(base, value) (BME_BFI8(&UART_IE0_REG(base), ((uint8_t)(value) << UART_IE0_CTXDIE_SHIFT), UART_IE0_CTXDIE_SHIFT, UART_IE0_CTXDIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE0, field RPLOFIE[2] (RW)
 *
 * Interrupt enable for packet receive packet length overflow flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE0_RPLOFIE field. */
#define UART_RD_IE0_RPLOFIE(base) ((UART_IE0_REG(base) & UART_IE0_RPLOFIE_MASK) >> UART_IE0_RPLOFIE_SHIFT)
#define UART_BRD_IE0_RPLOFIE(base) (BME_UBFX8(&UART_IE0_REG(base), UART_IE0_RPLOFIE_SHIFT, UART_IE0_RPLOFIE_WIDTH))

/*! @brief Set the RPLOFIE field to a new value. */
#define UART_WR_IE0_RPLOFIE(base, value) (UART_RMW_IE0(base, UART_IE0_RPLOFIE_MASK, UART_IE0_RPLOFIE(value)))
#define UART_BWR_IE0_RPLOFIE(base, value) (BME_BFI8(&UART_IE0_REG(base), ((uint8_t)(value) << UART_IE0_RPLOFIE_SHIFT), UART_IE0_RPLOFIE_SHIFT, UART_IE0_RPLOFIE_WIDTH))
/*@}*/

/*******************************************************************************
 * UART_SDTH - UART CEA709.1-B Secondary Delay Timer High
 ******************************************************************************/

/*!
 * @brief UART_SDTH - UART CEA709.1-B Secondary Delay Timer High (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_SDTH register
 */
/*@{*/
#define UART_RD_SDTH(base)       (UART_SDTH_REG(base))
#define UART_WR_SDTH(base, value) (UART_SDTH_REG(base) = (value))
#define UART_RMW_SDTH(base, mask, value) (UART_WR_SDTH(base, (UART_RD_SDTH(base) & ~(mask)) | (value)))
#define UART_SET_SDTH(base, value) (BME_OR8(&UART_SDTH_REG(base), (uint8_t)(value)))
#define UART_CLR_SDTH(base, value) (BME_AND8(&UART_SDTH_REG(base), (uint8_t)(~(value))))
#define UART_TOG_SDTH(base, value) (BME_XOR8(&UART_SDTH_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_SDTL - UART CEA709.1-B Secondary Delay Timer Low
 ******************************************************************************/

/*!
 * @brief UART_SDTL - UART CEA709.1-B Secondary Delay Timer Low (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_SDTL register
 */
/*@{*/
#define UART_RD_SDTL(base)       (UART_SDTL_REG(base))
#define UART_WR_SDTL(base, value) (UART_SDTL_REG(base) = (value))
#define UART_RMW_SDTL(base, mask, value) (UART_WR_SDTL(base, (UART_RD_SDTL(base) & ~(mask)) | (value)))
#define UART_SET_SDTL(base, value) (BME_OR8(&UART_SDTL_REG(base), (uint8_t)(value)))
#define UART_CLR_SDTL(base, value) (BME_AND8(&UART_SDTL_REG(base), (uint8_t)(~(value))))
#define UART_TOG_SDTL(base, value) (BME_XOR8(&UART_SDTL_REG(base), (uint8_t)(value)))
/*@}*/

