pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * UART_PRE - UART CEA709.1-B Preamble
 ******************************************************************************/

/*!
 * @brief UART_PRE - UART CEA709.1-B Preamble (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_PRE register
 */
/*@{*/
#define UART_RD_PRE(base)        (UART_PRE_REG(base))
#define UART_WR_PRE(base, value) (UART_PRE_REG(base) = (value))
#define UART_RMW_PRE(base, mask, value) (UART_WR_PRE(base, (UART_RD_PRE(base) & ~(mask)) | (value)))
#define UART_SET_PRE(base, value) (BME_OR8(&UART_PRE_REG(base), (uint8_t)(value)))
#define UART_CLR_PRE(base, value) (BME_AND8(&UART_PRE_REG(base), (uint8_t)(~(value))))
#define UART_TOG_PRE(base, value) (BME_XOR8(&UART_PRE_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_TPL - UART CEA709.1-B Transmit Packet Length
 ******************************************************************************/

/*!
 * @brief UART_TPL - UART CEA709.1-B Transmit Packet Length (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_TPL register
 */
/*@{*/
#define UART_RD_TPL(base)        (UART_TPL_REG(base))
#define UART_WR_TPL(base, value) (UART_TPL_REG(base) = (value))
#define UART_RMW_TPL(base, mask, value) (UART_WR_TPL(base, (UART_RD_TPL(base) & ~(mask)) | (value)))
#define UART_SET_TPL(base, value) (BME_OR8(&UART_TPL_REG(base), (uint8_t)(value)))
#define UART_CLR_TPL(base, value) (BME_AND8(&UART_TPL_REG(base), (uint8_t)(~(value))))
#define UART_TOG_TPL(base, value) (BME_XOR8(&UART_TPL_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_IE - UART CEA709.1-B Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief UART_IE - UART CEA709.1-B Interrupt Enable Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_IE register
 */
/*@{*/
#define UART_RD_IE(base)         (UART_IE_REG(base))
#define UART_WR_IE(base, value)  (UART_IE_REG(base) = (value))
#define UART_RMW_IE(base, mask, value) (UART_WR_IE(base, (UART_RD_IE(base) & ~(mask)) | (value)))
#define UART_SET_IE(base, value) (BME_OR8(&UART_IE_REG(base), (uint8_t)(value)))
#define UART_CLR_IE(base, value) (BME_AND8(&UART_IE_REG(base), (uint8_t)(~(value))))
#define UART_TOG_IE(base, value) (BME_XOR8(&UART_IE_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual UART_IE bitfields
 */

/*!
 * @name Register UART_IE, field TXDIE[0] (RW)
 *
 * Interrupt enable for transmission delay flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE_TXDIE field. */
#define UART_RD_IE_TXDIE(base) ((UART_IE_REG(base) & UART_IE_TXDIE_MASK) >> UART_IE_TXDIE_SHIFT)
#define UART_BRD_IE_TXDIE(base) (BME_UBFX8(&UART_IE_REG(base), UART_IE_TXDIE_SHIFT, UART_IE_TXDIE_WIDTH))

/*! @brief Set the TXDIE field to a new value. */
#define UART_WR_IE_TXDIE(base, value) (UART_RMW_IE(base, UART_IE_TXDIE_MASK, UART_IE_TXDIE(value)))
#define UART_BWR_IE_TXDIE(base, value) (BME_BFI8(&UART_IE_REG(base), ((uint8_t)(value) << UART_IE_TXDIE_SHIFT), UART_IE_TXDIE_SHIFT, UART_IE_TXDIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE, field PSIE[1] (RW)
 *
 * Interrupt enable for preamble start flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE_PSIE field. */
#define UART_RD_IE_PSIE(base) ((UART_IE_REG(base) & UART_IE_PSIE_MASK) >> UART_IE_PSIE_SHIFT)
#define UART_BRD_IE_PSIE(base) (BME_UBFX8(&UART_IE_REG(base), UART_IE_PSIE_SHIFT, UART_IE_PSIE_WIDTH))

/*! @brief Set the PSIE field to a new value. */
#define UART_WR_IE_PSIE(base, value) (UART_RMW_IE(base, UART_IE_PSIE_MASK, UART_IE_PSIE(value)))
#define UART_BWR_IE_PSIE(base, value) (BME_BFI8(&UART_IE_REG(base), ((uint8_t)(value) << UART_IE_PSIE_SHIFT), UART_IE_PSIE_SHIFT, UART_IE_PSIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE, field PCTEIE[2] (RW)
 *
 * Interrupt enable for packet cycle time expired flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE_PCTEIE field. */
#define UART_RD_IE_PCTEIE(base) ((UART_IE_REG(base) & UART_IE_PCTEIE_MASK) >> UART_IE_PCTEIE_SHIFT)
#define UART_BRD_IE_PCTEIE(base) (BME_UBFX8(&UART_IE_REG(base), UART_IE_PCTEIE_SHIFT, UART_IE_PCTEIE_WIDTH))

/*! @brief Set the PCTEIE field to a new value. */
#define UART_WR_IE_PCTEIE(base, value) (UART_RMW_IE(base, UART_IE_PCTEIE_MASK, UART_IE_PCTEIE(value)))
#define UART_BWR_IE_PCTEIE(base, value) (BME_BFI8(&UART_IE_REG(base), ((uint8_t)(value) << UART_IE_PCTEIE_SHIFT), UART_IE_PCTEIE_SHIFT, UART_IE_PCTEIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE, field PTXIE[3] (RW)
 *
 * Interrupt enable for packet transmitted flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE_PTXIE field. */
#define UART_RD_IE_PTXIE(base) ((UART_IE_REG(base) & UART_IE_PTXIE_MASK) >> UART_IE_PTXIE_SHIFT)
#define UART_BRD_IE_PTXIE(base) (BME_UBFX8(&UART_IE_REG(base), UART_IE_PTXIE_SHIFT, UART_IE_PTXIE_WIDTH))

/*! @brief Set the PTXIE field to a new value. */
#define UART_WR_IE_PTXIE(base, value) (UART_RMW_IE(base, UART_IE_PTXIE_MASK, UART_IE_PTXIE(value)))
#define UART_BWR_IE_PTXIE(base, value) (BME_BFI8(&UART_IE_REG(base), ((uint8_t)(value) << UART_IE_PTXIE_SHIFT), UART_IE_PTXIE_SHIFT, UART_IE_PTXIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE, field PRXIE[4] (RW)
 *
 * Interrupt enable for packet received flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE_PRXIE field. */
#define UART_RD_IE_PRXIE(base) ((UART_IE_REG(base) & UART_IE_PRXIE_MASK) >> UART_IE_PRXIE_SHIFT)
#define UART_BRD_IE_PRXIE(base) (BME_UBFX8(&UART_IE_REG(base), UART_IE_PRXIE_SHIFT, UART_IE_PRXIE_WIDTH))

/*! @brief Set the PRXIE field to a new value. */
#define UART_WR_IE_PRXIE(base, value) (UART_RMW_IE(base, UART_IE_PRXIE_MASK, UART_IE_PRXIE(value)))
#define UART_BWR_IE_PRXIE(base, value) (BME_BFI8(&UART_IE_REG(base), ((uint8_t)(value) << UART_IE_PRXIE_SHIFT), UART_IE_PRXIE_SHIFT, UART_IE_PRXIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE, field ISDIE[5] (RW)
 *
 * Interrupt enable for initial synchronization detection flag. This field
 * cannot be cleared except by disabling CEA709. Therefore, ISDIE must be cleared when
 * the first initial sync detection interrupt occurs. If the ISD interrupt is
 * not disabled in the interrupt handler, then user will continuously get
 * interrupts.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE_ISDIE field. */
#define UART_RD_IE_ISDIE(base) ((UART_IE_REG(base) & UART_IE_ISDIE_MASK) >> UART_IE_ISDIE_SHIFT)
#define UART_BRD_IE_ISDIE(base) (BME_UBFX8(&UART_IE_REG(base), UART_IE_ISDIE_SHIFT, UART_IE_ISDIE_WIDTH))

/*! @brief Set the ISDIE field to a new value. */
#define UART_WR_IE_ISDIE(base, value) (UART_RMW_IE(base, UART_IE_ISDIE_MASK, UART_IE_ISDIE(value)))
#define UART_BWR_IE_ISDIE(base, value) (BME_BFI8(&UART_IE_REG(base), ((uint8_t)(value) << UART_IE_ISDIE_SHIFT), UART_IE_ISDIE_SHIFT, UART_IE_ISDIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE, field WBEIE[6] (RW)
 *
 * Interrupt enable for WBASE expired flag.
 *
 * Values:
 * - 0b0 - Interrupt is disabled.
 * - 0b1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_IE_WBEIE field. */
#define UART_RD_IE_WBEIE(base) ((UART_IE_REG(base) & UART_IE_WBEIE_MASK) >> UART_IE_WBEIE_SHIFT)
#define UART_BRD_IE_WBEIE(base) (BME_UBFX8(&UART_IE_REG(base), UART_IE_WBEIE_SHIFT, UART_IE_WBEIE_WIDTH))

/*! @brief Set the WBEIE field to a new value. */
#define UART_WR_IE_WBEIE(base, value) (UART_RMW_IE(base, UART_IE_WBEIE_MASK, UART_IE_WBEIE(value)))
#define UART_BWR_IE_WBEIE(base, value) (BME_BFI8(&UART_IE_REG(base), ((uint8_t)(value) << UART_IE_WBEIE_SHIFT), UART_IE_WBEIE_SHIFT, UART_IE_WBEIE_WIDTH))
/*@}*/

/*!
 * @name Register UART_IE, field PEIE[7] (RW)
 *
 * Interrupt enable for preamble error flag.
 */
/*@{*/
/*! @brief Read current value of the UART_IE_PEIE field. */
#define UART_RD_IE_PEIE(base) ((UART_IE_REG(base) & UART_IE_PEIE_MASK) >> UART_IE_PEIE_SHIFT)
#define UART_BRD_IE_PEIE(base) (BME_UBFX8(&UART_IE_REG(base), UART_IE_PEIE_SHIFT, UART_IE_PEIE_WIDTH))

/*! @brief Set the PEIE field to a new value. */
#define UART_WR_IE_PEIE(base, value) (UART_RMW_IE(base, UART_IE_PEIE_MASK, UART_IE_PEIE(value)))
#define UART_BWR_IE_PEIE(base, value) (BME_BFI8(&UART_IE_REG(base), ((uint8_t)(value) << UART_IE_PEIE_SHIFT), UART_IE_PEIE_SHIFT, UART_IE_PEIE_WIDTH))
/*@}*/

