pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the WBEF field to a new value. */
#define UART_WR_S3_WBEF(base, value) (UART_RMW_S3(base, (UART_S3_WBEF_MASK | UART_S3_TXFF_MASK | UART_S3_PSF_MASK | UART_S3_PCTEF_MASK | UART_S3_PTXF_MASK | UART_S3_PRXF_MASK | UART_S3_PEF_MASK), UART_S3_WBEF(value)))
#define UART_BWR_S3_WBEF(base, value) (BME_BFI8(&UART_S3_REG(base), ((uint8_t)(value) << UART_S3_WBEF_SHIFT), UART_S3_WBEF_SHIFT, UART_S3_WBEF_WIDTH))
/*@}*/

/*!
 * @name Register UART_S3, field PEF[7] (W1C)
 *
 * Indicates that the received preamble has an error. If the received preamble
 * length is greater than 390, the preamble error flag is asserted. It is also
 * asserted on detecting line code violation before completely received the
 * preamble. This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - Preamble is correct.
 * - 0b1 - Preamble has an error.
 */
/*@{*/
/*! @brief Read current value of the UART_S3_PEF field. */
#define UART_RD_S3_PEF(base) ((UART_S3_REG(base) & UART_S3_PEF_MASK) >> UART_S3_PEF_SHIFT)
#define UART_BRD_S3_PEF(base) (BME_UBFX8(&UART_S3_REG(base), UART_S3_PEF_SHIFT, UART_S3_PEF_WIDTH))

/*! @brief Set the PEF field to a new value. */
#define UART_WR_S3_PEF(base, value) (UART_RMW_S3(base, (UART_S3_PEF_MASK | UART_S3_TXFF_MASK | UART_S3_PSF_MASK | UART_S3_PCTEF_MASK | UART_S3_PTXF_MASK | UART_S3_PRXF_MASK | UART_S3_WBEF_MASK), UART_S3_PEF(value)))
#define UART_BWR_S3_PEF(base, value) (BME_BFI8(&UART_S3_REG(base), ((uint8_t)(value) << UART_S3_PEF_SHIFT), UART_S3_PEF_SHIFT, UART_S3_PEF_WIDTH))
/*@}*/

/*******************************************************************************
 * UART_S4 - UART CEA709.1-B Status Register
 ******************************************************************************/

/*!
 * @brief UART_S4 - UART CEA709.1-B Status Register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_S4 register
 */
/*@{*/
#define UART_RD_S4(base)         (UART_S4_REG(base))
#define UART_WR_S4(base, value)  (UART_S4_REG(base) = (value))
#define UART_RMW_S4(base, mask, value) (UART_WR_S4(base, (UART_RD_S4(base) & ~(mask)) | (value)))
#define UART_SET_S4(base, value) (BME_OR8(&UART_S4_REG(base), (uint8_t)(value)))
#define UART_CLR_S4(base, value) (BME_AND8(&UART_S4_REG(base), (uint8_t)(~(value))))
#define UART_TOG_S4(base, value) (BME_XOR8(&UART_S4_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual UART_S4 bitfields
 */

/*!
 * @name Register UART_S4, field FE[0] (W1C)
 *
 * Indicates that the received CEA709.1-B packet has not finished at a byte
 * boundary. This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - Received packet is byte aligned.
 * - 0b1 - Received packet is not byte aligned.
 */
/*@{*/
/*! @brief Read current value of the UART_S4_FE field. */
#define UART_RD_S4_FE(base)  ((UART_S4_REG(base) & UART_S4_FE_MASK) >> UART_S4_FE_SHIFT)
#define UART_BRD_S4_FE(base) (BME_UBFX8(&UART_S4_REG(base), UART_S4_FE_SHIFT, UART_S4_FE_WIDTH))

/*! @brief Set the FE field to a new value. */
#define UART_WR_S4_FE(base, value) (UART_RMW_S4(base, (UART_S4_FE_MASK | UART_S4_TXDF_MASK | UART_S4_CDET_MASK | UART_S4_RPLOF_MASK | UART_S4_LNF_MASK), UART_S4_FE(value)))
#define UART_BWR_S4_FE(base, value) (BME_BFI8(&UART_S4_REG(base), ((uint8_t)(value) << UART_S4_FE_SHIFT), UART_S4_FE_SHIFT, UART_S4_FE_WIDTH))
/*@}*/

/*!
 * @name Register UART_S4, field TXDF[1] (W1C)
 *
 * Indicates that transmission is delayed. This flag is asserted if a packet
 * that is queued for transmission has been delayed because a receive packet started
 * coming in before the packet could be transmitted. In this case C6[TX709] is
 * not cleared automatically. This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - No delay during transmission.
 * - 0b1 - Transmission delay due to incoming recieved packet.
 */
/*@{*/
/*! @brief Read current value of the UART_S4_TXDF field. */
#define UART_RD_S4_TXDF(base) ((UART_S4_REG(base) & UART_S4_TXDF_MASK) >> UART_S4_TXDF_SHIFT)
#define UART_BRD_S4_TXDF(base) (BME_UBFX8(&UART_S4_REG(base), UART_S4_TXDF_SHIFT, UART_S4_TXDF_WIDTH))

/*! @brief Set the TXDF field to a new value. */
#define UART_WR_S4_TXDF(base, value) (UART_RMW_S4(base, (UART_S4_TXDF_MASK | UART_S4_FE_MASK | UART_S4_CDET_MASK | UART_S4_RPLOF_MASK | UART_S4_LNF_MASK), UART_S4_TXDF(value)))
#define UART_BWR_S4_TXDF(base, value) (BME_BFI8(&UART_S4_REG(base), ((uint8_t)(value) << UART_S4_TXDF_SHIFT), UART_S4_TXDF_SHIFT, UART_S4_TXDF_WIDTH))
/*@}*/

/*!
 * @name Register UART_S4, field CDET[3:2] (W1C)
 *
 * Indicates when the collision occurs during transmission. This flag is cleared
 * by writing 2'b11. If the collision flag is not cleared by software and a
 * valid collision pulse is detected during some other phase of transmission, then
 * collision flag continues to indicate the previous value.
 *
 * Values:
 * - 0b00 - No collision.
 * - 0b01 - Collision occurred during preamble.
 * - 0b10 - Collision occurred during byte sync or data.
 * - 0b11 - Collision occurred during line code violation.
 */
/*@{*/
/*! @brief Read current value of the UART_S4_CDET field. */
#define UART_RD_S4_CDET(base) ((UART_S4_REG(base) & UART_S4_CDET_MASK) >> UART_S4_CDET_SHIFT)
#define UART_BRD_S4_CDET(base) (BME_UBFX8(&UART_S4_REG(base), UART_S4_CDET_SHIFT, UART_S4_CDET_WIDTH))

/*! @brief Set the CDET field to a new value. */
#define UART_WR_S4_CDET(base, value) (UART_RMW_S4(base, (UART_S4_CDET_MASK | UART_S4_FE_MASK | UART_S4_TXDF_MASK | UART_S4_RPLOF_MASK | UART_S4_LNF_MASK), UART_S4_CDET(value)))
#define UART_BWR_S4_CDET(base, value) (BME_BFI8(&UART_S4_REG(base), ((uint8_t)(value) << UART_S4_CDET_SHIFT), UART_S4_CDET_SHIFT, UART_S4_CDET_WIDTH))
/*@}*/

/*!
 * @name Register UART_S4, field RPLOF[4] (W1C)
 *
 * Indicates that the received packet length exceeds 255 bytes. This flag is
 * cleared by writing 1.
 *
 * Values:
 * - 0b0 - No received packet overflow.
 * - 0b1 - Received packet length exceeds 255 bytes.
 */
/*@{*/
/*! @brief Read current value of the UART_S4_RPLOF field. */
#define UART_RD_S4_RPLOF(base) ((UART_S4_REG(base) & UART_S4_RPLOF_MASK) >> UART_S4_RPLOF_SHIFT)
#define UART_BRD_S4_RPLOF(base) (BME_UBFX8(&UART_S4_REG(base), UART_S4_RPLOF_SHIFT, UART_S4_RPLOF_WIDTH))

/*! @brief Set the RPLOF field to a new value. */
#define UART_WR_S4_RPLOF(base, value) (UART_RMW_S4(base, (UART_S4_RPLOF_MASK | UART_S4_FE_MASK | UART_S4_TXDF_MASK | UART_S4_CDET_MASK | UART_S4_LNF_MASK), UART_S4_RPLOF(value)))
#define UART_BWR_S4_RPLOF(base, value) (BME_BFI8(&UART_S4_REG(base), ((uint8_t)(value) << UART_S4_RPLOF_SHIFT), UART_S4_RPLOF_SHIFT, UART_S4_RPLOF_WIDTH))
/*@}*/

/*!
 * @name Register UART_S4, field LNF[5] (W1C)
 *
 * Indicates that the noise is present during the sampling of received packet.
 * This flag is set if any of the three samples used to determine the half bit
 * data values in either half of a bit doesn't match the other two samples. The
 * samples are determined at RT3, RT4, RT5 for first half bit and RT11, RT12, RT13
 * for second half bit. This flag is cleared by writing 1.
 *
 * Values:
 * - 0b0 - No noise present in the received packet
 * - 0b1 - Noise detected during the sampling of received packet
 */
/*@{*/
/*! @brief Read current value of the UART_S4_LNF field. */
#define UART_RD_S4_LNF(base) ((UART_S4_REG(base) & UART_S4_LNF_MASK) >> UART_S4_LNF_SHIFT)
#define UART_BRD_S4_LNF(base) (BME_UBFX8(&UART_S4_REG(base), UART_S4_LNF_SHIFT, UART_S4_LNF_WIDTH))

/*! @brief Set the LNF field to a new value. */
#define UART_WR_S4_LNF(base, value) (UART_RMW_S4(base, (UART_S4_LNF_MASK | UART_S4_FE_MASK | UART_S4_TXDF_MASK | UART_S4_CDET_MASK | UART_S4_RPLOF_MASK), UART_S4_LNF(value)))
#define UART_BWR_S4_LNF(base, value) (BME_BFI8(&UART_S4_REG(base), ((uint8_t)(value) << UART_S4_LNF_SHIFT), UART_S4_LNF_SHIFT, UART_S4_LNF_WIDTH))
/*@}*/

