pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * UART_RPL - UART CEA709.1-B Received Packet Length
 ******************************************************************************/

/*!
 * @brief UART_RPL - UART CEA709.1-B Received Packet Length (RO)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RPL register
 */
/*@{*/
#define UART_RD_RPL(base)        (UART_RPL_REG(base))
/*@}*/

/*******************************************************************************
 * UART_RPREL - UART CEA709.1-B Received Preamble Length
 ******************************************************************************/

/*!
 * @brief UART_RPREL - UART CEA709.1-B Received Preamble Length (RO)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RPREL register
 */
/*@{*/
#define UART_RD_RPREL(base)      (UART_RPREL_REG(base))
/*@}*/

/*******************************************************************************
 * UART_CPW - UART CEA709.1-B Collision Pulse Width
 ******************************************************************************/

/*!
 * @brief UART_CPW - UART CEA709.1-B Collision Pulse Width (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_CPW register
 */
/*@{*/
#define UART_RD_CPW(base)        (UART_CPW_REG(base))
#define UART_WR_CPW(base, value) (UART_CPW_REG(base) = (value))
#define UART_RMW_CPW(base, mask, value) (UART_WR_CPW(base, (UART_RD_CPW(base) & ~(mask)) | (value)))
#define UART_SET_CPW(base, value) (BME_OR8(&UART_CPW_REG(base), (uint8_t)(value)))
#define UART_CLR_CPW(base, value) (BME_AND8(&UART_CPW_REG(base), (uint8_t)(~(value))))
#define UART_TOG_CPW(base, value) (BME_XOR8(&UART_CPW_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_RIDTH - UART CEA709.1-B Receive Indeterminate Time High
 ******************************************************************************/

/*!
 * @brief UART_RIDTH - UART CEA709.1-B Receive Indeterminate Time High (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RIDTH register
 */
/*@{*/
#define UART_RD_RIDTH(base)      (UART_RIDTH_REG(base))
#define UART_WR_RIDTH(base, value) (UART_RIDTH_REG(base) = (value))
#define UART_RMW_RIDTH(base, mask, value) (UART_WR_RIDTH(base, (UART_RD_RIDTH(base) & ~(mask)) | (value)))
#define UART_SET_RIDTH(base, value) (BME_OR8(&UART_RIDTH_REG(base), (uint8_t)(value)))
#define UART_CLR_RIDTH(base, value) (BME_AND8(&UART_RIDTH_REG(base), (uint8_t)(~(value))))
#define UART_TOG_RIDTH(base, value) (BME_XOR8(&UART_RIDTH_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_RIDTL - UART CEA709.1-B Receive Indeterminate Time Low
 ******************************************************************************/

/*!
 * @brief UART_RIDTL - UART CEA709.1-B Receive Indeterminate Time Low (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RIDTL register
 */
/*@{*/
#define UART_RD_RIDTL(base)      (UART_RIDTL_REG(base))
#define UART_WR_RIDTL(base, value) (UART_RIDTL_REG(base) = (value))
#define UART_RMW_RIDTL(base, mask, value) (UART_WR_RIDTL(base, (UART_RD_RIDTL(base) & ~(mask)) | (value)))
#define UART_SET_RIDTL(base, value) (BME_OR8(&UART_RIDTL_REG(base), (uint8_t)(value)))
#define UART_CLR_RIDTL(base, value) (BME_AND8(&UART_RIDTL_REG(base), (uint8_t)(~(value))))
#define UART_TOG_RIDTL(base, value) (BME_XOR8(&UART_RIDTL_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_TIDTH - UART CEA709.1-B Transmit Indeterminate Time High
 ******************************************************************************/

/*!
 * @brief UART_TIDTH - UART CEA709.1-B Transmit Indeterminate Time High (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_TIDTH register
 */
/*@{*/
#define UART_RD_TIDTH(base)      (UART_TIDTH_REG(base))
#define UART_WR_TIDTH(base, value) (UART_TIDTH_REG(base) = (value))
#define UART_RMW_TIDTH(base, mask, value) (UART_WR_TIDTH(base, (UART_RD_TIDTH(base) & ~(mask)) | (value)))
#define UART_SET_TIDTH(base, value) (BME_OR8(&UART_TIDTH_REG(base), (uint8_t)(value)))
#define UART_CLR_TIDTH(base, value) (BME_AND8(&UART_TIDTH_REG(base), (uint8_t)(~(value))))
#define UART_TOG_TIDTH(base, value) (BME_XOR8(&UART_TIDTH_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_TIDTL - UART CEA709.1-B Transmit Indeterminate Time Low
 ******************************************************************************/

/*!
 * @brief UART_TIDTL - UART CEA709.1-B Transmit Indeterminate Time Low (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_TIDTL register
 */
/*@{*/
#define UART_RD_TIDTL(base)      (UART_TIDTL_REG(base))
#define UART_WR_TIDTL(base, value) (UART_TIDTL_REG(base) = (value))
#define UART_RMW_TIDTL(base, mask, value) (UART_WR_TIDTL(base, (UART_RD_TIDTL(base) & ~(mask)) | (value)))
#define UART_SET_TIDTL(base, value) (BME_OR8(&UART_TIDTL_REG(base), (uint8_t)(value)))
#define UART_CLR_TIDTL(base, value) (BME_AND8(&UART_TIDTL_REG(base), (uint8_t)(~(value))))
#define UART_TOG_TIDTL(base, value) (BME_XOR8(&UART_TIDTL_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_RB1TH - UART CEA709.1-B Receive Beta1 Timer High
 ******************************************************************************/

/*!
 * @brief UART_RB1TH - UART CEA709.1-B Receive Beta1 Timer High (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RB1TH register
 */
/*@{*/
#define UART_RD_RB1TH(base)      (UART_RB1TH_REG(base))
#define UART_WR_RB1TH(base, value) (UART_RB1TH_REG(base) = (value))
#define UART_RMW_RB1TH(base, mask, value) (UART_WR_RB1TH(base, (UART_RD_RB1TH(base) & ~(mask)) | (value)))
#define UART_SET_RB1TH(base, value) (BME_OR8(&UART_RB1TH_REG(base), (uint8_t)(value)))
#define UART_CLR_RB1TH(base, value) (BME_AND8(&UART_RB1TH_REG(base), (uint8_t)(~(value))))
#define UART_TOG_RB1TH(base, value) (BME_XOR8(&UART_RB1TH_REG(base), (uint8_t)(value)))
/*@}*/

