pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * UART_RB1TL - UART CEA709.1-B Receive Beta1 Timer Low
 ******************************************************************************/

/*!
 * @brief UART_RB1TL - UART CEA709.1-B Receive Beta1 Timer Low (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_RB1TL register
 */
/*@{*/
#define UART_RD_RB1TL(base)      (UART_RB1TL_REG(base))
#define UART_WR_RB1TL(base, value) (UART_RB1TL_REG(base) = (value))
#define UART_RMW_RB1TL(base, mask, value) (UART_WR_RB1TL(base, (UART_RD_RB1TL(base) & ~(mask)) | (value)))
#define UART_SET_RB1TL(base, value) (BME_OR8(&UART_RB1TL_REG(base), (uint8_t)(value)))
#define UART_CLR_RB1TL(base, value) (BME_AND8(&UART_RB1TL_REG(base), (uint8_t)(~(value))))
#define UART_TOG_RB1TL(base, value) (BME_XOR8(&UART_RB1TL_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_TB1TH - UART CEA709.1-B Transmit Beta1 Timer High
 ******************************************************************************/

/*!
 * @brief UART_TB1TH - UART CEA709.1-B Transmit Beta1 Timer High (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_TB1TH register
 */
/*@{*/
#define UART_RD_TB1TH(base)      (UART_TB1TH_REG(base))
#define UART_WR_TB1TH(base, value) (UART_TB1TH_REG(base) = (value))
#define UART_RMW_TB1TH(base, mask, value) (UART_WR_TB1TH(base, (UART_RD_TB1TH(base) & ~(mask)) | (value)))
#define UART_SET_TB1TH(base, value) (BME_OR8(&UART_TB1TH_REG(base), (uint8_t)(value)))
#define UART_CLR_TB1TH(base, value) (BME_AND8(&UART_TB1TH_REG(base), (uint8_t)(~(value))))
#define UART_TOG_TB1TH(base, value) (BME_XOR8(&UART_TB1TH_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_TB1TL - UART CEA709.1-B Transmit Beta1 Timer Low
 ******************************************************************************/

/*!
 * @brief UART_TB1TL - UART CEA709.1-B Transmit Beta1 Timer Low (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_TB1TL register
 */
/*@{*/
#define UART_RD_TB1TL(base)      (UART_TB1TL_REG(base))
#define UART_WR_TB1TL(base, value) (UART_TB1TL_REG(base) = (value))
#define UART_RMW_TB1TL(base, mask, value) (UART_WR_TB1TL(base, (UART_RD_TB1TL(base) & ~(mask)) | (value)))
#define UART_SET_TB1TL(base, value) (BME_OR8(&UART_TB1TL_REG(base), (uint8_t)(value)))
#define UART_CLR_TB1TL(base, value) (BME_AND8(&UART_TB1TL_REG(base), (uint8_t)(~(value))))
#define UART_TOG_TB1TL(base, value) (BME_XOR8(&UART_TB1TL_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * UART_PROG_REG - UART CEA709.1-B Programmable register
 ******************************************************************************/

/*!
 * @brief UART_PROG_REG - UART CEA709.1-B Programmable register (RW)
 *
 * Reset value: 0x43U
 */
/*!
 * @name Constants and macros for entire UART_PROG_REG register
 */
/*@{*/
#define UART_RD_PROG_REG(base)   (UART_PROG_REG_REG(base))
#define UART_WR_PROG_REG(base, value) (UART_PROG_REG_REG(base) = (value))
#define UART_RMW_PROG_REG(base, mask, value) (UART_WR_PROG_REG(base, (UART_RD_PROG_REG(base) & ~(mask)) | (value)))
#define UART_SET_PROG_REG(base, value) (BME_OR8(&UART_PROG_REG_REG(base), (uint8_t)(value)))
#define UART_CLR_PROG_REG(base, value) (BME_AND8(&UART_PROG_REG_REG(base), (uint8_t)(~(value))))
#define UART_TOG_PROG_REG(base, value) (BME_XOR8(&UART_PROG_REG_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual UART_PROG_REG bitfields
 */

/*!
 * @name Register UART_PROG_REG, field MIN_DMC1[3:0] (RW)
 *
 * This register field indicates the minimum DMC-1s that should be detected
 * before the byte-sync during the preamble detection state.
 */
/*@{*/
/*! @brief Read current value of the UART_PROG_REG_MIN_DMC1 field. */
#define UART_RD_PROG_REG_MIN_DMC1(base) ((UART_PROG_REG_REG(base) & UART_PROG_REG_MIN_DMC1_MASK) >> UART_PROG_REG_MIN_DMC1_SHIFT)
#define UART_BRD_PROG_REG_MIN_DMC1(base) (BME_UBFX8(&UART_PROG_REG_REG(base), UART_PROG_REG_MIN_DMC1_SHIFT, UART_PROG_REG_MIN_DMC1_WIDTH))

/*! @brief Set the MIN_DMC1 field to a new value. */
#define UART_WR_PROG_REG_MIN_DMC1(base, value) (UART_RMW_PROG_REG(base, UART_PROG_REG_MIN_DMC1_MASK, UART_PROG_REG_MIN_DMC1(value)))
#define UART_BWR_PROG_REG_MIN_DMC1(base, value) (BME_BFI8(&UART_PROG_REG_REG(base), ((uint8_t)(value) << UART_PROG_REG_MIN_DMC1_SHIFT), UART_PROG_REG_MIN_DMC1_SHIFT, UART_PROG_REG_MIN_DMC1_WIDTH))
/*@}*/

/*!
 * @name Register UART_PROG_REG, field LCV_LEN[7:4] (RW)
 *
 * This register field provides the programmable value to detect the line code
 * violation. Line code violation is detected if the line code violation counter
 * reached the programmed LCV_LEN. The LCV_LEN has a 5-bit value intenally with
 * programmable 4-bit while the MSbit is forced to '1' to ensure minimum value of
 * 20 on reset.
 */
/*@{*/
/*! @brief Read current value of the UART_PROG_REG_LCV_LEN field. */
#define UART_RD_PROG_REG_LCV_LEN(base) ((UART_PROG_REG_REG(base) & UART_PROG_REG_LCV_LEN_MASK) >> UART_PROG_REG_LCV_LEN_SHIFT)
#define UART_BRD_PROG_REG_LCV_LEN(base) (BME_UBFX8(&UART_PROG_REG_REG(base), UART_PROG_REG_LCV_LEN_SHIFT, UART_PROG_REG_LCV_LEN_WIDTH))

/*! @brief Set the LCV_LEN field to a new value. */
#define UART_WR_PROG_REG_LCV_LEN(base, value) (UART_RMW_PROG_REG(base, UART_PROG_REG_LCV_LEN_MASK, UART_PROG_REG_LCV_LEN(value)))
#define UART_BWR_PROG_REG_LCV_LEN(base, value) (BME_BFI8(&UART_PROG_REG_REG(base), ((uint8_t)(value) << UART_PROG_REG_LCV_LEN_SHIFT), UART_PROG_REG_LCV_LEN_SHIFT, UART_PROG_REG_LCV_LEN_WIDTH))
/*@}*/

/*******************************************************************************
 * UART_STATE_REG - UART CEA709.1-B State register
 ******************************************************************************/

/*!
 * @brief UART_STATE_REG - UART CEA709.1-B State register (RO)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_STATE_REG register
 */
/*@{*/
#define UART_RD_STATE_REG(base)  (UART_STATE_REG_REG(base))
/*@}*/

