pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * WDOG_RSTCNT - Watchdog Reset Count register
 ******************************************************************************/

/*!
 * @brief WDOG_RSTCNT - Watchdog Reset Count register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire WDOG_RSTCNT register
 */
/*@{*/
#define WDOG_RD_RSTCNT(base)     (WDOG_RSTCNT_REG(base))
#define WDOG_WR_RSTCNT(base, value) (WDOG_RSTCNT_REG(base) = (value))
#define WDOG_RMW_RSTCNT(base, mask, value) (WDOG_WR_RSTCNT(base, (WDOG_RD_RSTCNT(base) & ~(mask)) | (value)))
#define WDOG_SET_RSTCNT(base, value) (BME_OR16(&WDOG_RSTCNT_REG(base), (uint16_t)(value)))
#define WDOG_CLR_RSTCNT(base, value) (BME_AND16(&WDOG_RSTCNT_REG(base), (uint16_t)(~(value))))
#define WDOG_TOG_RSTCNT(base, value) (BME_XOR16(&WDOG_RSTCNT_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * WDOG_PRESC - Watchdog Prescaler register
 ******************************************************************************/

/*!
 * @brief WDOG_PRESC - Watchdog Prescaler register (RW)
 *
 * Reset value: 0x0400U
 */
/*!
 * @name Constants and macros for entire WDOG_PRESC register
 */
/*@{*/
#define WDOG_RD_PRESC(base)      (WDOG_PRESC_REG(base))
#define WDOG_WR_PRESC(base, value) (WDOG_PRESC_REG(base) = (value))
#define WDOG_RMW_PRESC(base, mask, value) (WDOG_WR_PRESC(base, (WDOG_RD_PRESC(base) & ~(mask)) | (value)))
#define WDOG_SET_PRESC(base, value) (BME_OR16(&WDOG_PRESC_REG(base), (uint16_t)(value)))
#define WDOG_CLR_PRESC(base, value) (BME_AND16(&WDOG_PRESC_REG(base), (uint16_t)(~(value))))
#define WDOG_TOG_PRESC(base, value) (BME_XOR16(&WDOG_PRESC_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual WDOG_PRESC bitfields
 */

/*!
 * @name Register WDOG_PRESC, field PRESCVAL[10:8] (RW)
 *
 * 3-bit prescaler for the watchdog clock source. A value of zero indicates no
 * division of the input WDOG clock. The watchdog clock is divided by (PRESCVAL +
 * 1) to provide the prescaled WDOG_CLK.
 */
/*@{*/
/*! @brief Read current value of the WDOG_PRESC_PRESCVAL field. */
#define WDOG_RD_PRESC_PRESCVAL(base) ((WDOG_PRESC_REG(base) & WDOG_PRESC_PRESCVAL_MASK) >> WDOG_PRESC_PRESCVAL_SHIFT)
#define WDOG_BRD_PRESC_PRESCVAL(base) (BME_UBFX16(&WDOG_PRESC_REG(base), WDOG_PRESC_PRESCVAL_SHIFT, WDOG_PRESC_PRESCVAL_WIDTH))

/*! @brief Set the PRESCVAL field to a new value. */
#define WDOG_WR_PRESC_PRESCVAL(base, value) (WDOG_RMW_PRESC(base, WDOG_PRESC_PRESCVAL_MASK, WDOG_PRESC_PRESCVAL(value)))
#define WDOG_BWR_PRESC_PRESCVAL(base, value) (BME_BFI16(&WDOG_PRESC_REG(base), ((uint16_t)(value) << WDOG_PRESC_PRESCVAL_SHIFT), WDOG_PRESC_PRESCVAL_SHIFT, WDOG_PRESC_PRESCVAL_WIDTH))
/*@}*/

/*
 * MKV58F22 XBARA
 *
 * Crossbar Switch
 *
 * Registers defined in this header file:
 * - XBARA_SEL0 - Crossbar A Select Register 0
 * - XBARA_SEL1 - Crossbar A Select Register 1
 * - XBARA_SEL2 - Crossbar A Select Register 2
 * - XBARA_SEL3 - Crossbar A Select Register 3
 * - XBARA_SEL4 - Crossbar A Select Register 4
 * - XBARA_SEL5 - Crossbar A Select Register 5
 * - XBARA_SEL6 - Crossbar A Select Register 6
 * - XBARA_SEL7 - Crossbar A Select Register 7
 * - XBARA_SEL8 - Crossbar A Select Register 8
 * - XBARA_SEL9 - Crossbar A Select Register 9
 * - XBARA_SEL10 - Crossbar A Select Register 10
 * - XBARA_SEL11 - Crossbar A Select Register 11
 * - XBARA_SEL12 - Crossbar A Select Register 12
 * - XBARA_SEL13 - Crossbar A Select Register 13
 * - XBARA_SEL14 - Crossbar A Select Register 14
 * - XBARA_SEL15 - Crossbar A Select Register 15
 * - XBARA_SEL16 - Crossbar A Select Register 16
 * - XBARA_SEL17 - Crossbar A Select Register 17
 * - XBARA_SEL18 - Crossbar A Select Register 18
 * - XBARA_SEL19 - Crossbar A Select Register 19
 * - XBARA_SEL20 - Crossbar A Select Register 20
 * - XBARA_SEL21 - Crossbar A Select Register 21
 * - XBARA_SEL22 - Crossbar A Select Register 22
 * - XBARA_SEL23 - Crossbar A Select Register 23
 * - XBARA_SEL24 - Crossbar A Select Register 24
 * - XBARA_SEL25 - Crossbar A Select Register 25
 * - XBARA_SEL26 - Crossbar A Select Register 26
 * - XBARA_SEL27 - Crossbar A Select Register 27
 * - XBARA_SEL28 - Crossbar A Select Register 28
 * - XBARA_SEL29 - Crossbar A Select Register 29
 * - XBARA_CTRL0 - Crossbar A Control Register 0
 * - XBARA_CTRL1 - Crossbar A Control Register 1
 */

#define XBARA_INSTANCE_COUNT (1U) /*!< Number of instances of the XBARA module. */
#define XBARA_IDX (0U) /*!< Instance number for XBARA. */

/*******************************************************************************
 * XBARA_SEL0 - Crossbar A Select Register 0
 ******************************************************************************/

/*!
 * @brief XBARA_SEL0 - Crossbar A Select Register 0 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL0 register
 */
/*@{*/
#define XBARA_RD_SEL0(base)      (XBARA_SEL0_REG(base))
#define XBARA_WR_SEL0(base, value) (XBARA_SEL0_REG(base) = (value))
#define XBARA_RMW_SEL0(base, mask, value) (XBARA_WR_SEL0(base, (XBARA_RD_SEL0(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL0(base, value) (BME_OR16(&XBARA_SEL0_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL0(base, value) (BME_AND16(&XBARA_SEL0_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL0(base, value) (BME_XOR16(&XBARA_SEL0_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL0 bitfields
 */

/*!
 * @name Register XBARA_SEL0, field SEL0[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT0 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL0_SEL0 field. */
#define XBARA_RD_SEL0_SEL0(base) ((XBARA_SEL0_REG(base) & XBARA_SEL0_SEL0_MASK) >> XBARA_SEL0_SEL0_SHIFT)
#define XBARA_BRD_SEL0_SEL0(base) (BME_UBFX16(&XBARA_SEL0_REG(base), XBARA_SEL0_SEL0_SHIFT, XBARA_SEL0_SEL0_WIDTH))

/*! @brief Set the SEL0 field to a new value. */
#define XBARA_WR_SEL0_SEL0(base, value) (XBARA_RMW_SEL0(base, XBARA_SEL0_SEL0_MASK, XBARA_SEL0_SEL0(value)))
#define XBARA_BWR_SEL0_SEL0(base, value) (BME_BFI16(&XBARA_SEL0_REG(base), ((uint16_t)(value) << XBARA_SEL0_SEL0_SHIFT), XBARA_SEL0_SEL0_SHIFT, XBARA_SEL0_SEL0_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL0, field SEL1[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT1 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL0_SEL1 field. */
#define XBARA_RD_SEL0_SEL1(base) ((XBARA_SEL0_REG(base) & XBARA_SEL0_SEL1_MASK) >> XBARA_SEL0_SEL1_SHIFT)
#define XBARA_BRD_SEL0_SEL1(base) (BME_UBFX16(&XBARA_SEL0_REG(base), XBARA_SEL0_SEL1_SHIFT, XBARA_SEL0_SEL1_WIDTH))

/*! @brief Set the SEL1 field to a new value. */
#define XBARA_WR_SEL0_SEL1(base, value) (XBARA_RMW_SEL0(base, XBARA_SEL0_SEL1_MASK, XBARA_SEL0_SEL1(value)))
#define XBARA_BWR_SEL0_SEL1(base, value) (BME_BFI16(&XBARA_SEL0_REG(base), ((uint16_t)(value) << XBARA_SEL0_SEL1_SHIFT), XBARA_SEL0_SEL1_SHIFT, XBARA_SEL0_SEL1_WIDTH))
/*@}*/

