pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * XBARA_SEL6 - Crossbar A Select Register 6
 ******************************************************************************/

/*!
 * @brief XBARA_SEL6 - Crossbar A Select Register 6 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL6 register
 */
/*@{*/
#define XBARA_RD_SEL6(base)      (XBARA_SEL6_REG(base))
#define XBARA_WR_SEL6(base, value) (XBARA_SEL6_REG(base) = (value))
#define XBARA_RMW_SEL6(base, mask, value) (XBARA_WR_SEL6(base, (XBARA_RD_SEL6(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL6(base, value) (BME_OR16(&XBARA_SEL6_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL6(base, value) (BME_AND16(&XBARA_SEL6_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL6(base, value) (BME_XOR16(&XBARA_SEL6_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL6 bitfields
 */

/*!
 * @name Register XBARA_SEL6, field SEL12[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT12 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL6_SEL12 field. */
#define XBARA_RD_SEL6_SEL12(base) ((XBARA_SEL6_REG(base) & XBARA_SEL6_SEL12_MASK) >> XBARA_SEL6_SEL12_SHIFT)
#define XBARA_BRD_SEL6_SEL12(base) (BME_UBFX16(&XBARA_SEL6_REG(base), XBARA_SEL6_SEL12_SHIFT, XBARA_SEL6_SEL12_WIDTH))

/*! @brief Set the SEL12 field to a new value. */
#define XBARA_WR_SEL6_SEL12(base, value) (XBARA_RMW_SEL6(base, XBARA_SEL6_SEL12_MASK, XBARA_SEL6_SEL12(value)))
#define XBARA_BWR_SEL6_SEL12(base, value) (BME_BFI16(&XBARA_SEL6_REG(base), ((uint16_t)(value) << XBARA_SEL6_SEL12_SHIFT), XBARA_SEL6_SEL12_SHIFT, XBARA_SEL6_SEL12_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL6, field SEL13[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT13 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL6_SEL13 field. */
#define XBARA_RD_SEL6_SEL13(base) ((XBARA_SEL6_REG(base) & XBARA_SEL6_SEL13_MASK) >> XBARA_SEL6_SEL13_SHIFT)
#define XBARA_BRD_SEL6_SEL13(base) (BME_UBFX16(&XBARA_SEL6_REG(base), XBARA_SEL6_SEL13_SHIFT, XBARA_SEL6_SEL13_WIDTH))

/*! @brief Set the SEL13 field to a new value. */
#define XBARA_WR_SEL6_SEL13(base, value) (XBARA_RMW_SEL6(base, XBARA_SEL6_SEL13_MASK, XBARA_SEL6_SEL13(value)))
#define XBARA_BWR_SEL6_SEL13(base, value) (BME_BFI16(&XBARA_SEL6_REG(base), ((uint16_t)(value) << XBARA_SEL6_SEL13_SHIFT), XBARA_SEL6_SEL13_SHIFT, XBARA_SEL6_SEL13_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL7 - Crossbar A Select Register 7
 ******************************************************************************/

/*!
 * @brief XBARA_SEL7 - Crossbar A Select Register 7 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL7 register
 */
/*@{*/
#define XBARA_RD_SEL7(base)      (XBARA_SEL7_REG(base))
#define XBARA_WR_SEL7(base, value) (XBARA_SEL7_REG(base) = (value))
#define XBARA_RMW_SEL7(base, mask, value) (XBARA_WR_SEL7(base, (XBARA_RD_SEL7(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL7(base, value) (BME_OR16(&XBARA_SEL7_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL7(base, value) (BME_AND16(&XBARA_SEL7_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL7(base, value) (BME_XOR16(&XBARA_SEL7_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL7 bitfields
 */

/*!
 * @name Register XBARA_SEL7, field SEL14[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT14 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL7_SEL14 field. */
#define XBARA_RD_SEL7_SEL14(base) ((XBARA_SEL7_REG(base) & XBARA_SEL7_SEL14_MASK) >> XBARA_SEL7_SEL14_SHIFT)
#define XBARA_BRD_SEL7_SEL14(base) (BME_UBFX16(&XBARA_SEL7_REG(base), XBARA_SEL7_SEL14_SHIFT, XBARA_SEL7_SEL14_WIDTH))

/*! @brief Set the SEL14 field to a new value. */
#define XBARA_WR_SEL7_SEL14(base, value) (XBARA_RMW_SEL7(base, XBARA_SEL7_SEL14_MASK, XBARA_SEL7_SEL14(value)))
#define XBARA_BWR_SEL7_SEL14(base, value) (BME_BFI16(&XBARA_SEL7_REG(base), ((uint16_t)(value) << XBARA_SEL7_SEL14_SHIFT), XBARA_SEL7_SEL14_SHIFT, XBARA_SEL7_SEL14_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL7, field SEL15[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT15 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL7_SEL15 field. */
#define XBARA_RD_SEL7_SEL15(base) ((XBARA_SEL7_REG(base) & XBARA_SEL7_SEL15_MASK) >> XBARA_SEL7_SEL15_SHIFT)
#define XBARA_BRD_SEL7_SEL15(base) (BME_UBFX16(&XBARA_SEL7_REG(base), XBARA_SEL7_SEL15_SHIFT, XBARA_SEL7_SEL15_WIDTH))

/*! @brief Set the SEL15 field to a new value. */
#define XBARA_WR_SEL7_SEL15(base, value) (XBARA_RMW_SEL7(base, XBARA_SEL7_SEL15_MASK, XBARA_SEL7_SEL15(value)))
#define XBARA_BWR_SEL7_SEL15(base, value) (BME_BFI16(&XBARA_SEL7_REG(base), ((uint16_t)(value) << XBARA_SEL7_SEL15_SHIFT), XBARA_SEL7_SEL15_SHIFT, XBARA_SEL7_SEL15_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL8 - Crossbar A Select Register 8
 ******************************************************************************/

/*!
 * @brief XBARA_SEL8 - Crossbar A Select Register 8 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL8 register
 */
/*@{*/
#define XBARA_RD_SEL8(base)      (XBARA_SEL8_REG(base))
#define XBARA_WR_SEL8(base, value) (XBARA_SEL8_REG(base) = (value))
#define XBARA_RMW_SEL8(base, mask, value) (XBARA_WR_SEL8(base, (XBARA_RD_SEL8(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL8(base, value) (BME_OR16(&XBARA_SEL8_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL8(base, value) (BME_AND16(&XBARA_SEL8_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL8(base, value) (BME_XOR16(&XBARA_SEL8_REG(base), (uint16_t)(value)))
/*@}*/

