pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual XBARA_SEL8 bitfields
 */

/*!
 * @name Register XBARA_SEL8, field SEL16[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT16 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL8_SEL16 field. */
#define XBARA_RD_SEL8_SEL16(base) ((XBARA_SEL8_REG(base) & XBARA_SEL8_SEL16_MASK) >> XBARA_SEL8_SEL16_SHIFT)
#define XBARA_BRD_SEL8_SEL16(base) (BME_UBFX16(&XBARA_SEL8_REG(base), XBARA_SEL8_SEL16_SHIFT, XBARA_SEL8_SEL16_WIDTH))

/*! @brief Set the SEL16 field to a new value. */
#define XBARA_WR_SEL8_SEL16(base, value) (XBARA_RMW_SEL8(base, XBARA_SEL8_SEL16_MASK, XBARA_SEL8_SEL16(value)))
#define XBARA_BWR_SEL8_SEL16(base, value) (BME_BFI16(&XBARA_SEL8_REG(base), ((uint16_t)(value) << XBARA_SEL8_SEL16_SHIFT), XBARA_SEL8_SEL16_SHIFT, XBARA_SEL8_SEL16_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL8, field SEL17[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT17 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL8_SEL17 field. */
#define XBARA_RD_SEL8_SEL17(base) ((XBARA_SEL8_REG(base) & XBARA_SEL8_SEL17_MASK) >> XBARA_SEL8_SEL17_SHIFT)
#define XBARA_BRD_SEL8_SEL17(base) (BME_UBFX16(&XBARA_SEL8_REG(base), XBARA_SEL8_SEL17_SHIFT, XBARA_SEL8_SEL17_WIDTH))

/*! @brief Set the SEL17 field to a new value. */
#define XBARA_WR_SEL8_SEL17(base, value) (XBARA_RMW_SEL8(base, XBARA_SEL8_SEL17_MASK, XBARA_SEL8_SEL17(value)))
#define XBARA_BWR_SEL8_SEL17(base, value) (BME_BFI16(&XBARA_SEL8_REG(base), ((uint16_t)(value) << XBARA_SEL8_SEL17_SHIFT), XBARA_SEL8_SEL17_SHIFT, XBARA_SEL8_SEL17_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL9 - Crossbar A Select Register 9
 ******************************************************************************/

/*!
 * @brief XBARA_SEL9 - Crossbar A Select Register 9 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL9 register
 */
/*@{*/
#define XBARA_RD_SEL9(base)      (XBARA_SEL9_REG(base))
#define XBARA_WR_SEL9(base, value) (XBARA_SEL9_REG(base) = (value))
#define XBARA_RMW_SEL9(base, mask, value) (XBARA_WR_SEL9(base, (XBARA_RD_SEL9(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL9(base, value) (BME_OR16(&XBARA_SEL9_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL9(base, value) (BME_AND16(&XBARA_SEL9_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL9(base, value) (BME_XOR16(&XBARA_SEL9_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL9 bitfields
 */

/*!
 * @name Register XBARA_SEL9, field SEL18[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT18 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL9_SEL18 field. */
#define XBARA_RD_SEL9_SEL18(base) ((XBARA_SEL9_REG(base) & XBARA_SEL9_SEL18_MASK) >> XBARA_SEL9_SEL18_SHIFT)
#define XBARA_BRD_SEL9_SEL18(base) (BME_UBFX16(&XBARA_SEL9_REG(base), XBARA_SEL9_SEL18_SHIFT, XBARA_SEL9_SEL18_WIDTH))

/*! @brief Set the SEL18 field to a new value. */
#define XBARA_WR_SEL9_SEL18(base, value) (XBARA_RMW_SEL9(base, XBARA_SEL9_SEL18_MASK, XBARA_SEL9_SEL18(value)))
#define XBARA_BWR_SEL9_SEL18(base, value) (BME_BFI16(&XBARA_SEL9_REG(base), ((uint16_t)(value) << XBARA_SEL9_SEL18_SHIFT), XBARA_SEL9_SEL18_SHIFT, XBARA_SEL9_SEL18_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL9, field SEL19[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT19 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL9_SEL19 field. */
#define XBARA_RD_SEL9_SEL19(base) ((XBARA_SEL9_REG(base) & XBARA_SEL9_SEL19_MASK) >> XBARA_SEL9_SEL19_SHIFT)
#define XBARA_BRD_SEL9_SEL19(base) (BME_UBFX16(&XBARA_SEL9_REG(base), XBARA_SEL9_SEL19_SHIFT, XBARA_SEL9_SEL19_WIDTH))

/*! @brief Set the SEL19 field to a new value. */
#define XBARA_WR_SEL9_SEL19(base, value) (XBARA_RMW_SEL9(base, XBARA_SEL9_SEL19_MASK, XBARA_SEL9_SEL19(value)))
#define XBARA_BWR_SEL9_SEL19(base, value) (BME_BFI16(&XBARA_SEL9_REG(base), ((uint16_t)(value) << XBARA_SEL9_SEL19_SHIFT), XBARA_SEL9_SEL19_SHIFT, XBARA_SEL9_SEL19_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL10 - Crossbar A Select Register 10
 ******************************************************************************/

/*!
 * @brief XBARA_SEL10 - Crossbar A Select Register 10 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL10 register
 */
/*@{*/
#define XBARA_RD_SEL10(base)     (XBARA_SEL10_REG(base))
#define XBARA_WR_SEL10(base, value) (XBARA_SEL10_REG(base) = (value))
#define XBARA_RMW_SEL10(base, mask, value) (XBARA_WR_SEL10(base, (XBARA_RD_SEL10(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL10(base, value) (BME_OR16(&XBARA_SEL10_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL10(base, value) (BME_AND16(&XBARA_SEL10_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL10(base, value) (BME_XOR16(&XBARA_SEL10_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL10 bitfields
 */

/*!
 * @name Register XBARA_SEL10, field SEL20[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT20 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL10_SEL20 field. */
#define XBARA_RD_SEL10_SEL20(base) ((XBARA_SEL10_REG(base) & XBARA_SEL10_SEL20_MASK) >> XBARA_SEL10_SEL20_SHIFT)
#define XBARA_BRD_SEL10_SEL20(base) (BME_UBFX16(&XBARA_SEL10_REG(base), XBARA_SEL10_SEL20_SHIFT, XBARA_SEL10_SEL20_WIDTH))

/*! @brief Set the SEL20 field to a new value. */
#define XBARA_WR_SEL10_SEL20(base, value) (XBARA_RMW_SEL10(base, XBARA_SEL10_SEL20_MASK, XBARA_SEL10_SEL20(value)))
#define XBARA_BWR_SEL10_SEL20(base, value) (BME_BFI16(&XBARA_SEL10_REG(base), ((uint16_t)(value) << XBARA_SEL10_SEL20_SHIFT), XBARA_SEL10_SEL20_SHIFT, XBARA_SEL10_SEL20_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL10, field SEL21[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT21 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL10_SEL21 field. */
#define XBARA_RD_SEL10_SEL21(base) ((XBARA_SEL10_REG(base) & XBARA_SEL10_SEL21_MASK) >> XBARA_SEL10_SEL21_SHIFT)
#define XBARA_BRD_SEL10_SEL21(base) (BME_UBFX16(&XBARA_SEL10_REG(base), XBARA_SEL10_SEL21_SHIFT, XBARA_SEL10_SEL21_WIDTH))

/*! @brief Set the SEL21 field to a new value. */
#define XBARA_WR_SEL10_SEL21(base, value) (XBARA_RMW_SEL10(base, XBARA_SEL10_SEL21_MASK, XBARA_SEL10_SEL21(value)))
#define XBARA_BWR_SEL10_SEL21(base, value) (BME_BFI16(&XBARA_SEL10_REG(base), ((uint16_t)(value) << XBARA_SEL10_SEL21_SHIFT), XBARA_SEL10_SEL21_SHIFT, XBARA_SEL10_SEL21_WIDTH))
/*@}*/

