pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*******************************************************************************
 * XBARA_SEL11 - Crossbar A Select Register 11
 ******************************************************************************/

/*!
 * @brief XBARA_SEL11 - Crossbar A Select Register 11 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL11 register
 */
/*@{*/
#define XBARA_RD_SEL11(base)     (XBARA_SEL11_REG(base))
#define XBARA_WR_SEL11(base, value) (XBARA_SEL11_REG(base) = (value))
#define XBARA_RMW_SEL11(base, mask, value) (XBARA_WR_SEL11(base, (XBARA_RD_SEL11(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL11(base, value) (BME_OR16(&XBARA_SEL11_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL11(base, value) (BME_AND16(&XBARA_SEL11_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL11(base, value) (BME_XOR16(&XBARA_SEL11_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL11 bitfields
 */

/*!
 * @name Register XBARA_SEL11, field SEL22[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT22 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL11_SEL22 field. */
#define XBARA_RD_SEL11_SEL22(base) ((XBARA_SEL11_REG(base) & XBARA_SEL11_SEL22_MASK) >> XBARA_SEL11_SEL22_SHIFT)
#define XBARA_BRD_SEL11_SEL22(base) (BME_UBFX16(&XBARA_SEL11_REG(base), XBARA_SEL11_SEL22_SHIFT, XBARA_SEL11_SEL22_WIDTH))

/*! @brief Set the SEL22 field to a new value. */
#define XBARA_WR_SEL11_SEL22(base, value) (XBARA_RMW_SEL11(base, XBARA_SEL11_SEL22_MASK, XBARA_SEL11_SEL22(value)))
#define XBARA_BWR_SEL11_SEL22(base, value) (BME_BFI16(&XBARA_SEL11_REG(base), ((uint16_t)(value) << XBARA_SEL11_SEL22_SHIFT), XBARA_SEL11_SEL22_SHIFT, XBARA_SEL11_SEL22_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL11, field SEL23[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT23 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL11_SEL23 field. */
#define XBARA_RD_SEL11_SEL23(base) ((XBARA_SEL11_REG(base) & XBARA_SEL11_SEL23_MASK) >> XBARA_SEL11_SEL23_SHIFT)
#define XBARA_BRD_SEL11_SEL23(base) (BME_UBFX16(&XBARA_SEL11_REG(base), XBARA_SEL11_SEL23_SHIFT, XBARA_SEL11_SEL23_WIDTH))

/*! @brief Set the SEL23 field to a new value. */
#define XBARA_WR_SEL11_SEL23(base, value) (XBARA_RMW_SEL11(base, XBARA_SEL11_SEL23_MASK, XBARA_SEL11_SEL23(value)))
#define XBARA_BWR_SEL11_SEL23(base, value) (BME_BFI16(&XBARA_SEL11_REG(base), ((uint16_t)(value) << XBARA_SEL11_SEL23_SHIFT), XBARA_SEL11_SEL23_SHIFT, XBARA_SEL11_SEL23_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL12 - Crossbar A Select Register 12
 ******************************************************************************/

/*!
 * @brief XBARA_SEL12 - Crossbar A Select Register 12 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL12 register
 */
/*@{*/
#define XBARA_RD_SEL12(base)     (XBARA_SEL12_REG(base))
#define XBARA_WR_SEL12(base, value) (XBARA_SEL12_REG(base) = (value))
#define XBARA_RMW_SEL12(base, mask, value) (XBARA_WR_SEL12(base, (XBARA_RD_SEL12(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL12(base, value) (BME_OR16(&XBARA_SEL12_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL12(base, value) (BME_AND16(&XBARA_SEL12_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL12(base, value) (BME_XOR16(&XBARA_SEL12_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL12 bitfields
 */

/*!
 * @name Register XBARA_SEL12, field SEL24[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT24 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL12_SEL24 field. */
#define XBARA_RD_SEL12_SEL24(base) ((XBARA_SEL12_REG(base) & XBARA_SEL12_SEL24_MASK) >> XBARA_SEL12_SEL24_SHIFT)
#define XBARA_BRD_SEL12_SEL24(base) (BME_UBFX16(&XBARA_SEL12_REG(base), XBARA_SEL12_SEL24_SHIFT, XBARA_SEL12_SEL24_WIDTH))

/*! @brief Set the SEL24 field to a new value. */
#define XBARA_WR_SEL12_SEL24(base, value) (XBARA_RMW_SEL12(base, XBARA_SEL12_SEL24_MASK, XBARA_SEL12_SEL24(value)))
#define XBARA_BWR_SEL12_SEL24(base, value) (BME_BFI16(&XBARA_SEL12_REG(base), ((uint16_t)(value) << XBARA_SEL12_SEL24_SHIFT), XBARA_SEL12_SEL24_SHIFT, XBARA_SEL12_SEL24_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL12, field SEL25[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT25 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL12_SEL25 field. */
#define XBARA_RD_SEL12_SEL25(base) ((XBARA_SEL12_REG(base) & XBARA_SEL12_SEL25_MASK) >> XBARA_SEL12_SEL25_SHIFT)
#define XBARA_BRD_SEL12_SEL25(base) (BME_UBFX16(&XBARA_SEL12_REG(base), XBARA_SEL12_SEL25_SHIFT, XBARA_SEL12_SEL25_WIDTH))

/*! @brief Set the SEL25 field to a new value. */
#define XBARA_WR_SEL12_SEL25(base, value) (XBARA_RMW_SEL12(base, XBARA_SEL12_SEL25_MASK, XBARA_SEL12_SEL25(value)))
#define XBARA_BWR_SEL12_SEL25(base, value) (BME_BFI16(&XBARA_SEL12_REG(base), ((uint16_t)(value) << XBARA_SEL12_SEL25_SHIFT), XBARA_SEL12_SEL25_SHIFT, XBARA_SEL12_SEL25_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL13 - Crossbar A Select Register 13
 ******************************************************************************/

/*!
 * @brief XBARA_SEL13 - Crossbar A Select Register 13 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL13 register
 */
/*@{*/
#define XBARA_RD_SEL13(base)     (XBARA_SEL13_REG(base))
#define XBARA_WR_SEL13(base, value) (XBARA_SEL13_REG(base) = (value))
#define XBARA_RMW_SEL13(base, mask, value) (XBARA_WR_SEL13(base, (XBARA_RD_SEL13(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL13(base, value) (BME_OR16(&XBARA_SEL13_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL13(base, value) (BME_AND16(&XBARA_SEL13_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL13(base, value) (BME_XOR16(&XBARA_SEL13_REG(base), (uint16_t)(value)))
/*@}*/

