pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the SEL31 field to a new value. */
#define XBARA_WR_SEL15_SEL31(base, value) (XBARA_RMW_SEL15(base, XBARA_SEL15_SEL31_MASK, XBARA_SEL15_SEL31(value)))
#define XBARA_BWR_SEL15_SEL31(base, value) (BME_BFI16(&XBARA_SEL15_REG(base), ((uint16_t)(value) << XBARA_SEL15_SEL31_SHIFT), XBARA_SEL15_SEL31_SHIFT, XBARA_SEL15_SEL31_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL16 - Crossbar A Select Register 16
 ******************************************************************************/

/*!
 * @brief XBARA_SEL16 - Crossbar A Select Register 16 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL16 register
 */
/*@{*/
#define XBARA_RD_SEL16(base)     (XBARA_SEL16_REG(base))
#define XBARA_WR_SEL16(base, value) (XBARA_SEL16_REG(base) = (value))
#define XBARA_RMW_SEL16(base, mask, value) (XBARA_WR_SEL16(base, (XBARA_RD_SEL16(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL16(base, value) (BME_OR16(&XBARA_SEL16_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL16(base, value) (BME_AND16(&XBARA_SEL16_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL16(base, value) (BME_XOR16(&XBARA_SEL16_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL16 bitfields
 */

/*!
 * @name Register XBARA_SEL16, field SEL32[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT32 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL16_SEL32 field. */
#define XBARA_RD_SEL16_SEL32(base) ((XBARA_SEL16_REG(base) & XBARA_SEL16_SEL32_MASK) >> XBARA_SEL16_SEL32_SHIFT)
#define XBARA_BRD_SEL16_SEL32(base) (BME_UBFX16(&XBARA_SEL16_REG(base), XBARA_SEL16_SEL32_SHIFT, XBARA_SEL16_SEL32_WIDTH))

/*! @brief Set the SEL32 field to a new value. */
#define XBARA_WR_SEL16_SEL32(base, value) (XBARA_RMW_SEL16(base, XBARA_SEL16_SEL32_MASK, XBARA_SEL16_SEL32(value)))
#define XBARA_BWR_SEL16_SEL32(base, value) (BME_BFI16(&XBARA_SEL16_REG(base), ((uint16_t)(value) << XBARA_SEL16_SEL32_SHIFT), XBARA_SEL16_SEL32_SHIFT, XBARA_SEL16_SEL32_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL16, field SEL33[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT33 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL16_SEL33 field. */
#define XBARA_RD_SEL16_SEL33(base) ((XBARA_SEL16_REG(base) & XBARA_SEL16_SEL33_MASK) >> XBARA_SEL16_SEL33_SHIFT)
#define XBARA_BRD_SEL16_SEL33(base) (BME_UBFX16(&XBARA_SEL16_REG(base), XBARA_SEL16_SEL33_SHIFT, XBARA_SEL16_SEL33_WIDTH))

/*! @brief Set the SEL33 field to a new value. */
#define XBARA_WR_SEL16_SEL33(base, value) (XBARA_RMW_SEL16(base, XBARA_SEL16_SEL33_MASK, XBARA_SEL16_SEL33(value)))
#define XBARA_BWR_SEL16_SEL33(base, value) (BME_BFI16(&XBARA_SEL16_REG(base), ((uint16_t)(value) << XBARA_SEL16_SEL33_SHIFT), XBARA_SEL16_SEL33_SHIFT, XBARA_SEL16_SEL33_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL17 - Crossbar A Select Register 17
 ******************************************************************************/

/*!
 * @brief XBARA_SEL17 - Crossbar A Select Register 17 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL17 register
 */
/*@{*/
#define XBARA_RD_SEL17(base)     (XBARA_SEL17_REG(base))
#define XBARA_WR_SEL17(base, value) (XBARA_SEL17_REG(base) = (value))
#define XBARA_RMW_SEL17(base, mask, value) (XBARA_WR_SEL17(base, (XBARA_RD_SEL17(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL17(base, value) (BME_OR16(&XBARA_SEL17_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL17(base, value) (BME_AND16(&XBARA_SEL17_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL17(base, value) (BME_XOR16(&XBARA_SEL17_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL17 bitfields
 */

/*!
 * @name Register XBARA_SEL17, field SEL34[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT34 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL17_SEL34 field. */
#define XBARA_RD_SEL17_SEL34(base) ((XBARA_SEL17_REG(base) & XBARA_SEL17_SEL34_MASK) >> XBARA_SEL17_SEL34_SHIFT)
#define XBARA_BRD_SEL17_SEL34(base) (BME_UBFX16(&XBARA_SEL17_REG(base), XBARA_SEL17_SEL34_SHIFT, XBARA_SEL17_SEL34_WIDTH))

/*! @brief Set the SEL34 field to a new value. */
#define XBARA_WR_SEL17_SEL34(base, value) (XBARA_RMW_SEL17(base, XBARA_SEL17_SEL34_MASK, XBARA_SEL17_SEL34(value)))
#define XBARA_BWR_SEL17_SEL34(base, value) (BME_BFI16(&XBARA_SEL17_REG(base), ((uint16_t)(value) << XBARA_SEL17_SEL34_SHIFT), XBARA_SEL17_SEL34_SHIFT, XBARA_SEL17_SEL34_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL17, field SEL35[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT35 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL17_SEL35 field. */
#define XBARA_RD_SEL17_SEL35(base) ((XBARA_SEL17_REG(base) & XBARA_SEL17_SEL35_MASK) >> XBARA_SEL17_SEL35_SHIFT)
#define XBARA_BRD_SEL17_SEL35(base) (BME_UBFX16(&XBARA_SEL17_REG(base), XBARA_SEL17_SEL35_SHIFT, XBARA_SEL17_SEL35_WIDTH))

/*! @brief Set the SEL35 field to a new value. */
#define XBARA_WR_SEL17_SEL35(base, value) (XBARA_RMW_SEL17(base, XBARA_SEL17_SEL35_MASK, XBARA_SEL17_SEL35(value)))
#define XBARA_BWR_SEL17_SEL35(base, value) (BME_BFI16(&XBARA_SEL17_REG(base), ((uint16_t)(value) << XBARA_SEL17_SEL35_SHIFT), XBARA_SEL17_SEL35_SHIFT, XBARA_SEL17_SEL35_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL18 - Crossbar A Select Register 18
 ******************************************************************************/

/*!
 * @brief XBARA_SEL18 - Crossbar A Select Register 18 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL18 register
 */
/*@{*/
#define XBARA_RD_SEL18(base)     (XBARA_SEL18_REG(base))
#define XBARA_WR_SEL18(base, value) (XBARA_SEL18_REG(base) = (value))
#define XBARA_RMW_SEL18(base, mask, value) (XBARA_WR_SEL18(base, (XBARA_RD_SEL18(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL18(base, value) (BME_OR16(&XBARA_SEL18_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL18(base, value) (BME_AND16(&XBARA_SEL18_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL18(base, value) (BME_XOR16(&XBARA_SEL18_REG(base), (uint16_t)(value)))
/*@}*/

