pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual XBARA_SEL18 bitfields
 */

/*!
 * @name Register XBARA_SEL18, field SEL36[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT36 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL18_SEL36 field. */
#define XBARA_RD_SEL18_SEL36(base) ((XBARA_SEL18_REG(base) & XBARA_SEL18_SEL36_MASK) >> XBARA_SEL18_SEL36_SHIFT)
#define XBARA_BRD_SEL18_SEL36(base) (BME_UBFX16(&XBARA_SEL18_REG(base), XBARA_SEL18_SEL36_SHIFT, XBARA_SEL18_SEL36_WIDTH))

/*! @brief Set the SEL36 field to a new value. */
#define XBARA_WR_SEL18_SEL36(base, value) (XBARA_RMW_SEL18(base, XBARA_SEL18_SEL36_MASK, XBARA_SEL18_SEL36(value)))
#define XBARA_BWR_SEL18_SEL36(base, value) (BME_BFI16(&XBARA_SEL18_REG(base), ((uint16_t)(value) << XBARA_SEL18_SEL36_SHIFT), XBARA_SEL18_SEL36_SHIFT, XBARA_SEL18_SEL36_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL18, field SEL37[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT37 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL18_SEL37 field. */
#define XBARA_RD_SEL18_SEL37(base) ((XBARA_SEL18_REG(base) & XBARA_SEL18_SEL37_MASK) >> XBARA_SEL18_SEL37_SHIFT)
#define XBARA_BRD_SEL18_SEL37(base) (BME_UBFX16(&XBARA_SEL18_REG(base), XBARA_SEL18_SEL37_SHIFT, XBARA_SEL18_SEL37_WIDTH))

/*! @brief Set the SEL37 field to a new value. */
#define XBARA_WR_SEL18_SEL37(base, value) (XBARA_RMW_SEL18(base, XBARA_SEL18_SEL37_MASK, XBARA_SEL18_SEL37(value)))
#define XBARA_BWR_SEL18_SEL37(base, value) (BME_BFI16(&XBARA_SEL18_REG(base), ((uint16_t)(value) << XBARA_SEL18_SEL37_SHIFT), XBARA_SEL18_SEL37_SHIFT, XBARA_SEL18_SEL37_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL19 - Crossbar A Select Register 19
 ******************************************************************************/

/*!
 * @brief XBARA_SEL19 - Crossbar A Select Register 19 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL19 register
 */
/*@{*/
#define XBARA_RD_SEL19(base)     (XBARA_SEL19_REG(base))
#define XBARA_WR_SEL19(base, value) (XBARA_SEL19_REG(base) = (value))
#define XBARA_RMW_SEL19(base, mask, value) (XBARA_WR_SEL19(base, (XBARA_RD_SEL19(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL19(base, value) (BME_OR16(&XBARA_SEL19_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL19(base, value) (BME_AND16(&XBARA_SEL19_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL19(base, value) (BME_XOR16(&XBARA_SEL19_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL19 bitfields
 */

/*!
 * @name Register XBARA_SEL19, field SEL38[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT38 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL19_SEL38 field. */
#define XBARA_RD_SEL19_SEL38(base) ((XBARA_SEL19_REG(base) & XBARA_SEL19_SEL38_MASK) >> XBARA_SEL19_SEL38_SHIFT)
#define XBARA_BRD_SEL19_SEL38(base) (BME_UBFX16(&XBARA_SEL19_REG(base), XBARA_SEL19_SEL38_SHIFT, XBARA_SEL19_SEL38_WIDTH))

/*! @brief Set the SEL38 field to a new value. */
#define XBARA_WR_SEL19_SEL38(base, value) (XBARA_RMW_SEL19(base, XBARA_SEL19_SEL38_MASK, XBARA_SEL19_SEL38(value)))
#define XBARA_BWR_SEL19_SEL38(base, value) (BME_BFI16(&XBARA_SEL19_REG(base), ((uint16_t)(value) << XBARA_SEL19_SEL38_SHIFT), XBARA_SEL19_SEL38_SHIFT, XBARA_SEL19_SEL38_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL19, field SEL39[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT39 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL19_SEL39 field. */
#define XBARA_RD_SEL19_SEL39(base) ((XBARA_SEL19_REG(base) & XBARA_SEL19_SEL39_MASK) >> XBARA_SEL19_SEL39_SHIFT)
#define XBARA_BRD_SEL19_SEL39(base) (BME_UBFX16(&XBARA_SEL19_REG(base), XBARA_SEL19_SEL39_SHIFT, XBARA_SEL19_SEL39_WIDTH))

/*! @brief Set the SEL39 field to a new value. */
#define XBARA_WR_SEL19_SEL39(base, value) (XBARA_RMW_SEL19(base, XBARA_SEL19_SEL39_MASK, XBARA_SEL19_SEL39(value)))
#define XBARA_BWR_SEL19_SEL39(base, value) (BME_BFI16(&XBARA_SEL19_REG(base), ((uint16_t)(value) << XBARA_SEL19_SEL39_SHIFT), XBARA_SEL19_SEL39_SHIFT, XBARA_SEL19_SEL39_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL20 - Crossbar A Select Register 20
 ******************************************************************************/

/*!
 * @brief XBARA_SEL20 - Crossbar A Select Register 20 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL20 register
 */
/*@{*/
#define XBARA_RD_SEL20(base)     (XBARA_SEL20_REG(base))
#define XBARA_WR_SEL20(base, value) (XBARA_SEL20_REG(base) = (value))
#define XBARA_RMW_SEL20(base, mask, value) (XBARA_WR_SEL20(base, (XBARA_RD_SEL20(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL20(base, value) (BME_OR16(&XBARA_SEL20_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL20(base, value) (BME_AND16(&XBARA_SEL20_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL20(base, value) (BME_XOR16(&XBARA_SEL20_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL20 bitfields
 */

/*!
 * @name Register XBARA_SEL20, field SEL40[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT40 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL20_SEL40 field. */
#define XBARA_RD_SEL20_SEL40(base) ((XBARA_SEL20_REG(base) & XBARA_SEL20_SEL40_MASK) >> XBARA_SEL20_SEL40_SHIFT)
#define XBARA_BRD_SEL20_SEL40(base) (BME_UBFX16(&XBARA_SEL20_REG(base), XBARA_SEL20_SEL40_SHIFT, XBARA_SEL20_SEL40_WIDTH))

/*! @brief Set the SEL40 field to a new value. */
#define XBARA_WR_SEL20_SEL40(base, value) (XBARA_RMW_SEL20(base, XBARA_SEL20_SEL40_MASK, XBARA_SEL20_SEL40(value)))
#define XBARA_BWR_SEL20_SEL40(base, value) (BME_BFI16(&XBARA_SEL20_REG(base), ((uint16_t)(value) << XBARA_SEL20_SEL40_SHIFT), XBARA_SEL20_SEL40_SHIFT, XBARA_SEL20_SEL40_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL20, field SEL41[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT41 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL20_SEL41 field. */
#define XBARA_RD_SEL20_SEL41(base) ((XBARA_SEL20_REG(base) & XBARA_SEL20_SEL41_MASK) >> XBARA_SEL20_SEL41_SHIFT)
#define XBARA_BRD_SEL20_SEL41(base) (BME_UBFX16(&XBARA_SEL20_REG(base), XBARA_SEL20_SEL41_SHIFT, XBARA_SEL20_SEL41_WIDTH))

/*! @brief Set the SEL41 field to a new value. */
#define XBARA_WR_SEL20_SEL41(base, value) (XBARA_RMW_SEL20(base, XBARA_SEL20_SEL41_MASK, XBARA_SEL20_SEL41(value)))
#define XBARA_BWR_SEL20_SEL41(base, value) (BME_BFI16(&XBARA_SEL20_REG(base), ((uint16_t)(value) << XBARA_SEL20_SEL41_SHIFT), XBARA_SEL20_SEL41_SHIFT, XBARA_SEL20_SEL41_WIDTH))
/*@}*/

