pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual XBARA_SEL23 bitfields
 */

/*!
 * @name Register XBARA_SEL23, field SEL46[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT46 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL23_SEL46 field. */
#define XBARA_RD_SEL23_SEL46(base) ((XBARA_SEL23_REG(base) & XBARA_SEL23_SEL46_MASK) >> XBARA_SEL23_SEL46_SHIFT)
#define XBARA_BRD_SEL23_SEL46(base) (BME_UBFX16(&XBARA_SEL23_REG(base), XBARA_SEL23_SEL46_SHIFT, XBARA_SEL23_SEL46_WIDTH))

/*! @brief Set the SEL46 field to a new value. */
#define XBARA_WR_SEL23_SEL46(base, value) (XBARA_RMW_SEL23(base, XBARA_SEL23_SEL46_MASK, XBARA_SEL23_SEL46(value)))
#define XBARA_BWR_SEL23_SEL46(base, value) (BME_BFI16(&XBARA_SEL23_REG(base), ((uint16_t)(value) << XBARA_SEL23_SEL46_SHIFT), XBARA_SEL23_SEL46_SHIFT, XBARA_SEL23_SEL46_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL23, field SEL47[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT47 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL23_SEL47 field. */
#define XBARA_RD_SEL23_SEL47(base) ((XBARA_SEL23_REG(base) & XBARA_SEL23_SEL47_MASK) >> XBARA_SEL23_SEL47_SHIFT)
#define XBARA_BRD_SEL23_SEL47(base) (BME_UBFX16(&XBARA_SEL23_REG(base), XBARA_SEL23_SEL47_SHIFT, XBARA_SEL23_SEL47_WIDTH))

/*! @brief Set the SEL47 field to a new value. */
#define XBARA_WR_SEL23_SEL47(base, value) (XBARA_RMW_SEL23(base, XBARA_SEL23_SEL47_MASK, XBARA_SEL23_SEL47(value)))
#define XBARA_BWR_SEL23_SEL47(base, value) (BME_BFI16(&XBARA_SEL23_REG(base), ((uint16_t)(value) << XBARA_SEL23_SEL47_SHIFT), XBARA_SEL23_SEL47_SHIFT, XBARA_SEL23_SEL47_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL24 - Crossbar A Select Register 24
 ******************************************************************************/

/*!
 * @brief XBARA_SEL24 - Crossbar A Select Register 24 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL24 register
 */
/*@{*/
#define XBARA_RD_SEL24(base)     (XBARA_SEL24_REG(base))
#define XBARA_WR_SEL24(base, value) (XBARA_SEL24_REG(base) = (value))
#define XBARA_RMW_SEL24(base, mask, value) (XBARA_WR_SEL24(base, (XBARA_RD_SEL24(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL24(base, value) (BME_OR16(&XBARA_SEL24_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL24(base, value) (BME_AND16(&XBARA_SEL24_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL24(base, value) (BME_XOR16(&XBARA_SEL24_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL24 bitfields
 */

/*!
 * @name Register XBARA_SEL24, field SEL48[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT48 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL24_SEL48 field. */
#define XBARA_RD_SEL24_SEL48(base) ((XBARA_SEL24_REG(base) & XBARA_SEL24_SEL48_MASK) >> XBARA_SEL24_SEL48_SHIFT)
#define XBARA_BRD_SEL24_SEL48(base) (BME_UBFX16(&XBARA_SEL24_REG(base), XBARA_SEL24_SEL48_SHIFT, XBARA_SEL24_SEL48_WIDTH))

/*! @brief Set the SEL48 field to a new value. */
#define XBARA_WR_SEL24_SEL48(base, value) (XBARA_RMW_SEL24(base, XBARA_SEL24_SEL48_MASK, XBARA_SEL24_SEL48(value)))
#define XBARA_BWR_SEL24_SEL48(base, value) (BME_BFI16(&XBARA_SEL24_REG(base), ((uint16_t)(value) << XBARA_SEL24_SEL48_SHIFT), XBARA_SEL24_SEL48_SHIFT, XBARA_SEL24_SEL48_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL24, field SEL49[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT49 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL24_SEL49 field. */
#define XBARA_RD_SEL24_SEL49(base) ((XBARA_SEL24_REG(base) & XBARA_SEL24_SEL49_MASK) >> XBARA_SEL24_SEL49_SHIFT)
#define XBARA_BRD_SEL24_SEL49(base) (BME_UBFX16(&XBARA_SEL24_REG(base), XBARA_SEL24_SEL49_SHIFT, XBARA_SEL24_SEL49_WIDTH))

/*! @brief Set the SEL49 field to a new value. */
#define XBARA_WR_SEL24_SEL49(base, value) (XBARA_RMW_SEL24(base, XBARA_SEL24_SEL49_MASK, XBARA_SEL24_SEL49(value)))
#define XBARA_BWR_SEL24_SEL49(base, value) (BME_BFI16(&XBARA_SEL24_REG(base), ((uint16_t)(value) << XBARA_SEL24_SEL49_SHIFT), XBARA_SEL24_SEL49_SHIFT, XBARA_SEL24_SEL49_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARA_SEL25 - Crossbar A Select Register 25
 ******************************************************************************/

/*!
 * @brief XBARA_SEL25 - Crossbar A Select Register 25 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL25 register
 */
/*@{*/
#define XBARA_RD_SEL25(base)     (XBARA_SEL25_REG(base))
#define XBARA_WR_SEL25(base, value) (XBARA_SEL25_REG(base) = (value))
#define XBARA_RMW_SEL25(base, mask, value) (XBARA_WR_SEL25(base, (XBARA_RD_SEL25(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL25(base, value) (BME_OR16(&XBARA_SEL25_REG(base), (uint16_t)(value)))
#define XBARA_CLR_SEL25(base, value) (BME_AND16(&XBARA_SEL25_REG(base), (uint16_t)(~(value))))
#define XBARA_TOG_SEL25(base, value) (BME_XOR16(&XBARA_SEL25_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL25 bitfields
 */

/*!
 * @name Register XBARA_SEL25, field SEL50[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT50 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL25_SEL50 field. */
#define XBARA_RD_SEL25_SEL50(base) ((XBARA_SEL25_REG(base) & XBARA_SEL25_SEL50_MASK) >> XBARA_SEL25_SEL50_SHIFT)
#define XBARA_BRD_SEL25_SEL50(base) (BME_UBFX16(&XBARA_SEL25_REG(base), XBARA_SEL25_SEL50_SHIFT, XBARA_SEL25_SEL50_WIDTH))

/*! @brief Set the SEL50 field to a new value. */
#define XBARA_WR_SEL25_SEL50(base, value) (XBARA_RMW_SEL25(base, XBARA_SEL25_SEL50_MASK, XBARA_SEL25_SEL50(value)))
#define XBARA_BWR_SEL25_SEL50(base, value) (BME_BFI16(&XBARA_SEL25_REG(base), ((uint16_t)(value) << XBARA_SEL25_SEL50_SHIFT), XBARA_SEL25_SEL50_SHIFT, XBARA_SEL25_SEL50_WIDTH))
/*@}*/

/*!
 * @name Register XBARA_SEL25, field SEL51[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT51 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL25_SEL51 field. */
#define XBARA_RD_SEL25_SEL51(base) ((XBARA_SEL25_REG(base) & XBARA_SEL25_SEL51_MASK) >> XBARA_SEL25_SEL51_SHIFT)
#define XBARA_BRD_SEL25_SEL51(base) (BME_UBFX16(&XBARA_SEL25_REG(base), XBARA_SEL25_SEL51_SHIFT, XBARA_SEL25_SEL51_WIDTH))

/*! @brief Set the SEL51 field to a new value. */
#define XBARA_WR_SEL25_SEL51(base, value) (XBARA_RMW_SEL25(base, XBARA_SEL25_SEL51_MASK, XBARA_SEL25_SEL51(value)))
#define XBARA_BWR_SEL25_SEL51(base, value) (BME_BFI16(&XBARA_SEL25_REG(base), ((uint16_t)(value) << XBARA_SEL25_SEL51_SHIFT), XBARA_SEL25_SEL51_SHIFT, XBARA_SEL25_SEL51_WIDTH))
/*@}*/

