pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/* Macros for entire XBARA_CTRLx register. */
#define XBARA_CTRLx(base, outIndex)               (*(volatile uint16_t *)((uintptr_t)&XBARA_CTRL0_REG(base) + ((outIndex) / 2U) * 2U))

/* Set the XBARA_SELx_SELx field to a new value. */
#define XBARA_WR_SELx_SELx(base, outIndex, input) (XBARA_SELx((base), (outIndex)) = ((XBARA_SELx((base), (outIndex)) & ~(0xFFU << (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U)))) | ((input) << (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U)))))

/* Read current value of the XBARA_SELx_SELx field. */
#define XBARA_RD_SELx_SELx(base, outIndex)        ((XBARA_SELx((base), (outIndex)) >> (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))) & 0xFFU)

/* Set the XBARA_CTRLx_IENx field to a new value. */
#define XBARA_WR_CTRLx_IENx(base, outIndex, enable) (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 1U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))) = (enable))

/* Set the XBARA_CTRLx_DENx field to a new value. */
#define XBARA_WR_CTRLx_DENx(base, outIndex, enable) (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 0U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))) = (enable))

/* Read current value of the XBARA_CTRLx_IENx field. */
#define XBARA_RD_CTRLx_IENx(base, outIndex)       (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 1U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))))

/* Read current value of the XBARA_CTRLx_DENx field. */
#define XBARA_RD_CTRLx_DENx(base, outIndex)       (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 0U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))))

/* Set the XBARA_CTRLx_EDGEx field to a new value. */
#define XBARA_WR_CTRLx_EDGEx(base, outIndex, edge) (XBARA_CTRLx((base), (outIndex)) = ((XBARA_CTRLx((base), (outIndex)) & ~(3U << (2U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U)))) ) | ((edge) << (2U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))))))

/* Read current value of the XBARA_CTRLx_EDGEx field. */
#define XBARA_RD_CTRLx_EDGEx(base, outIndex)      ((XBARA_CTRLx((base), (outIndex)) >> (2U + XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))) & 0x3U)

/* Read current value of the XBARA_CTRLx_STSx field. */
#define XBARA_RD_CTRLx_STSx(base, outIndex)       (BITBAND_ACCESS16(&XBARA_CTRLx((base), (outIndex)), 4U + (XBARA_SEL0_SEL1_SHIFT * ((outIndex) % 2U))))

/* Clear the XBARA_CTRLx_STSx field value. */
#define XBARA_CLR_CTRLx_STSx(base, outIndex)      (XBARA_CTRLx((base), (outIndex)) = (XBARA_CTRLx((base), (outIndex)) & ~(1U << (4U + (XBARA_SEL0_SEL1_SHIFT * (((outIndex) + 1U) % 2U))))))

/*
 * MKV58F22 XBARB
 *
 * Crossbar Switch
 *
 * Registers defined in this header file:
 * - XBARB_SEL0 - Crossbar B Select Register 0
 * - XBARB_SEL1 - Crossbar B Select Register 1
 * - XBARB_SEL2 - Crossbar B Select Register 2
 * - XBARB_SEL3 - Crossbar B Select Register 3
 * - XBARB_SEL4 - Crossbar B Select Register 4
 * - XBARB_SEL5 - Crossbar B Select Register 5
 * - XBARB_SEL6 - Crossbar B Select Register 6
 * - XBARB_SEL7 - Crossbar B Select Register 7
 */

#define XBARB_INSTANCE_COUNT (1U) /*!< Number of instances of the XBARB module. */
#define XBARB_IDX (0U) /*!< Instance number for XBARB. */

/*******************************************************************************
 * XBARB_SEL0 - Crossbar B Select Register 0
 ******************************************************************************/

/*!
 * @brief XBARB_SEL0 - Crossbar B Select Register 0 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL0 register
 */
/*@{*/
#define XBARB_RD_SEL0(base)      (XBARB_SEL0_REG(base))
#define XBARB_WR_SEL0(base, value) (XBARB_SEL0_REG(base) = (value))
#define XBARB_RMW_SEL0(base, mask, value) (XBARB_WR_SEL0(base, (XBARB_RD_SEL0(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL0(base, value) (BME_OR16(&XBARB_SEL0_REG(base), (uint16_t)(value)))
#define XBARB_CLR_SEL0(base, value) (BME_AND16(&XBARB_SEL0_REG(base), (uint16_t)(~(value))))
#define XBARB_TOG_SEL0(base, value) (BME_XOR16(&XBARB_SEL0_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL0 bitfields
 */

/*!
 * @name Register XBARB_SEL0, field SEL0[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT0 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL0_SEL0 field. */
#define XBARB_RD_SEL0_SEL0(base) ((XBARB_SEL0_REG(base) & XBARB_SEL0_SEL0_MASK) >> XBARB_SEL0_SEL0_SHIFT)
#define XBARB_BRD_SEL0_SEL0(base) (BME_UBFX16(&XBARB_SEL0_REG(base), XBARB_SEL0_SEL0_SHIFT, XBARB_SEL0_SEL0_WIDTH))

/*! @brief Set the SEL0 field to a new value. */
#define XBARB_WR_SEL0_SEL0(base, value) (XBARB_RMW_SEL0(base, XBARB_SEL0_SEL0_MASK, XBARB_SEL0_SEL0(value)))
#define XBARB_BWR_SEL0_SEL0(base, value) (BME_BFI16(&XBARB_SEL0_REG(base), ((uint16_t)(value) << XBARB_SEL0_SEL0_SHIFT), XBARB_SEL0_SEL0_SHIFT, XBARB_SEL0_SEL0_WIDTH))
/*@}*/

/*!
 * @name Register XBARB_SEL0, field SEL1[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT1 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL0_SEL1 field. */
#define XBARB_RD_SEL0_SEL1(base) ((XBARB_SEL0_REG(base) & XBARB_SEL0_SEL1_MASK) >> XBARB_SEL0_SEL1_SHIFT)
#define XBARB_BRD_SEL0_SEL1(base) (BME_UBFX16(&XBARB_SEL0_REG(base), XBARB_SEL0_SEL1_SHIFT, XBARB_SEL0_SEL1_WIDTH))

/*! @brief Set the SEL1 field to a new value. */
#define XBARB_WR_SEL0_SEL1(base, value) (XBARB_RMW_SEL0(base, XBARB_SEL0_SEL1_MASK, XBARB_SEL0_SEL1(value)))
#define XBARB_BWR_SEL0_SEL1(base, value) (BME_BFI16(&XBARB_SEL0_REG(base), ((uint16_t)(value) << XBARB_SEL0_SEL1_SHIFT), XBARB_SEL0_SEL1_SHIFT, XBARB_SEL0_SEL1_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARB_SEL1 - Crossbar B Select Register 1
 ******************************************************************************/

/*!
 * @brief XBARB_SEL1 - Crossbar B Select Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL1 register
 */
/*@{*/
#define XBARB_RD_SEL1(base)      (XBARB_SEL1_REG(base))
#define XBARB_WR_SEL1(base, value) (XBARB_SEL1_REG(base) = (value))
#define XBARB_RMW_SEL1(base, mask, value) (XBARB_WR_SEL1(base, (XBARB_RD_SEL1(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL1(base, value) (BME_OR16(&XBARB_SEL1_REG(base), (uint16_t)(value)))
#define XBARB_CLR_SEL1(base, value) (BME_AND16(&XBARB_SEL1_REG(base), (uint16_t)(~(value))))
#define XBARB_TOG_SEL1(base, value) (BME_XOR16(&XBARB_SEL1_REG(base), (uint16_t)(value)))
/*@}*/

