pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*
 * Constants & macros for individual XBARB_SEL1 bitfields
 */

/*!
 * @name Register XBARB_SEL1, field SEL2[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT2 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL1_SEL2 field. */
#define XBARB_RD_SEL1_SEL2(base) ((XBARB_SEL1_REG(base) & XBARB_SEL1_SEL2_MASK) >> XBARB_SEL1_SEL2_SHIFT)
#define XBARB_BRD_SEL1_SEL2(base) (BME_UBFX16(&XBARB_SEL1_REG(base), XBARB_SEL1_SEL2_SHIFT, XBARB_SEL1_SEL2_WIDTH))

/*! @brief Set the SEL2 field to a new value. */
#define XBARB_WR_SEL1_SEL2(base, value) (XBARB_RMW_SEL1(base, XBARB_SEL1_SEL2_MASK, XBARB_SEL1_SEL2(value)))
#define XBARB_BWR_SEL1_SEL2(base, value) (BME_BFI16(&XBARB_SEL1_REG(base), ((uint16_t)(value) << XBARB_SEL1_SEL2_SHIFT), XBARB_SEL1_SEL2_SHIFT, XBARB_SEL1_SEL2_WIDTH))
/*@}*/

/*!
 * @name Register XBARB_SEL1, field SEL3[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT3 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL1_SEL3 field. */
#define XBARB_RD_SEL1_SEL3(base) ((XBARB_SEL1_REG(base) & XBARB_SEL1_SEL3_MASK) >> XBARB_SEL1_SEL3_SHIFT)
#define XBARB_BRD_SEL1_SEL3(base) (BME_UBFX16(&XBARB_SEL1_REG(base), XBARB_SEL1_SEL3_SHIFT, XBARB_SEL1_SEL3_WIDTH))

/*! @brief Set the SEL3 field to a new value. */
#define XBARB_WR_SEL1_SEL3(base, value) (XBARB_RMW_SEL1(base, XBARB_SEL1_SEL3_MASK, XBARB_SEL1_SEL3(value)))
#define XBARB_BWR_SEL1_SEL3(base, value) (BME_BFI16(&XBARB_SEL1_REG(base), ((uint16_t)(value) << XBARB_SEL1_SEL3_SHIFT), XBARB_SEL1_SEL3_SHIFT, XBARB_SEL1_SEL3_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARB_SEL2 - Crossbar B Select Register 2
 ******************************************************************************/

/*!
 * @brief XBARB_SEL2 - Crossbar B Select Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL2 register
 */
/*@{*/
#define XBARB_RD_SEL2(base)      (XBARB_SEL2_REG(base))
#define XBARB_WR_SEL2(base, value) (XBARB_SEL2_REG(base) = (value))
#define XBARB_RMW_SEL2(base, mask, value) (XBARB_WR_SEL2(base, (XBARB_RD_SEL2(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL2(base, value) (BME_OR16(&XBARB_SEL2_REG(base), (uint16_t)(value)))
#define XBARB_CLR_SEL2(base, value) (BME_AND16(&XBARB_SEL2_REG(base), (uint16_t)(~(value))))
#define XBARB_TOG_SEL2(base, value) (BME_XOR16(&XBARB_SEL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL2 bitfields
 */

/*!
 * @name Register XBARB_SEL2, field SEL4[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT4 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL2_SEL4 field. */
#define XBARB_RD_SEL2_SEL4(base) ((XBARB_SEL2_REG(base) & XBARB_SEL2_SEL4_MASK) >> XBARB_SEL2_SEL4_SHIFT)
#define XBARB_BRD_SEL2_SEL4(base) (BME_UBFX16(&XBARB_SEL2_REG(base), XBARB_SEL2_SEL4_SHIFT, XBARB_SEL2_SEL4_WIDTH))

/*! @brief Set the SEL4 field to a new value. */
#define XBARB_WR_SEL2_SEL4(base, value) (XBARB_RMW_SEL2(base, XBARB_SEL2_SEL4_MASK, XBARB_SEL2_SEL4(value)))
#define XBARB_BWR_SEL2_SEL4(base, value) (BME_BFI16(&XBARB_SEL2_REG(base), ((uint16_t)(value) << XBARB_SEL2_SEL4_SHIFT), XBARB_SEL2_SEL4_SHIFT, XBARB_SEL2_SEL4_WIDTH))
/*@}*/

/*!
 * @name Register XBARB_SEL2, field SEL5[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT5 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL2_SEL5 field. */
#define XBARB_RD_SEL2_SEL5(base) ((XBARB_SEL2_REG(base) & XBARB_SEL2_SEL5_MASK) >> XBARB_SEL2_SEL5_SHIFT)
#define XBARB_BRD_SEL2_SEL5(base) (BME_UBFX16(&XBARB_SEL2_REG(base), XBARB_SEL2_SEL5_SHIFT, XBARB_SEL2_SEL5_WIDTH))

/*! @brief Set the SEL5 field to a new value. */
#define XBARB_WR_SEL2_SEL5(base, value) (XBARB_RMW_SEL2(base, XBARB_SEL2_SEL5_MASK, XBARB_SEL2_SEL5(value)))
#define XBARB_BWR_SEL2_SEL5(base, value) (BME_BFI16(&XBARB_SEL2_REG(base), ((uint16_t)(value) << XBARB_SEL2_SEL5_SHIFT), XBARB_SEL2_SEL5_SHIFT, XBARB_SEL2_SEL5_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARB_SEL3 - Crossbar B Select Register 3
 ******************************************************************************/

/*!
 * @brief XBARB_SEL3 - Crossbar B Select Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL3 register
 */
/*@{*/
#define XBARB_RD_SEL3(base)      (XBARB_SEL3_REG(base))
#define XBARB_WR_SEL3(base, value) (XBARB_SEL3_REG(base) = (value))
#define XBARB_RMW_SEL3(base, mask, value) (XBARB_WR_SEL3(base, (XBARB_RD_SEL3(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL3(base, value) (BME_OR16(&XBARB_SEL3_REG(base), (uint16_t)(value)))
#define XBARB_CLR_SEL3(base, value) (BME_AND16(&XBARB_SEL3_REG(base), (uint16_t)(~(value))))
#define XBARB_TOG_SEL3(base, value) (BME_XOR16(&XBARB_SEL3_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL3 bitfields
 */

/*!
 * @name Register XBARB_SEL3, field SEL6[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT6 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL3_SEL6 field. */
#define XBARB_RD_SEL3_SEL6(base) ((XBARB_SEL3_REG(base) & XBARB_SEL3_SEL6_MASK) >> XBARB_SEL3_SEL6_SHIFT)
#define XBARB_BRD_SEL3_SEL6(base) (BME_UBFX16(&XBARB_SEL3_REG(base), XBARB_SEL3_SEL6_SHIFT, XBARB_SEL3_SEL6_WIDTH))

/*! @brief Set the SEL6 field to a new value. */
#define XBARB_WR_SEL3_SEL6(base, value) (XBARB_RMW_SEL3(base, XBARB_SEL3_SEL6_MASK, XBARB_SEL3_SEL6(value)))
#define XBARB_BWR_SEL3_SEL6(base, value) (BME_BFI16(&XBARB_SEL3_REG(base), ((uint16_t)(value) << XBARB_SEL3_SEL6_SHIFT), XBARB_SEL3_SEL6_SHIFT, XBARB_SEL3_SEL6_WIDTH))
/*@}*/

/*!
 * @name Register XBARB_SEL3, field SEL7[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT7 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL3_SEL7 field. */
#define XBARB_RD_SEL3_SEL7(base) ((XBARB_SEL3_REG(base) & XBARB_SEL3_SEL7_MASK) >> XBARB_SEL3_SEL7_SHIFT)
#define XBARB_BRD_SEL3_SEL7(base) (BME_UBFX16(&XBARB_SEL3_REG(base), XBARB_SEL3_SEL7_SHIFT, XBARB_SEL3_SEL7_WIDTH))

