pyocd/FlashAlgo/source/freescale/devices/MKV58F22/MKV58F22_extension.h
/*! @brief Set the SEL7 field to a new value. */
#define XBARB_WR_SEL3_SEL7(base, value) (XBARB_RMW_SEL3(base, XBARB_SEL3_SEL7_MASK, XBARB_SEL3_SEL7(value)))
#define XBARB_BWR_SEL3_SEL7(base, value) (BME_BFI16(&XBARB_SEL3_REG(base), ((uint16_t)(value) << XBARB_SEL3_SEL7_SHIFT), XBARB_SEL3_SEL7_SHIFT, XBARB_SEL3_SEL7_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARB_SEL4 - Crossbar B Select Register 4
 ******************************************************************************/

/*!
 * @brief XBARB_SEL4 - Crossbar B Select Register 4 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL4 register
 */
/*@{*/
#define XBARB_RD_SEL4(base)      (XBARB_SEL4_REG(base))
#define XBARB_WR_SEL4(base, value) (XBARB_SEL4_REG(base) = (value))
#define XBARB_RMW_SEL4(base, mask, value) (XBARB_WR_SEL4(base, (XBARB_RD_SEL4(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL4(base, value) (BME_OR16(&XBARB_SEL4_REG(base), (uint16_t)(value)))
#define XBARB_CLR_SEL4(base, value) (BME_AND16(&XBARB_SEL4_REG(base), (uint16_t)(~(value))))
#define XBARB_TOG_SEL4(base, value) (BME_XOR16(&XBARB_SEL4_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL4 bitfields
 */

/*!
 * @name Register XBARB_SEL4, field SEL8[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT8 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL4_SEL8 field. */
#define XBARB_RD_SEL4_SEL8(base) ((XBARB_SEL4_REG(base) & XBARB_SEL4_SEL8_MASK) >> XBARB_SEL4_SEL8_SHIFT)
#define XBARB_BRD_SEL4_SEL8(base) (BME_UBFX16(&XBARB_SEL4_REG(base), XBARB_SEL4_SEL8_SHIFT, XBARB_SEL4_SEL8_WIDTH))

/*! @brief Set the SEL8 field to a new value. */
#define XBARB_WR_SEL4_SEL8(base, value) (XBARB_RMW_SEL4(base, XBARB_SEL4_SEL8_MASK, XBARB_SEL4_SEL8(value)))
#define XBARB_BWR_SEL4_SEL8(base, value) (BME_BFI16(&XBARB_SEL4_REG(base), ((uint16_t)(value) << XBARB_SEL4_SEL8_SHIFT), XBARB_SEL4_SEL8_SHIFT, XBARB_SEL4_SEL8_WIDTH))
/*@}*/

/*!
 * @name Register XBARB_SEL4, field SEL9[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT9 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL4_SEL9 field. */
#define XBARB_RD_SEL4_SEL9(base) ((XBARB_SEL4_REG(base) & XBARB_SEL4_SEL9_MASK) >> XBARB_SEL4_SEL9_SHIFT)
#define XBARB_BRD_SEL4_SEL9(base) (BME_UBFX16(&XBARB_SEL4_REG(base), XBARB_SEL4_SEL9_SHIFT, XBARB_SEL4_SEL9_WIDTH))

/*! @brief Set the SEL9 field to a new value. */
#define XBARB_WR_SEL4_SEL9(base, value) (XBARB_RMW_SEL4(base, XBARB_SEL4_SEL9_MASK, XBARB_SEL4_SEL9(value)))
#define XBARB_BWR_SEL4_SEL9(base, value) (BME_BFI16(&XBARB_SEL4_REG(base), ((uint16_t)(value) << XBARB_SEL4_SEL9_SHIFT), XBARB_SEL4_SEL9_SHIFT, XBARB_SEL4_SEL9_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARB_SEL5 - Crossbar B Select Register 5
 ******************************************************************************/

/*!
 * @brief XBARB_SEL5 - Crossbar B Select Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL5 register
 */
/*@{*/
#define XBARB_RD_SEL5(base)      (XBARB_SEL5_REG(base))
#define XBARB_WR_SEL5(base, value) (XBARB_SEL5_REG(base) = (value))
#define XBARB_RMW_SEL5(base, mask, value) (XBARB_WR_SEL5(base, (XBARB_RD_SEL5(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL5(base, value) (BME_OR16(&XBARB_SEL5_REG(base), (uint16_t)(value)))
#define XBARB_CLR_SEL5(base, value) (BME_AND16(&XBARB_SEL5_REG(base), (uint16_t)(~(value))))
#define XBARB_TOG_SEL5(base, value) (BME_XOR16(&XBARB_SEL5_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBARB_SEL5 bitfields
 */

/*!
 * @name Register XBARB_SEL5, field SEL10[4:0] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT10 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL5_SEL10 field. */
#define XBARB_RD_SEL5_SEL10(base) ((XBARB_SEL5_REG(base) & XBARB_SEL5_SEL10_MASK) >> XBARB_SEL5_SEL10_SHIFT)
#define XBARB_BRD_SEL5_SEL10(base) (BME_UBFX16(&XBARB_SEL5_REG(base), XBARB_SEL5_SEL10_SHIFT, XBARB_SEL5_SEL10_WIDTH))

/*! @brief Set the SEL10 field to a new value. */
#define XBARB_WR_SEL5_SEL10(base, value) (XBARB_RMW_SEL5(base, XBARB_SEL5_SEL10_MASK, XBARB_SEL5_SEL10(value)))
#define XBARB_BWR_SEL5_SEL10(base, value) (BME_BFI16(&XBARB_SEL5_REG(base), ((uint16_t)(value) << XBARB_SEL5_SEL10_SHIFT), XBARB_SEL5_SEL10_SHIFT, XBARB_SEL5_SEL10_WIDTH))
/*@}*/

/*!
 * @name Register XBARB_SEL5, field SEL11[12:8] (RW)
 *
 * Input (XBARB_INn) to be muxed to XBARB_OUT11 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARB_SEL5_SEL11 field. */
#define XBARB_RD_SEL5_SEL11(base) ((XBARB_SEL5_REG(base) & XBARB_SEL5_SEL11_MASK) >> XBARB_SEL5_SEL11_SHIFT)
#define XBARB_BRD_SEL5_SEL11(base) (BME_UBFX16(&XBARB_SEL5_REG(base), XBARB_SEL5_SEL11_SHIFT, XBARB_SEL5_SEL11_WIDTH))

/*! @brief Set the SEL11 field to a new value. */
#define XBARB_WR_SEL5_SEL11(base, value) (XBARB_RMW_SEL5(base, XBARB_SEL5_SEL11_MASK, XBARB_SEL5_SEL11(value)))
#define XBARB_BWR_SEL5_SEL11(base, value) (BME_BFI16(&XBARB_SEL5_REG(base), ((uint16_t)(value) << XBARB_SEL5_SEL11_SHIFT), XBARB_SEL5_SEL11_SHIFT, XBARB_SEL5_SEL11_WIDTH))
/*@}*/

/*******************************************************************************
 * XBARB_SEL6 - Crossbar B Select Register 6
 ******************************************************************************/

/*!
 * @brief XBARB_SEL6 - Crossbar B Select Register 6 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARB_SEL6 register
 */
/*@{*/
#define XBARB_RD_SEL6(base)      (XBARB_SEL6_REG(base))
#define XBARB_WR_SEL6(base, value) (XBARB_SEL6_REG(base) = (value))
#define XBARB_RMW_SEL6(base, mask, value) (XBARB_WR_SEL6(base, (XBARB_RD_SEL6(base) & ~(mask)) | (value)))
#define XBARB_SET_SEL6(base, value) (BME_OR16(&XBARB_SEL6_REG(base), (uint16_t)(value)))
#define XBARB_CLR_SEL6(base, value) (BME_AND16(&XBARB_SEL6_REG(base), (uint16_t)(~(value))))
#define XBARB_TOG_SEL6(base, value) (BME_XOR16(&XBARB_SEL6_REG(base), (uint16_t)(value)))
/*@}*/

